; ModuleID = 'anchor_spl.6371d9f8-cgu.0'
source_filename = "anchor_spl.6371d9f8-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"anchor_lang::prelude::Pubkey" = type { [32 x i8] }
%"std::result::Result<token::InitializeMint, anchor_lang::error::Error>" = type { i64, [21 x i64] }
%"std::result::Result<std::convert::Infallible, anchor_lang::error::Error>::Err" = type { %"anchor_lang::error::Error" }
%"anchor_lang::error::Error" = type { i64, [20 x i64] }
%"std::result::Result<token::InitializeMint, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }
%"std::result::Result<u64, anchor_lang::error::Error>" = type { i64, [21 x i64] }
%"std::result::Result<std::convert::Infallible, anchor_lang::prelude::ProgramError>::Err" = type { %"anchor_lang::prelude::ProgramError" }
%"anchor_lang::prelude::ProgramError" = type { i32, [7 x i32] }
%"std::result::Result<u64, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }
%"std::result::Result<token::ThawAccount, anchor_lang::error::Error>" = type { i64, [21 x i64] }
%"std::result::Result<token::ThawAccount, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }
%"std::result::Result<token::CloseAccount, anchor_lang::error::Error>" = type { i64, [21 x i64] }
%"std::result::Result<token::CloseAccount, anchor_lang::error::Error>::Err" = type { [1 x i64], %"anchor_lang::error::Error" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ID", linkageName: "_ZN10anchor_spl4mint3srm2ID17hd5699e20f5342775E", scope: !2, file: !5, line: 6, type: !6, isLocal: false, isDefinition: true, align: 1)
!2 = !DINamespace(name: "srm", scope: !3)
!3 = !DINamespace(name: "mint", scope: !4)
!4 = !DINamespace(name: "anchor_spl", scope: null)
!5 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.25.0/src/mint.rs", directory: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.25.0", checksumkind: CSK_MD5, checksum: "911e6cf7a437f47aba27e6c240fc562a")
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pubkey", scope: !8, file: !7, size: 256, align: 8, elements: !10, templateParams: !16, identifier: "a81210f31f9b20ffe048629424c3a0e6")
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "pubkey", scope: !9)
!9 = !DINamespace(name: "solana_program", scope: null)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !6, file: !7, baseType: !12, size: 256, align: 8)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, align: 8, elements: !14)
!13 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!14 = !{!15}
!15 = !DISubrange(count: 32, lowerBound: 0)
!16 = !{}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "ID", linkageName: "_ZN10anchor_spl4mint4usdc2ID17h959a9ce376188deaE", scope: !19, file: !5, line: 12, type: !6, isLocal: false, isDefinition: true, align: 1)
!19 = !DINamespace(name: "usdc", scope: !3)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !7, type: !22, isLocal: true, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !7, align: 64, flags: DIFlagArtificial, elements: !16, vtableHolder: !23, identifier: "vtable")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Account", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Account", scope: !25, file: !7, size: 1408, align: 64, elements: !27, templateParams: !16, identifier: "2e4abced68372a42a11d8dec20973992")
!25 = !DINamespace(name: "state", scope: !26)
!26 = !DINamespace(name: "spl_token", scope: null)
!27 = !{!28, !29, !30, !32, !48, !54, !67, !68}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !24, file: !7, baseType: !6, size: 256, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !24, file: !7, baseType: !6, size: 256, align: 8, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "amount", scope: !24, file: !7, baseType: !31, size: 64, align: 64, offset: 512)
!31 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "delegate", scope: !24, file: !7, baseType: !33, size: 288, align: 32, offset: 576)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "COption<solana_program::pubkey::Pubkey>", scope: !34, file: !7, size: 288, align: 32, elements: !35, identifier: "5c353c62ec21b4254cfee51ba33b7c1f")
!34 = !DINamespace(name: "program_option", scope: !9)
!35 = !{!36}
!36 = !DICompositeType(tag: DW_TAG_variant_part, scope: !34, file: !7, size: 288, align: 32, elements: !37, templateParams: !40, identifier: "5c353c62ec21b4254cfee51ba33b7c1f_variant_part", discriminator: !46)
!37 = !{!38, !42}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !36, file: !7, baseType: !39, size: 288, align: 32, extraData: i64 0)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !33, file: !7, size: 288, align: 32, elements: !16, templateParams: !40, identifier: "5c353c62ec21b4254cfee51ba33b7c1f::None")
!40 = !{!41}
!41 = !DITemplateTypeParameter(name: "T", type: !6)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !36, file: !7, baseType: !43, size: 288, align: 32, extraData: i64 1)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !33, file: !7, size: 288, align: 32, elements: !44, templateParams: !40, identifier: "5c353c62ec21b4254cfee51ba33b7c1f::Some")
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !43, file: !7, baseType: !6, size: 256, align: 8, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, scope: !34, file: !7, baseType: !47, size: 32, align: 32, flags: DIFlagArtificial)
!47 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !24, file: !7, baseType: !49, size: 8, align: 8, offset: 864)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AccountState", scope: !25, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "Initialized", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "Frozen", value: 2, isUnsigned: true)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "is_native", scope: !24, file: !7, baseType: !55, size: 128, align: 64, offset: 896)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "COption<u64>", scope: !34, file: !7, size: 128, align: 64, elements: !56, identifier: "15993b8f38371f5531f1207a725d6406")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_variant_part, scope: !34, file: !7, size: 128, align: 64, elements: !58, templateParams: !61, identifier: "15993b8f38371f5531f1207a725d6406_variant_part", discriminator: !46)
!58 = !{!59, !63}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !57, file: !7, baseType: !60, size: 128, align: 64, extraData: i64 0)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !55, file: !7, size: 128, align: 64, elements: !16, templateParams: !61, identifier: "15993b8f38371f5531f1207a725d6406::None")
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "T", type: !31)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !57, file: !7, baseType: !64, size: 128, align: 64, extraData: i64 1)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !7, size: 128, align: 64, elements: !65, templateParams: !61, identifier: "15993b8f38371f5531f1207a725d6406::Some")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !7, baseType: !31, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "delegated_amount", scope: !24, file: !7, baseType: !31, size: 64, align: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "close_authority", scope: !24, file: !7, baseType: !33, size: 288, align: 32, offset: 1088)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !7, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !7, align: 64, flags: DIFlagArtificial, elements: !16, vtableHolder: !72, identifier: "vtable")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Mint", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mint", scope: !25, file: !7, size: 704, align: 64, elements: !74, templateParams: !16, identifier: "70cdd83e0e491d8fc05130952dff7087")
!74 = !{!75, !76, !77, !78, !80}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mint_authority", scope: !73, file: !7, baseType: !33, size: 288, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "supply", scope: !73, file: !7, baseType: !31, size: 64, align: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "decimals", scope: !73, file: !7, baseType: !13, size: 8, align: 8, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !73, file: !7, baseType: !79, size: 8, align: 8, offset: 392)
!79 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_authority", scope: !73, file: !7, baseType: !33, size: 288, align: 32, offset: 416)
!81 = !{i32 7, !"PIC Level", i32 2}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !84, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !85, globals: !108)
!84 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.25.0/src/lib.rs", directory: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/anchor-spl-0.25.0")
!85 = !{!86, !49, !92, !101}
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !87, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !89)
!87 = !DINamespace(name: "result", scope: !88)
!88 = !DINamespace(name: "core", scope: null)
!89 = !{!90, !91}
!90 = !DIEnumerator(name: "Ok", value: 0)
!91 = !DIEnumerator(name: "Err", value: 1)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !93, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !96)
!93 = !DINamespace(name: "v1", scope: !94)
!94 = !DINamespace(name: "rt", scope: !95)
!95 = !DINamespace(name: "fmt", scope: !88)
!96 = !{!97, !98, !99, !100}
!97 = !DIEnumerator(name: "Left", value: 0)
!98 = !DIEnumerator(name: "Right", value: 1)
!99 = !DIEnumerator(name: "Center", value: 2)
!100 = !DIEnumerator(name: "Unknown", value: 3)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AuthorityType", scope: !102, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !103)
!102 = !DINamespace(name: "instruction", scope: !26)
!103 = !{!104, !105, !106, !107}
!104 = !DIEnumerator(name: "MintTokens", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "FreezeAccount", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "AccountOwner", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "CloseAccount", value: 3, isUnsigned: true)
!108 = !{!0, !17, !20, !69}
!109 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::InitializeMint, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h13441914e8b0cddfE", scope: !111, file: !110, line: 1913, type: !112, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !421, retainedNodes: !417)
!110 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "f73030f150a3926f0f5a346ed13cef73")
!111 = !DINamespace(name: "{impl#37}", scope: !87)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !403}
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::InitializeMint, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !115, identifier: "1a09ff8ededcc4f6fdb6c5bd9c87df35")
!115 = !{!116}
!116 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !117, templateParams: !223, identifier: "1a09ff8ededcc4f6fdb6c5bd9c87df35_variant_part", discriminator: !402)
!117 = !{!118, !398}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !116, file: !7, baseType: !119, size: 1408, align: 64, extraData: i64 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !114, file: !7, size: 1408, align: 64, elements: !120, templateParams: !223, identifier: "1a09ff8ededcc4f6fdb6c5bd9c87df35::Ok")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !119, file: !7, baseType: !122, size: 768, align: 64, offset: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "InitializeMint", scope: !123, file: !7, size: 768, align: 64, elements: !124, templateParams: !16, identifier: "c813b33bfee647b944e228f491ad204a")
!123 = !DINamespace(name: "token", scope: !4)
!124 = !{!125, !222}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !122, file: !7, baseType: !126, size: 384, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountInfo", scope: !127, file: !7, size: 384, align: 64, elements: !128, templateParams: !16, identifier: "2a2d21d971673a11e7cb67e0e1bbcd25")
!127 = !DINamespace(name: "account_info", scope: !9)
!128 = !{!129, !131, !132, !133, !186, !219, !220, !221}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !126, file: !7, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Pubkey", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "is_signer", scope: !126, file: !7, baseType: !79, size: 8, align: 8, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "is_writable", scope: !126, file: !7, baseType: !79, size: 8, align: 8, offset: 328)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "lamports", scope: !126, file: !7, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut u64>>", scope: !135, file: !7, size: 64, align: 64, elements: !137, templateParams: !179, identifier: "6ef7b15072feeefd759461885cf3019e")
!135 = !DINamespace(name: "rc", scope: !136)
!136 = !DINamespace(name: "alloc", scope: null)
!137 = !{!138, !183}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !134, file: !7, baseType: !139, size: 64, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !140, file: !7, size: 64, align: 64, elements: !142, templateParams: !181, identifier: "d2d32bd76a770e3b785a79f0ea18809c")
!140 = !DINamespace(name: "non_null", scope: !141)
!141 = !DINamespace(name: "ptr", scope: !88)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !139, file: !7, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut u64>>", baseType: !145, size: 64, align: 64, dwarfAddressSpace: 0)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut u64>>", scope: !135, file: !7, size: 256, align: 64, elements: !146, templateParams: !179, identifier: "cd940ff313dfbf2c8cc0f66ebb255962")
!146 = !{!147, !158, !159}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !145, file: !7, baseType: !148, size: 64, align: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !149, file: !7, size: 64, align: 64, elements: !150, templateParams: !156, identifier: "d610ccc56ed6bc2d95c5846672673907")
!149 = !DINamespace(name: "cell", scope: !88)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !148, file: !7, baseType: !152, size: 64, align: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !149, file: !7, size: 64, align: 64, elements: !153, templateParams: !156, identifier: "df37019b130d2c01fbc34865afbd6522")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !152, file: !7, baseType: !155, size: 64, align: 64)
!155 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!156 = !{!157}
!157 = !DITemplateTypeParameter(name: "T", type: !155)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !145, file: !7, baseType: !148, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !145, file: !7, baseType: !160, size: 128, align: 64, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut u64>", scope: !149, file: !7, size: 128, align: 64, elements: !161, templateParams: !177, identifier: "7d2673a3f332cc6d0037c3d8efd0c31")
!161 = !{!162, !172}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !160, file: !7, baseType: !163, size: 64, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<isize>", scope: !149, file: !7, size: 64, align: 64, elements: !164, templateParams: !170, identifier: "4e95b0f2a1a1d843af31431b8d46a5a9")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !163, file: !7, baseType: !166, size: 64, align: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !149, file: !7, size: 64, align: 64, elements: !167, templateParams: !170, identifier: "a478319df2321c642b07e6e189247bf")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !166, file: !7, baseType: !169, size: 64, align: 64)
!169 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "T", type: !169)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !160, file: !7, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut u64>", scope: !149, file: !7, size: 64, align: 64, elements: !174, templateParams: !177, identifier: "fede724123caa5feb7f972fe06520498")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !173, file: !7, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u64", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "T", type: !176)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !160)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "T", type: !145)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !134, file: !7, baseType: !184, align: 8)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !185, file: !7, align: 8, elements: !16, templateParams: !181, identifier: "b13e3795bbeaa5fcb9501203d2a3f0a3")
!185 = !DINamespace(name: "marker", scope: !88)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !7, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut [u8]>>", scope: !135, file: !7, size: 64, align: 64, elements: !188, templateParams: !213, identifier: "3be54905e4a87e92cc158a3b6326395f")
!188 = !{!189, !217}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !187, file: !7, baseType: !190, size: 64, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !140, file: !7, size: 64, align: 64, elements: !191, templateParams: !215, identifier: "d4796e70143da55513d65b6d5d324f4e")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !190, file: !7, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut [u8]>>", baseType: !194, size: 64, align: 64, dwarfAddressSpace: 0)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut [u8]>>", scope: !135, file: !7, size: 320, align: 64, elements: !195, templateParams: !213, identifier: "ec7aebffa1601b4d3001fa488717db04")
!195 = !{!196, !197, !198}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !194, file: !7, baseType: !148, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !194, file: !7, baseType: !148, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !194, file: !7, baseType: !199, size: 192, align: 64, offset: 128)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut [u8]>", scope: !149, file: !7, size: 192, align: 64, elements: !200, templateParams: !211, identifier: "7b8d8c983afddbdb1c520939bc6434de")
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !199, file: !7, baseType: !163, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !7, baseType: !203, size: 128, align: 64, offset: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut [u8]>", scope: !149, file: !7, size: 128, align: 64, elements: !204, templateParams: !211, identifier: "832d880ad3cb9da2c7f8e74d7eb471dc")
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !7, baseType: !206, size: 128, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !7, size: 128, align: 64, elements: !207, templateParams: !16, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!207 = !{!208, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !206, file: !7, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !206, file: !7, baseType: !155, size: 64, align: 64, offset: 64)
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "T", type: !206)
!213 = !{!214}
!214 = !DITemplateTypeParameter(name: "T", type: !199)
!215 = !{!216}
!216 = !DITemplateTypeParameter(name: "T", type: !194)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !187, file: !7, baseType: !218, align: 8)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !185, file: !7, align: 8, elements: !16, templateParams: !215, identifier: "be8bb6f9922b714c56ddf772f9c2429f")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !126, file: !7, baseType: !130, size: 64, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !126, file: !7, baseType: !79, size: 8, align: 8, offset: 336)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "rent_epoch", scope: !126, file: !7, baseType: !31, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rent", scope: !122, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!223 = !{!224, !225}
!224 = !DITemplateTypeParameter(name: "T", type: !122)
!225 = !DITemplateTypeParameter(name: "E", type: !226)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !227, file: !7, size: 1344, align: 64, elements: !229, identifier: "805cad6af91bcc5e68fa4f09dd1c00b")
!227 = !DINamespace(name: "error", scope: !228)
!228 = !DINamespace(name: "anchor_lang", scope: null)
!229 = !{!230}
!230 = !DICompositeType(tag: DW_TAG_variant_part, scope: !227, file: !7, size: 1344, align: 64, elements: !231, templateParams: !16, identifier: "805cad6af91bcc5e68fa4f09dd1c00b_variant_part", discriminator: !298)
!231 = !{!232, !339}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "AnchorError", scope: !230, file: !7, baseType: !233, size: 1344, align: 64, extraData: i64 0)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnchorError", scope: !226, file: !7, size: 1344, align: 64, elements: !234, templateParams: !16, identifier: "805cad6af91bcc5e68fa4f09dd1c00b::AnchorError")
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !233, file: !7, baseType: !236, size: 1280, align: 64, offset: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnchorError", scope: !227, file: !7, size: 1280, align: 64, elements: !237, templateParams: !16, identifier: "5d752e90586856652a140c694e090fa6")
!237 = !{!238, !266, !267, !268, !304}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "error_name", scope: !236, file: !7, baseType: !239, size: 192, align: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !240, file: !7, size: 192, align: 64, elements: !241, templateParams: !16, identifier: "96eaa147e4cb6ee42e5dcd78906547cd")
!240 = !DINamespace(name: "string", scope: !136)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !239, file: !7, baseType: !243, size: 192, align: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !244, file: !7, size: 192, align: 64, elements: !245, templateParams: !263, identifier: "56aa0380f8224c92be7dc99cfce9180f")
!244 = !DINamespace(name: "vec", scope: !136)
!245 = !{!246, !265}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !7, baseType: !247, size: 128, align: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !248, file: !7, size: 128, align: 64, elements: !249, templateParams: !263, identifier: "47ed2282bf82d40f2b2c1ebc77e9f331")
!248 = !DINamespace(name: "raw_vec", scope: !136)
!249 = !{!250, !259, !260}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !247, file: !7, baseType: !251, size: 64, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !252, file: !7, size: 64, align: 64, elements: !253, templateParams: !257, identifier: "76ad11c5918345b022d81965d637386")
!252 = !DINamespace(name: "unique", scope: !141)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !251, file: !7, baseType: !209, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !251, file: !7, baseType: !256, align: 8)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !185, file: !7, align: 8, elements: !16, templateParams: !257, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!257 = !{!258}
!258 = !DITemplateTypeParameter(name: "T", type: !13)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !247, file: !7, baseType: !155, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !247, file: !7, baseType: !261, align: 8)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !262, file: !7, align: 8, elements: !16, templateParams: !16, identifier: "9d0734f8822fbd33e4e561ab380af08d")
!262 = !DINamespace(name: "alloc", scope: !136)
!263 = !{!258, !264}
!264 = !DITemplateTypeParameter(name: "A", type: !261)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !7, baseType: !155, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "error_code_number", scope: !236, file: !7, baseType: !47, size: 32, align: 32, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "error_msg", scope: !236, file: !7, baseType: !239, size: 192, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "error_origin", scope: !236, file: !7, baseType: !269, size: 256, align: 64, offset: 384)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<anchor_lang::error::ErrorOrigin>", scope: !270, file: !7, size: 256, align: 64, elements: !271, identifier: "16c74e842f3366d7eeaec9267604c162")
!270 = !DINamespace(name: "option", scope: !88)
!271 = !{!272}
!272 = !DICompositeType(tag: DW_TAG_variant_part, scope: !270, file: !7, size: 256, align: 64, elements: !273, templateParams: !276, identifier: "16c74e842f3366d7eeaec9267604c162_variant_part", discriminator: !303)
!273 = !{!274, !299}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !272, file: !7, baseType: !275, size: 256, align: 64, extraData: i64 2)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !269, file: !7, size: 256, align: 64, elements: !16, templateParams: !276, identifier: "16c74e842f3366d7eeaec9267604c162::None")
!276 = !{!277}
!277 = !DITemplateTypeParameter(name: "T", type: !278)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorOrigin", scope: !227, file: !7, size: 256, align: 64, elements: !279, identifier: "b2e7dd4b6b786ae729b030a268ac3f85")
!279 = !{!280}
!280 = !DICompositeType(tag: DW_TAG_variant_part, scope: !227, file: !7, size: 256, align: 64, elements: !281, templateParams: !16, identifier: "b2e7dd4b6b786ae729b030a268ac3f85_variant_part", discriminator: !298)
!281 = !{!282, !294}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Source", scope: !280, file: !7, baseType: !283, size: 256, align: 64, extraData: i64 0)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Source", scope: !278, file: !7, size: 256, align: 64, elements: !284, templateParams: !16, identifier: "b2e7dd4b6b786ae729b030a268ac3f85::Source")
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !283, file: !7, baseType: !286, size: 192, align: 64, offset: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "Source", scope: !227, file: !7, size: 192, align: 64, elements: !287, templateParams: !16, identifier: "a9e4426f1790ba8b87cde1b3b112d770")
!287 = !{!288, !293}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !286, file: !7, baseType: !289, size: 128, align: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !290, templateParams: !16, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !289, file: !7, baseType: !209, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !289, file: !7, baseType: !155, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !286, file: !7, baseType: !47, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "AccountName", scope: !280, file: !7, baseType: !295, size: 256, align: 64, extraData: i64 1)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountName", scope: !278, file: !7, size: 256, align: 64, elements: !296, templateParams: !16, identifier: "b2e7dd4b6b786ae729b030a268ac3f85::AccountName")
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !295, file: !7, baseType: !239, size: 192, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !7, baseType: !31, size: 64, align: 64, flags: DIFlagArtificial)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !272, file: !7, baseType: !300, size: 256, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !269, file: !7, size: 256, align: 64, elements: !301, templateParams: !276, identifier: "16c74e842f3366d7eeaec9267604c162::Some")
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !300, file: !7, baseType: !278, size: 256, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !270, file: !7, baseType: !31, size: 64, align: 64, flags: DIFlagArtificial)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "compared_values", scope: !236, file: !7, baseType: !305, size: 576, align: 64, offset: 640)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<anchor_lang::error::ComparedValues>", scope: !270, file: !7, size: 576, align: 64, elements: !306, identifier: "2c9abcdebad81b1a64a7d547698752c8")
!306 = !{!307}
!307 = !DICompositeType(tag: DW_TAG_variant_part, scope: !270, file: !7, size: 576, align: 64, elements: !308, templateParams: !311, identifier: "2c9abcdebad81b1a64a7d547698752c8_variant_part", discriminator: !338)
!308 = !{!309, !334}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !307, file: !7, baseType: !310, size: 576, align: 64, extraData: i64 2)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !305, file: !7, size: 576, align: 64, elements: !16, templateParams: !311, identifier: "2c9abcdebad81b1a64a7d547698752c8::None")
!311 = !{!312}
!312 = !DITemplateTypeParameter(name: "T", type: !313)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComparedValues", scope: !227, file: !7, size: 576, align: 64, elements: !314, identifier: "156b3721166ff2c44140e46c3af6a042")
!314 = !{!315}
!315 = !DICompositeType(tag: DW_TAG_variant_part, scope: !227, file: !7, size: 576, align: 64, elements: !316, templateParams: !16, identifier: "156b3721166ff2c44140e46c3af6a042_variant_part", discriminator: !333)
!316 = !{!317, !325}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Values", scope: !315, file: !7, baseType: !318, size: 576, align: 64, extraData: i64 0)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Values", scope: !313, file: !7, size: 576, align: 64, elements: !319, templateParams: !16, identifier: "156b3721166ff2c44140e46c3af6a042::Values")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !318, file: !7, baseType: !321, size: 384, align: 64, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::string::String, alloc::string::String)", file: !7, size: 384, align: 64, elements: !322, templateParams: !16, identifier: "6b54b63138331f2463f41a05a138ccd0")
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !321, file: !7, baseType: !239, size: 192, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !321, file: !7, baseType: !239, size: 192, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Pubkeys", scope: !315, file: !7, baseType: !326, size: 576, align: 64, extraData: i64 1)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pubkeys", scope: !313, file: !7, size: 576, align: 64, elements: !327, templateParams: !16, identifier: "156b3721166ff2c44140e46c3af6a042::Pubkeys")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !7, baseType: !329, size: 512, align: 8, offset: 8)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "(solana_program::pubkey::Pubkey, solana_program::pubkey::Pubkey)", file: !7, size: 512, align: 8, elements: !330, templateParams: !16, identifier: "d1a34a4f0652688e68453ea7f10dff98")
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !329, file: !7, baseType: !6, size: 256, align: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !329, file: !7, baseType: !6, size: 256, align: 8, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !307, file: !7, baseType: !335, size: 576, align: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !305, file: !7, size: 576, align: 64, elements: !336, templateParams: !311, identifier: "2c9abcdebad81b1a64a7d547698752c8::Some")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !335, file: !7, baseType: !313, size: 576, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, scope: !270, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ProgramError", scope: !230, file: !7, baseType: !340, size: 1344, align: 64, extraData: i64 1)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramError", scope: !226, file: !7, size: 1344, align: 64, elements: !341, templateParams: !16, identifier: "805cad6af91bcc5e68fa4f09dd1c00b::ProgramError")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !340, file: !7, baseType: !343, size: 1088, align: 64, offset: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramErrorWithOrigin", scope: !227, file: !7, size: 1088, align: 64, elements: !344, templateParams: !16, identifier: "90e110387e6cb42deb210c74bf4257e8")
!344 = !{!345, !396, !397}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "program_error", scope: !343, file: !7, baseType: !346, size: 256, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramError", scope: !347, file: !7, size: 256, align: 64, elements: !348, identifier: "14e28924a5bbfb62cb524b675ea2c03a")
!347 = !DINamespace(name: "program_error", scope: !9)
!348 = !{!349}
!349 = !DICompositeType(tag: DW_TAG_variant_part, scope: !347, file: !7, size: 256, align: 64, elements: !350, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a_variant_part", discriminator: !395)
!350 = !{!351, !355, !357, !359, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !381, !385, !387, !389, !391, !393}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !349, file: !7, baseType: !352, size: 256, align: 64, extraData: i64 0)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !346, file: !7, size: 256, align: 64, elements: !353, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::Custom")
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !352, file: !7, baseType: !47, size: 32, align: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidArgument", scope: !349, file: !7, baseType: !356, size: 256, align: 64, extraData: i64 1)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidArgument", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidArgument")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidInstructionData", scope: !349, file: !7, baseType: !358, size: 256, align: 64, extraData: i64 2)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidInstructionData", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidInstructionData")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidAccountData", scope: !349, file: !7, baseType: !360, size: 256, align: 64, extraData: i64 3)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidAccountData", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidAccountData")
!361 = !DIDerivedType(tag: DW_TAG_member, name: "AccountDataTooSmall", scope: !349, file: !7, baseType: !362, size: 256, align: 64, extraData: i64 4)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountDataTooSmall", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountDataTooSmall")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "InsufficientFunds", scope: !349, file: !7, baseType: !364, size: 256, align: 64, extraData: i64 5)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "InsufficientFunds", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InsufficientFunds")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "IncorrectProgramId", scope: !349, file: !7, baseType: !366, size: 256, align: 64, extraData: i64 6)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "IncorrectProgramId", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::IncorrectProgramId")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "MissingRequiredSignature", scope: !349, file: !7, baseType: !368, size: 256, align: 64, extraData: i64 7)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "MissingRequiredSignature", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::MissingRequiredSignature")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "AccountAlreadyInitialized", scope: !349, file: !7, baseType: !370, size: 256, align: 64, extraData: i64 8)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountAlreadyInitialized", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountAlreadyInitialized")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "UninitializedAccount", scope: !349, file: !7, baseType: !372, size: 256, align: 64, extraData: i64 9)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "UninitializedAccount", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::UninitializedAccount")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "NotEnoughAccountKeys", scope: !349, file: !7, baseType: !374, size: 256, align: 64, extraData: i64 10)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotEnoughAccountKeys", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::NotEnoughAccountKeys")
!375 = !DIDerivedType(tag: DW_TAG_member, name: "AccountBorrowFailed", scope: !349, file: !7, baseType: !376, size: 256, align: 64, extraData: i64 11)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountBorrowFailed", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountBorrowFailed")
!377 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSeedLengthExceeded", scope: !349, file: !7, baseType: !378, size: 256, align: 64, extraData: i64 12)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxSeedLengthExceeded", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::MaxSeedLengthExceeded")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidSeeds", scope: !349, file: !7, baseType: !380, size: 256, align: 64, extraData: i64 13)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidSeeds", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidSeeds")
!381 = !DIDerivedType(tag: DW_TAG_member, name: "BorshIoError", scope: !349, file: !7, baseType: !382, size: 256, align: 64, extraData: i64 14)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorshIoError", scope: !346, file: !7, size: 256, align: 64, elements: !383, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::BorshIoError")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !382, file: !7, baseType: !239, size: 192, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "AccountNotRentExempt", scope: !349, file: !7, baseType: !386, size: 256, align: 64, extraData: i64 15)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountNotRentExempt", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountNotRentExempt")
!387 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedSysvar", scope: !349, file: !7, baseType: !388, size: 256, align: 64, extraData: i64 16)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsupportedSysvar", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::UnsupportedSysvar")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "IllegalOwner", scope: !349, file: !7, baseType: !390, size: 256, align: 64, extraData: i64 17)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "IllegalOwner", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::IllegalOwner")
!391 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAccountsDataSizeExceeded", scope: !349, file: !7, baseType: !392, size: 256, align: 64, extraData: i64 18)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxAccountsDataSizeExceeded", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::MaxAccountsDataSizeExceeded")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidRealloc", scope: !349, file: !7, baseType: !394, size: 256, align: 64, extraData: i64 19)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidRealloc", scope: !346, file: !7, size: 256, align: 64, elements: !16, templateParams: !16, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidRealloc")
!395 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !7, baseType: !47, size: 32, align: 32, flags: DIFlagArtificial)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "error_origin", scope: !343, file: !7, baseType: !269, size: 256, align: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "compared_values", scope: !343, file: !7, baseType: !305, size: 576, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !116, file: !7, baseType: !399, size: 1408, align: 64, extraData: i64 1)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !114, file: !7, size: 1408, align: 64, elements: !400, templateParams: !223, identifier: "1a09ff8ededcc4f6fdb6c5bd9c87df35::Err")
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !399, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !87, file: !7, baseType: !31, size: 64, align: 64, flags: DIFlagArtificial)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, anchor_lang::error::Error>", scope: !87, file: !7, size: 1344, align: 64, elements: !404, identifier: "b77a06f95c4560683307161a15d17072")
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1344, align: 64, elements: !406, templateParams: !411, identifier: "b77a06f95c4560683307161a15d17072_variant_part")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !405, file: !7, baseType: !408, size: 1344, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !403, file: !7, size: 1344, align: 64, elements: !409, templateParams: !411, identifier: "b77a06f95c4560683307161a15d17072::Err")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !408, file: !7, baseType: !226, size: 1344, align: 64)
!411 = !{!412, !225}
!412 = !DITemplateTypeParameter(name: "T", type: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !414, file: !7, align: 8, elements: !415, identifier: "866eee8446b1bfa4f6d9cf9584e40412")
!414 = !DINamespace(name: "convert", scope: !88)
!415 = !{!416}
!416 = !DICompositeType(tag: DW_TAG_variant_part, scope: !414, file: !7, align: 8, elements: !16, templateParams: !16, identifier: "866eee8446b1bfa4f6d9cf9584e40412_variant_part")
!417 = !{!418, !419}
!418 = !DILocalVariable(name: "residual", arg: 1, scope: !109, file: !110, line: 1913, type: !403)
!419 = !DILocalVariable(name: "e", scope: !420, file: !110, line: 1915, type: !226, align: 8)
!420 = distinct !DILexicalBlock(scope: !109, file: !110, line: 1915, column: 13)
!421 = !{!224, !225, !422}
!422 = !DITemplateTypeParameter(name: "F", type: !226)
!423 = !DILocation(line: 1913, column: 22, scope: !109)
!424 = !DILocation(line: 1915, column: 17, scope: !420)
!425 = !DILocation(line: 1915, column: 17, scope: !109)
!426 = !DILocation(line: 1915, column: 38, scope: !420)
!427 = !DILocation(line: 1915, column: 27, scope: !420)
!428 = !DILocation(line: 1915, column: 23, scope: !420)
!429 = !DILocation(line: 1917, column: 6, scope: !109)
!430 = distinct !DISubprogram(name: "from_residual<u64, solana_program::program_error::ProgramError, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h17586b5da9b1825bE", scope: !111, file: !110, line: 1913, type: !431, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !460, retainedNodes: !456)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !446}
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !434, identifier: "b478355ee1d9683dacc746ff084ae322")
!434 = !{!435}
!435 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !436, templateParams: !441, identifier: "b478355ee1d9683dacc746ff084ae322_variant_part", discriminator: !402)
!436 = !{!437, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !435, file: !7, baseType: !438, size: 1408, align: 64, extraData: i64 0)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !433, file: !7, size: 1408, align: 64, elements: !439, templateParams: !441, identifier: "b478355ee1d9683dacc746ff084ae322::Ok")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !438, file: !7, baseType: !31, size: 64, align: 64, offset: 64)
!441 = !{!62, !225}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !435, file: !7, baseType: !443, size: 1408, align: 64, extraData: i64 1)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !433, file: !7, size: 1408, align: 64, elements: !444, templateParams: !441, identifier: "b478355ee1d9683dacc746ff084ae322::Err")
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !443, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, solana_program::program_error::ProgramError>", scope: !87, file: !7, size: 256, align: 64, elements: !447, identifier: "9cb65280a51cabfe1e54267e762e33de")
!447 = !{!448}
!448 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 256, align: 64, elements: !449, templateParams: !454, identifier: "9cb65280a51cabfe1e54267e762e33de_variant_part")
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !448, file: !7, baseType: !451, size: 256, align: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !446, file: !7, size: 256, align: 64, elements: !452, templateParams: !454, identifier: "9cb65280a51cabfe1e54267e762e33de::Err")
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !451, file: !7, baseType: !346, size: 256, align: 64)
!454 = !{!412, !455}
!455 = !DITemplateTypeParameter(name: "E", type: !346)
!456 = !{!457, !458}
!457 = !DILocalVariable(name: "residual", arg: 1, scope: !430, file: !110, line: 1913, type: !446)
!458 = !DILocalVariable(name: "e", scope: !459, file: !110, line: 1915, type: !346, align: 8)
!459 = distinct !DILexicalBlock(scope: !430, file: !110, line: 1915, column: 13)
!460 = !{!62, !455, !422}
!461 = !DILocation(line: 1913, column: 22, scope: !430)
!462 = !DILocation(line: 1915, column: 17, scope: !459)
!463 = !DILocation(line: 1915, column: 17, scope: !430)
!464 = !DILocation(line: 1915, column: 38, scope: !459)
!465 = !DILocation(line: 1915, column: 27, scope: !459)
!466 = !DILocation(line: 1915, column: 23, scope: !459)
!467 = !DILocation(line: 1917, column: 6, scope: !430)
!468 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::ThawAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h334202f4a15c0584E", scope: !111, file: !110, line: 1913, type: !469, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !494, retainedNodes: !490)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !403}
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::ThawAccount, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !472, identifier: "b16aa9dd6eddd2a5381e9574d06442c")
!472 = !{!473}
!473 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !474, templateParams: !484, identifier: "b16aa9dd6eddd2a5381e9574d06442c_variant_part", discriminator: !402)
!474 = !{!475, !486}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !473, file: !7, baseType: !476, size: 1408, align: 64, extraData: i64 0)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !471, file: !7, size: 1408, align: 64, elements: !477, templateParams: !484, identifier: "b16aa9dd6eddd2a5381e9574d06442c::Ok")
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !476, file: !7, baseType: !479, size: 1152, align: 64, offset: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThawAccount", scope: !123, file: !7, size: 1152, align: 64, elements: !480, templateParams: !16, identifier: "f2b88932adeb38fdd20b271cfa082f17")
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !479, file: !7, baseType: !126, size: 384, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !479, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !479, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!484 = !{!485, !225}
!485 = !DITemplateTypeParameter(name: "T", type: !479)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !473, file: !7, baseType: !487, size: 1408, align: 64, extraData: i64 1)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !471, file: !7, size: 1408, align: 64, elements: !488, templateParams: !484, identifier: "b16aa9dd6eddd2a5381e9574d06442c::Err")
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !487, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!490 = !{!491, !492}
!491 = !DILocalVariable(name: "residual", arg: 1, scope: !468, file: !110, line: 1913, type: !403)
!492 = !DILocalVariable(name: "e", scope: !493, file: !110, line: 1915, type: !226, align: 8)
!493 = distinct !DILexicalBlock(scope: !468, file: !110, line: 1915, column: 13)
!494 = !{!485, !225, !422}
!495 = !DILocation(line: 1913, column: 22, scope: !468)
!496 = !DILocation(line: 1915, column: 17, scope: !493)
!497 = !DILocation(line: 1915, column: 17, scope: !468)
!498 = !DILocation(line: 1915, column: 38, scope: !493)
!499 = !DILocation(line: 1915, column: 27, scope: !493)
!500 = !DILocation(line: 1915, column: 23, scope: !493)
!501 = !DILocation(line: 1917, column: 6, scope: !468)
!502 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::CloseAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h5c4de6601a6d5c54E", scope: !111, file: !110, line: 1913, type: !503, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !528, retainedNodes: !524)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !403}
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::CloseAccount, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !506, identifier: "3b556abb2d7f5acf364f4eac8fdc62f0")
!506 = !{!507}
!507 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !508, templateParams: !518, identifier: "3b556abb2d7f5acf364f4eac8fdc62f0_variant_part", discriminator: !402)
!508 = !{!509, !520}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !507, file: !7, baseType: !510, size: 1408, align: 64, extraData: i64 0)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !505, file: !7, size: 1408, align: 64, elements: !511, templateParams: !518, identifier: "3b556abb2d7f5acf364f4eac8fdc62f0::Ok")
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !510, file: !7, baseType: !513, size: 1152, align: 64, offset: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "CloseAccount", scope: !123, file: !7, size: 1152, align: 64, elements: !514, templateParams: !16, identifier: "cc7d68487945ce5f5dea5a800bff6240")
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !513, file: !7, baseType: !126, size: 384, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !513, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !513, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!518 = !{!519, !225}
!519 = !DITemplateTypeParameter(name: "T", type: !513)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !507, file: !7, baseType: !521, size: 1408, align: 64, extraData: i64 1)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !505, file: !7, size: 1408, align: 64, elements: !522, templateParams: !518, identifier: "3b556abb2d7f5acf364f4eac8fdc62f0::Err")
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !521, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!524 = !{!525, !526}
!525 = !DILocalVariable(name: "residual", arg: 1, scope: !502, file: !110, line: 1913, type: !403)
!526 = !DILocalVariable(name: "e", scope: !527, file: !110, line: 1915, type: !226, align: 8)
!527 = distinct !DILexicalBlock(scope: !502, file: !110, line: 1915, column: 13)
!528 = !{!519, !225, !422}
!529 = !DILocation(line: 1913, column: 22, scope: !502)
!530 = !DILocation(line: 1915, column: 17, scope: !527)
!531 = !DILocation(line: 1915, column: 17, scope: !502)
!532 = !DILocation(line: 1915, column: 38, scope: !527)
!533 = !DILocation(line: 1915, column: 27, scope: !527)
!534 = !DILocation(line: 1915, column: 23, scope: !527)
!535 = !DILocation(line: 1917, column: 6, scope: !502)
!536 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::SetAuthority, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h60167d1e35ff63d4E", scope: !111, file: !110, line: 1913, type: !537, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !561, retainedNodes: !557)
!537 = !DISubroutineType(types: !538)
!538 = !{!539, !403}
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::SetAuthority, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !540, identifier: "6038040346ee8b2f25cec7f8f1874fbe")
!540 = !{!541}
!541 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !542, templateParams: !551, identifier: "6038040346ee8b2f25cec7f8f1874fbe_variant_part", discriminator: !402)
!542 = !{!543, !553}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !541, file: !7, baseType: !544, size: 1408, align: 64, extraData: i64 0)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !539, file: !7, size: 1408, align: 64, elements: !545, templateParams: !551, identifier: "6038040346ee8b2f25cec7f8f1874fbe::Ok")
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !544, file: !7, baseType: !547, size: 768, align: 64, offset: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "SetAuthority", scope: !123, file: !7, size: 768, align: 64, elements: !548, templateParams: !16, identifier: "1e7bd1bf5c94ef14902e84bc2bef872e")
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "current_authority", scope: !547, file: !7, baseType: !126, size: 384, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "account_or_mint", scope: !547, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!551 = !{!552, !225}
!552 = !DITemplateTypeParameter(name: "T", type: !547)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !541, file: !7, baseType: !554, size: 1408, align: 64, extraData: i64 1)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !539, file: !7, size: 1408, align: 64, elements: !555, templateParams: !551, identifier: "6038040346ee8b2f25cec7f8f1874fbe::Err")
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !554, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!557 = !{!558, !559}
!558 = !DILocalVariable(name: "residual", arg: 1, scope: !536, file: !110, line: 1913, type: !403)
!559 = !DILocalVariable(name: "e", scope: !560, file: !110, line: 1915, type: !226, align: 8)
!560 = distinct !DILexicalBlock(scope: !536, file: !110, line: 1915, column: 13)
!561 = !{!552, !225, !422}
!562 = !DILocation(line: 1913, column: 22, scope: !536)
!563 = !DILocation(line: 1915, column: 17, scope: !560)
!564 = !DILocation(line: 1915, column: 17, scope: !536)
!565 = !DILocation(line: 1915, column: 38, scope: !560)
!566 = !DILocation(line: 1915, column: 27, scope: !560)
!567 = !DILocation(line: 1915, column: 23, scope: !560)
!568 = !DILocation(line: 1917, column: 6, scope: !536)
!569 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::Revoke, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h6e704bb98eb53a8fE", scope: !111, file: !110, line: 1913, type: !570, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !594, retainedNodes: !590)
!570 = !DISubroutineType(types: !571)
!571 = !{!572, !403}
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::Revoke, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !573, identifier: "252e561d7d38186710b7d691ba51a7ac")
!573 = !{!574}
!574 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !575, templateParams: !584, identifier: "252e561d7d38186710b7d691ba51a7ac_variant_part", discriminator: !402)
!575 = !{!576, !586}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !574, file: !7, baseType: !577, size: 1408, align: 64, extraData: i64 0)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !572, file: !7, size: 1408, align: 64, elements: !578, templateParams: !584, identifier: "252e561d7d38186710b7d691ba51a7ac::Ok")
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !577, file: !7, baseType: !580, size: 768, align: 64, offset: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Revoke", scope: !123, file: !7, size: 768, align: 64, elements: !581, templateParams: !16, identifier: "c79c281e954354bdc4830d44e3a88b37")
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !580, file: !7, baseType: !126, size: 384, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !580, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!584 = !{!585, !225}
!585 = !DITemplateTypeParameter(name: "T", type: !580)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !574, file: !7, baseType: !587, size: 1408, align: 64, extraData: i64 1)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !572, file: !7, size: 1408, align: 64, elements: !588, templateParams: !584, identifier: "252e561d7d38186710b7d691ba51a7ac::Err")
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !587, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!590 = !{!591, !592}
!591 = !DILocalVariable(name: "residual", arg: 1, scope: !569, file: !110, line: 1913, type: !403)
!592 = !DILocalVariable(name: "e", scope: !593, file: !110, line: 1915, type: !226, align: 8)
!593 = distinct !DILexicalBlock(scope: !569, file: !110, line: 1915, column: 13)
!594 = !{!585, !225, !422}
!595 = !DILocation(line: 1913, column: 22, scope: !569)
!596 = !DILocation(line: 1915, column: 17, scope: !593)
!597 = !DILocation(line: 1915, column: 17, scope: !569)
!598 = !DILocation(line: 1915, column: 38, scope: !593)
!599 = !DILocation(line: 1915, column: 27, scope: !593)
!600 = !DILocation(line: 1915, column: 23, scope: !593)
!601 = !DILocation(line: 1917, column: 6, scope: !569)
!602 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::MintTo, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h701ed55b07b55ae1E", scope: !111, file: !110, line: 1913, type: !603, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !628, retainedNodes: !624)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !403}
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::MintTo, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !606, identifier: "52d9ddf10727e25c0d0df32d1345902")
!606 = !{!607}
!607 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !608, templateParams: !618, identifier: "52d9ddf10727e25c0d0df32d1345902_variant_part", discriminator: !402)
!608 = !{!609, !620}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !607, file: !7, baseType: !610, size: 1408, align: 64, extraData: i64 0)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !605, file: !7, size: 1408, align: 64, elements: !611, templateParams: !618, identifier: "52d9ddf10727e25c0d0df32d1345902::Ok")
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !610, file: !7, baseType: !613, size: 1152, align: 64, offset: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "MintTo", scope: !123, file: !7, size: 1152, align: 64, elements: !614, templateParams: !16, identifier: "6beb395da70577e0741e6c71e2e5d2e1")
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !613, file: !7, baseType: !126, size: 384, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !613, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !613, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!618 = !{!619, !225}
!619 = !DITemplateTypeParameter(name: "T", type: !613)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !607, file: !7, baseType: !621, size: 1408, align: 64, extraData: i64 1)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !605, file: !7, size: 1408, align: 64, elements: !622, templateParams: !618, identifier: "52d9ddf10727e25c0d0df32d1345902::Err")
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !621, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!624 = !{!625, !626}
!625 = !DILocalVariable(name: "residual", arg: 1, scope: !602, file: !110, line: 1913, type: !403)
!626 = !DILocalVariable(name: "e", scope: !627, file: !110, line: 1915, type: !226, align: 8)
!627 = distinct !DILexicalBlock(scope: !602, file: !110, line: 1915, column: 13)
!628 = !{!619, !225, !422}
!629 = !DILocation(line: 1913, column: 22, scope: !602)
!630 = !DILocation(line: 1915, column: 17, scope: !627)
!631 = !DILocation(line: 1915, column: 17, scope: !602)
!632 = !DILocation(line: 1915, column: 38, scope: !627)
!633 = !DILocation(line: 1915, column: 27, scope: !627)
!634 = !DILocation(line: 1915, column: 23, scope: !627)
!635 = !DILocation(line: 1917, column: 6, scope: !602)
!636 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::Burn, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h7d101cc8a76b9c36E", scope: !111, file: !110, line: 1913, type: !637, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !662, retainedNodes: !658)
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !403}
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::Burn, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !640, identifier: "a456244f880a08426e4860bde0ca2290")
!640 = !{!641}
!641 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !642, templateParams: !652, identifier: "a456244f880a08426e4860bde0ca2290_variant_part", discriminator: !402)
!642 = !{!643, !654}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !641, file: !7, baseType: !644, size: 1408, align: 64, extraData: i64 0)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !639, file: !7, size: 1408, align: 64, elements: !645, templateParams: !652, identifier: "a456244f880a08426e4860bde0ca2290::Ok")
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !644, file: !7, baseType: !647, size: 1152, align: 64, offset: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "Burn", scope: !123, file: !7, size: 1152, align: 64, elements: !648, templateParams: !16, identifier: "735516e2b4c87c78f953e8c0d516b37f")
!648 = !{!649, !650, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !647, file: !7, baseType: !126, size: 384, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !647, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !647, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!652 = !{!653, !225}
!653 = !DITemplateTypeParameter(name: "T", type: !647)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !641, file: !7, baseType: !655, size: 1408, align: 64, extraData: i64 1)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !639, file: !7, size: 1408, align: 64, elements: !656, templateParams: !652, identifier: "a456244f880a08426e4860bde0ca2290::Err")
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !655, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!658 = !{!659, !660}
!659 = !DILocalVariable(name: "residual", arg: 1, scope: !636, file: !110, line: 1913, type: !403)
!660 = !DILocalVariable(name: "e", scope: !661, file: !110, line: 1915, type: !226, align: 8)
!661 = distinct !DILexicalBlock(scope: !636, file: !110, line: 1915, column: 13)
!662 = !{!653, !225, !422}
!663 = !DILocation(line: 1913, column: 22, scope: !636)
!664 = !DILocation(line: 1915, column: 17, scope: !661)
!665 = !DILocation(line: 1915, column: 17, scope: !636)
!666 = !DILocation(line: 1915, column: 38, scope: !661)
!667 = !DILocation(line: 1915, column: 27, scope: !661)
!668 = !DILocation(line: 1915, column: 23, scope: !661)
!669 = !DILocation(line: 1917, column: 6, scope: !636)
!670 = distinct !DISubprogram(name: "from_residual<anchor_spl::associated_token::Create, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h7f123a6875568169E", scope: !111, file: !110, line: 1913, type: !671, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !701, retainedNodes: !697)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !403}
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::associated_token::Create, anchor_lang::error::Error>", scope: !87, file: !7, size: 2752, align: 64, elements: !674, identifier: "3d0591851b291c9a6b31339df00d2b7f")
!674 = !{!675}
!675 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 2752, align: 64, elements: !676, templateParams: !691, identifier: "3d0591851b291c9a6b31339df00d2b7f_variant_part", discriminator: !402)
!676 = !{!677, !693}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !675, file: !7, baseType: !678, size: 2752, align: 64, extraData: i64 0)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !673, file: !7, size: 2752, align: 64, elements: !679, templateParams: !691, identifier: "3d0591851b291c9a6b31339df00d2b7f::Ok")
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !678, file: !7, baseType: !681, size: 2688, align: 64, offset: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Create", scope: !682, file: !7, size: 2688, align: 64, elements: !683, templateParams: !16, identifier: "21934d6e6c3ceeb02738641f814c190d")
!682 = !DINamespace(name: "associated_token", scope: !4)
!683 = !{!684, !685, !686, !687, !688, !689, !690}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "payer", scope: !681, file: !7, baseType: !126, size: 384, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "associated_token", scope: !681, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !681, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !681, file: !7, baseType: !126, size: 384, align: 64, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "system_program", scope: !681, file: !7, baseType: !126, size: 384, align: 64, offset: 1536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "token_program", scope: !681, file: !7, baseType: !126, size: 384, align: 64, offset: 1920)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rent", scope: !681, file: !7, baseType: !126, size: 384, align: 64, offset: 2304)
!691 = !{!692, !225}
!692 = !DITemplateTypeParameter(name: "T", type: !681)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !675, file: !7, baseType: !694, size: 2752, align: 64, extraData: i64 1)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !673, file: !7, size: 2752, align: 64, elements: !695, templateParams: !691, identifier: "3d0591851b291c9a6b31339df00d2b7f::Err")
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !694, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!697 = !{!698, !699}
!698 = !DILocalVariable(name: "residual", arg: 1, scope: !670, file: !110, line: 1913, type: !403)
!699 = !DILocalVariable(name: "e", scope: !700, file: !110, line: 1915, type: !226, align: 8)
!700 = distinct !DILexicalBlock(scope: !670, file: !110, line: 1915, column: 13)
!701 = !{!692, !225, !422}
!702 = !DILocation(line: 1913, column: 22, scope: !670)
!703 = !DILocation(line: 1915, column: 17, scope: !700)
!704 = !DILocation(line: 1915, column: 17, scope: !670)
!705 = !DILocation(line: 1915, column: 38, scope: !700)
!706 = !DILocation(line: 1915, column: 27, scope: !700)
!707 = !DILocation(line: 1915, column: 23, scope: !700)
!708 = !DILocation(line: 1917, column: 6, scope: !670)
!709 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::InitializeAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h991f429d3a36dfb2E", scope: !111, file: !110, line: 1913, type: !710, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !736, retainedNodes: !732)
!710 = !DISubroutineType(types: !711)
!711 = !{!712, !403}
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::InitializeAccount, anchor_lang::error::Error>", scope: !87, file: !7, size: 1600, align: 64, elements: !713, identifier: "ba90064684412ddf84549442f662ca77")
!713 = !{!714}
!714 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1600, align: 64, elements: !715, templateParams: !726, identifier: "ba90064684412ddf84549442f662ca77_variant_part", discriminator: !402)
!715 = !{!716, !728}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !714, file: !7, baseType: !717, size: 1600, align: 64, extraData: i64 0)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !712, file: !7, size: 1600, align: 64, elements: !718, templateParams: !726, identifier: "ba90064684412ddf84549442f662ca77::Ok")
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !717, file: !7, baseType: !720, size: 1536, align: 64, offset: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "InitializeAccount", scope: !123, file: !7, size: 1536, align: 64, elements: !721, templateParams: !16, identifier: "fcad65f1b2b02279f9a563fa6e2a04a5")
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !720, file: !7, baseType: !126, size: 384, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !720, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !720, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rent", scope: !720, file: !7, baseType: !126, size: 384, align: 64, offset: 1152)
!726 = !{!727, !225}
!727 = !DITemplateTypeParameter(name: "T", type: !720)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !714, file: !7, baseType: !729, size: 1600, align: 64, extraData: i64 1)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !712, file: !7, size: 1600, align: 64, elements: !730, templateParams: !726, identifier: "ba90064684412ddf84549442f662ca77::Err")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !729, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!732 = !{!733, !734}
!733 = !DILocalVariable(name: "residual", arg: 1, scope: !709, file: !110, line: 1913, type: !403)
!734 = !DILocalVariable(name: "e", scope: !735, file: !110, line: 1915, type: !226, align: 8)
!735 = distinct !DILexicalBlock(scope: !709, file: !110, line: 1915, column: 13)
!736 = !{!727, !225, !422}
!737 = !DILocation(line: 1913, column: 22, scope: !709)
!738 = !DILocation(line: 1915, column: 17, scope: !735)
!739 = !DILocation(line: 1915, column: 17, scope: !709)
!740 = !DILocation(line: 1915, column: 38, scope: !735)
!741 = !DILocation(line: 1915, column: 27, scope: !735)
!742 = !DILocation(line: 1915, column: 23, scope: !735)
!743 = !DILocation(line: 1917, column: 6, scope: !709)
!744 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::FreezeAccount, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hb72c835db2e94cbcE", scope: !111, file: !110, line: 1913, type: !745, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !770, retainedNodes: !766)
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !403}
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::FreezeAccount, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !748, identifier: "821931e8cfabe724228b63ebb6f1a6a1")
!748 = !{!749}
!749 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !750, templateParams: !760, identifier: "821931e8cfabe724228b63ebb6f1a6a1_variant_part", discriminator: !402)
!750 = !{!751, !762}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !749, file: !7, baseType: !752, size: 1408, align: 64, extraData: i64 0)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !747, file: !7, size: 1408, align: 64, elements: !753, templateParams: !760, identifier: "821931e8cfabe724228b63ebb6f1a6a1::Ok")
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !752, file: !7, baseType: !755, size: 1152, align: 64, offset: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "FreezeAccount", scope: !123, file: !7, size: 1152, align: 64, elements: !756, templateParams: !16, identifier: "119e0cc714f50877f8bc81686c046b7c")
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !755, file: !7, baseType: !126, size: 384, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mint", scope: !755, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !755, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!760 = !{!761, !225}
!761 = !DITemplateTypeParameter(name: "T", type: !755)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !749, file: !7, baseType: !763, size: 1408, align: 64, extraData: i64 1)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !747, file: !7, size: 1408, align: 64, elements: !764, templateParams: !760, identifier: "821931e8cfabe724228b63ebb6f1a6a1::Err")
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !763, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!766 = !{!767, !768}
!767 = !DILocalVariable(name: "residual", arg: 1, scope: !744, file: !110, line: 1913, type: !403)
!768 = !DILocalVariable(name: "e", scope: !769, file: !110, line: 1915, type: !226, align: 8)
!769 = distinct !DILexicalBlock(scope: !744, file: !110, line: 1915, column: 13)
!770 = !{!761, !225, !422}
!771 = !DILocation(line: 1913, column: 22, scope: !744)
!772 = !DILocation(line: 1915, column: 17, scope: !769)
!773 = !DILocation(line: 1915, column: 17, scope: !744)
!774 = !DILocation(line: 1915, column: 38, scope: !769)
!775 = !DILocation(line: 1915, column: 27, scope: !769)
!776 = !DILocation(line: 1915, column: 23, scope: !769)
!777 = !DILocation(line: 1917, column: 6, scope: !744)
!778 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::Approve, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hc5aecf8adabeecdbE", scope: !111, file: !110, line: 1913, type: !779, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !804, retainedNodes: !800)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !403}
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::Approve, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !782, identifier: "e3eea0f30fe6b668bc5ee1e5d4a91fce")
!782 = !{!783}
!783 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !784, templateParams: !794, identifier: "e3eea0f30fe6b668bc5ee1e5d4a91fce_variant_part", discriminator: !402)
!784 = !{!785, !796}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !783, file: !7, baseType: !786, size: 1408, align: 64, extraData: i64 0)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !781, file: !7, size: 1408, align: 64, elements: !787, templateParams: !794, identifier: "e3eea0f30fe6b668bc5ee1e5d4a91fce::Ok")
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !786, file: !7, baseType: !789, size: 1152, align: 64, offset: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "Approve", scope: !123, file: !7, size: 1152, align: 64, elements: !790, templateParams: !16, identifier: "1a17728ace4a103b969766f6efabe8b9")
!790 = !{!791, !792, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !789, file: !7, baseType: !126, size: 384, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "delegate", scope: !789, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !789, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!794 = !{!795, !225}
!795 = !DITemplateTypeParameter(name: "T", type: !789)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !783, file: !7, baseType: !797, size: 1408, align: 64, extraData: i64 1)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !781, file: !7, size: 1408, align: 64, elements: !798, templateParams: !794, identifier: "e3eea0f30fe6b668bc5ee1e5d4a91fce::Err")
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !797, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!800 = !{!801, !802}
!801 = !DILocalVariable(name: "residual", arg: 1, scope: !778, file: !110, line: 1913, type: !403)
!802 = !DILocalVariable(name: "e", scope: !803, file: !110, line: 1915, type: !226, align: 8)
!803 = distinct !DILexicalBlock(scope: !778, file: !110, line: 1915, column: 13)
!804 = !{!795, !225, !422}
!805 = !DILocation(line: 1913, column: 22, scope: !778)
!806 = !DILocation(line: 1915, column: 17, scope: !803)
!807 = !DILocation(line: 1915, column: 17, scope: !778)
!808 = !DILocation(line: 1915, column: 38, scope: !803)
!809 = !DILocation(line: 1915, column: 27, scope: !803)
!810 = !DILocation(line: 1915, column: 23, scope: !803)
!811 = !DILocation(line: 1917, column: 6, scope: !778)
!812 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::Transfer, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17heb2521e59ebcae48E", scope: !111, file: !110, line: 1913, type: !813, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !838, retainedNodes: !834)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !403}
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::Transfer, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !816, identifier: "3bbf9839d5bedb5219609e298e127bcc")
!816 = !{!817}
!817 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !818, templateParams: !828, identifier: "3bbf9839d5bedb5219609e298e127bcc_variant_part", discriminator: !402)
!818 = !{!819, !830}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !817, file: !7, baseType: !820, size: 1408, align: 64, extraData: i64 0)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !815, file: !7, size: 1408, align: 64, elements: !821, templateParams: !828, identifier: "3bbf9839d5bedb5219609e298e127bcc::Ok")
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !820, file: !7, baseType: !823, size: 1152, align: 64, offset: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transfer", scope: !123, file: !7, size: 1152, align: 64, elements: !824, templateParams: !16, identifier: "15991a40b361afdeff31c99b2e485f2a")
!824 = !{!825, !826, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !823, file: !7, baseType: !126, size: 384, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !823, file: !7, baseType: !126, size: 384, align: 64, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "authority", scope: !823, file: !7, baseType: !126, size: 384, align: 64, offset: 768)
!828 = !{!829, !225}
!829 = !DITemplateTypeParameter(name: "T", type: !823)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !817, file: !7, baseType: !831, size: 1408, align: 64, extraData: i64 1)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !815, file: !7, size: 1408, align: 64, elements: !832, templateParams: !828, identifier: "3bbf9839d5bedb5219609e298e127bcc::Err")
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !831, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!834 = !{!835, !836}
!835 = !DILocalVariable(name: "residual", arg: 1, scope: !812, file: !110, line: 1913, type: !403)
!836 = !DILocalVariable(name: "e", scope: !837, file: !110, line: 1915, type: !226, align: 8)
!837 = distinct !DILexicalBlock(scope: !812, file: !110, line: 1915, column: 13)
!838 = !{!829, !225, !422}
!839 = !DILocation(line: 1913, column: 22, scope: !812)
!840 = !DILocation(line: 1915, column: 17, scope: !837)
!841 = !DILocation(line: 1915, column: 17, scope: !812)
!842 = !DILocation(line: 1915, column: 38, scope: !837)
!843 = !DILocation(line: 1915, column: 27, scope: !837)
!844 = !DILocation(line: 1915, column: 23, scope: !837)
!845 = !DILocation(line: 1917, column: 6, scope: !812)
!846 = distinct !DISubprogram(name: "from_residual<anchor_spl::token::SyncNative, anchor_lang::error::Error, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hec11888ca18f8e82E", scope: !111, file: !110, line: 1913, type: !847, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !870, retainedNodes: !866)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !403}
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<anchor_spl::token::SyncNative, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !850, identifier: "1015578aff51f0b28ef8ddec627ff48b")
!850 = !{!851}
!851 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !852, templateParams: !860, identifier: "1015578aff51f0b28ef8ddec627ff48b_variant_part", discriminator: !402)
!852 = !{!853, !862}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !851, file: !7, baseType: !854, size: 1408, align: 64, extraData: i64 0)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !849, file: !7, size: 1408, align: 64, elements: !855, templateParams: !860, identifier: "1015578aff51f0b28ef8ddec627ff48b::Ok")
!855 = !{!856}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !854, file: !7, baseType: !857, size: 384, align: 64, offset: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "SyncNative", scope: !123, file: !7, size: 384, align: 64, elements: !858, templateParams: !16, identifier: "7be38ddd0b2ffac717050b120732bbe5")
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "account", scope: !857, file: !7, baseType: !126, size: 384, align: 64)
!860 = !{!861, !225}
!861 = !DITemplateTypeParameter(name: "T", type: !857)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !851, file: !7, baseType: !863, size: 1408, align: 64, extraData: i64 1)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !849, file: !7, size: 1408, align: 64, elements: !864, templateParams: !860, identifier: "1015578aff51f0b28ef8ddec627ff48b::Err")
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !863, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!866 = !{!867, !868}
!867 = !DILocalVariable(name: "residual", arg: 1, scope: !846, file: !110, line: 1913, type: !403)
!868 = !DILocalVariable(name: "e", scope: !869, file: !110, line: 1915, type: !226, align: 8)
!869 = distinct !DILexicalBlock(scope: !846, file: !110, line: 1915, column: 13)
!870 = !{!861, !225, !422}
!871 = !DILocation(line: 1913, column: 22, scope: !846)
!872 = !DILocation(line: 1915, column: 17, scope: !869)
!873 = !DILocation(line: 1915, column: 17, scope: !846)
!874 = !DILocation(line: 1915, column: 38, scope: !869)
!875 = !DILocation(line: 1915, column: 27, scope: !869)
!876 = !DILocation(line: 1915, column: 23, scope: !869)
!877 = !DILocation(line: 1917, column: 6, scope: !846)
!878 = distinct !DISubprogram(name: "from_residual<solana_program::pubkey::Pubkey, solana_program::program_error::ProgramError, anchor_lang::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hfa5c4905702e8f6fE", scope: !111, file: !110, line: 1913, type: !879, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !899, retainedNodes: !895)
!879 = !DISubroutineType(types: !880)
!880 = !{!881, !446}
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<solana_program::pubkey::Pubkey, anchor_lang::error::Error>", scope: !87, file: !7, size: 1408, align: 64, elements: !882, identifier: "8a814df032df10b2e8a532653aa271c9")
!882 = !{!883}
!883 = !DICompositeType(tag: DW_TAG_variant_part, scope: !87, file: !7, size: 1408, align: 64, elements: !884, templateParams: !889, identifier: "8a814df032df10b2e8a532653aa271c9_variant_part", discriminator: !894)
!884 = !{!885, !890}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !883, file: !7, baseType: !886, size: 1408, align: 64, extraData: i64 0)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !881, file: !7, size: 1408, align: 64, elements: !887, templateParams: !889, identifier: "8a814df032df10b2e8a532653aa271c9::Ok")
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !886, file: !7, baseType: !6, size: 256, align: 8, offset: 8)
!889 = !{!41, !225}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !883, file: !7, baseType: !891, size: 1408, align: 64, extraData: i64 1)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !881, file: !7, size: 1408, align: 64, elements: !892, templateParams: !889, identifier: "8a814df032df10b2e8a532653aa271c9::Err")
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !891, file: !7, baseType: !226, size: 1344, align: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, scope: !87, file: !7, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!895 = !{!896, !897}
!896 = !DILocalVariable(name: "residual", arg: 1, scope: !878, file: !110, line: 1913, type: !446)
!897 = !DILocalVariable(name: "e", scope: !898, file: !110, line: 1915, type: !346, align: 8)
!898 = distinct !DILexicalBlock(scope: !878, file: !110, line: 1915, column: 13)
!899 = !{!41, !455, !422}
!900 = !DILocation(line: 1913, column: 22, scope: !878)
!901 = !DILocation(line: 1915, column: 17, scope: !898)
!902 = !DILocation(line: 1915, column: 17, scope: !878)
!903 = !DILocation(line: 1915, column: 38, scope: !898)
!904 = !DILocation(line: 1915, column: 27, scope: !898)
!905 = !DILocation(line: 1915, column: 23, scope: !898)
!906 = !DILocation(line: 1917, column: 6, scope: !878)
!907 = distinct !DISubprogram(name: "fmt<spl_token::state::Account>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h09e9d396df686900E", scope: !909, file: !908, line: 2088, type: !910, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, templateParams: !945, retainedNodes: !942)
!908 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "fc8dfb4543b7986b6225b25d4f76a5ce")
!909 = !DINamespace(name: "{impl#51}", scope: !95)
!910 = !DISubroutineType(types: !911)
!911 = !{!86, !912, !913}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&Account", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Formatter", baseType: !914, size: 64, align: 64, dwarfAddressSpace: 0)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !95, file: !7, size: 512, align: 64, elements: !915, templateParams: !16, identifier: "37f4daa474efe0abec93026f6af11d04")
!915 = !{!916, !917, !919, !920, !931, !932}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !914, file: !7, baseType: !47, size: 32, align: 32, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !914, file: !7, baseType: !918, size: 32, align: 32, offset: 416)
!918 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !914, file: !7, baseType: !92, size: 8, align: 8, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !914, file: !7, baseType: !921, size: 128, align: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !270, file: !7, size: 128, align: 64, elements: !922, identifier: "4849786e80860f5416c4c6b259f5a683")
!922 = !{!923}
!923 = !DICompositeType(tag: DW_TAG_variant_part, scope: !270, file: !7, size: 128, align: 64, elements: !924, templateParams: !156, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !303)
!924 = !{!925, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !923, file: !7, baseType: !926, size: 128, align: 64, extraData: i64 0)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !921, file: !7, size: 128, align: 64, elements: !16, templateParams: !156, identifier: "4849786e80860f5416c4c6b259f5a683::None")
