; ModuleID = 'sha3.cec1aef4-cgu.0'
source_filename = "sha3.cec1aef4-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"core::option::Option<(&[u8], &mut u64)>" = type { {}*, [2 x i64] }
%"core::iter::Zip<core::slice::ChunksExact<u8>, core::slice::IterMut<u64>>" = type { %"core::slice::ChunksExact<u8>", { i64*, i64* }, i64, i64, i64 }
%"core::slice::ChunksExact<u8>" = type { { [0 x i8]*, i64 }, { [0 x i8]*, i64 }, i64 }
%"core::ops::ControlFlow<core::result::Result<usize, !>, usize>::Break" = type { [1 x i64], i64 }
%"core::panic::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::iter::Enumerate<core::slice::IterMut<u8>>" = type { { i8*, i8* }, i64 }

!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryFromSliceError", scope: !6, file: !2, align: 8, elements: !8, templateParams: !4, identifier: "7d433bee47af4cec79597a74e6cd8a5c")
!6 = !DINamespace(name: "array", scope: !7)
!7 = !DINamespace(name: "core", scope: null)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !5, file: !2, baseType: !10, align: 8)
!10 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !13, isLocal: true, isDefinition: true)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, identifier: "vtable")
!14 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !18, identifier: "vtable")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!20 = !{i32 7, !"PIC Level", i32 2}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !23, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, globals: !53)
!23 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/sha3-0.10.2/src/lib.rs", directory: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/sha3-0.10.2")
!24 = !{!25, !31, !40, !47}
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !26, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !28)
!26 = !DINamespace(name: "result", scope: !7)
!27 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!28 = !{!29, !30}
!29 = !DIEnumerator(name: "Ok", value: 0)
!30 = !DIEnumerator(name: "Err", value: 1)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !32, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !35)
!32 = !DINamespace(name: "v1", scope: !33)
!33 = !DINamespace(name: "rt", scope: !34)
!34 = !DINamespace(name: "fmt", scope: !7)
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "Left", value: 0)
!37 = !DIEnumerator(name: "Right", value: 1)
!38 = !DIEnumerator(name: "Center", value: 2)
!39 = !DIEnumerator(name: "Unknown", value: 3)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !41, file: !2, baseType: !42, size: 8, align: 8, flags: DIFlagEnumClass, elements: !43)
!41 = !DINamespace(name: "cmp", scope: !7)
!42 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!43 = !{!44, !45, !46}
!44 = !DIEnumerator(name: "Less", value: -1)
!45 = !DIEnumerator(name: "Equal", value: 0)
!46 = !DIEnumerator(name: "Greater", value: 1)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !48, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !49)
!48 = !DINamespace(name: "panicking", scope: !7)
!49 = !{!50, !51, !52}
!50 = !DIEnumerator(name: "Eq", value: 0)
!51 = !DIEnumerator(name: "Ne", value: 1)
!52 = !DIEnumerator(name: "Match", value: 2)
!53 = !{!0, !11, !15}
!54 = distinct !DISubprogram(name: "next<core::slice::iter::ChunksExact<u8>, core::slice::iter::IterMut<u64>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h7ca3a347126527f5E", scope: !56, file: !55, line: 76, type: !60, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !122, retainedNodes: !125)
!55 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/zip.rs", directory: "", checksumkind: CSK_MD5, checksum: "f4879531fb05d5b8b226fa4bf4c2f512")
!56 = !DINamespace(name: "{impl#1}", scope: !57)
!57 = !DINamespace(name: "zip", scope: !58)
!58 = !DINamespace(name: "adapters", scope: !59)
!59 = !DINamespace(name: "iter", scope: !7)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !87}
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(&[u8], &mut u64)>", scope: !63, file: !2, size: 192, align: 64, elements: !64, identifier: "a0b3d0518a7745bbc70761b1ff7a0165")
!63 = !DINamespace(name: "option", scope: !7)
!64 = !{!65}
!65 = !DICompositeType(tag: DW_TAG_variant_part, scope: !63, file: !2, size: 192, align: 64, elements: !66, templateParams: !69, identifier: "a0b3d0518a7745bbc70761b1ff7a0165_variant_part", discriminator: !86)
!66 = !{!67, !82}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !65, file: !2, baseType: !68, size: 192, align: 64, extraData: i64 0)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !62, file: !2, size: 192, align: 64, elements: !4, templateParams: !69, identifier: "a0b3d0518a7745bbc70761b1ff7a0165::None")
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "T", type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&[u8], &mut u64)", file: !2, size: 192, align: 64, elements: !72, templateParams: !4, identifier: "a3edf0d87b18db077f30d21a1679a082")
!72 = !{!73, !79}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !71, file: !2, baseType: !74, size: 128, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !75, templateParams: !4, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !74, file: !2, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !74, file: !2, baseType: !19, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !71, file: !2, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u64", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!81 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !65, file: !2, baseType: !83, size: 192, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !62, file: !2, size: 192, align: 64, elements: !84, templateParams: !69, identifier: "a0b3d0518a7745bbc70761b1ff7a0165::Some")
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !83, file: !2, baseType: !71, size: 192, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !63, file: !2, baseType: !81, size: 64, align: 64, flags: DIFlagArtificial)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Zip<core::slice::iter::ChunksExact<u8>, core::slice::iter::IterMut<u64>>", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::slice::iter::ChunksExact<u8>, core::slice::iter::IterMut<u64>>", scope: !57, file: !2, size: 640, align: 64, elements: !89, templateParams: !122, identifier: "1f25d7f2d8f79fe9f1cf224e83652041")
!89 = !{!90, !100, !119, !120, !121}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !88, file: !2, baseType: !91, size: 320, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChunksExact<u8>", scope: !92, file: !2, size: 320, align: 64, elements: !94, templateParams: !98, identifier: "cf0df9ae2d84fae535c3c396ab9789d")
!92 = !DINamespace(name: "iter", scope: !93)
!93 = !DINamespace(name: "slice", scope: !7)
!94 = !{!95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !91, file: !2, baseType: !74, size: 128, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !91, file: !2, baseType: !74, size: 128, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !91, file: !2, baseType: !19, size: 64, align: 64, offset: 256)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "T", type: !27)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !88, file: !2, baseType: !101, size: 128, align: 64, offset: 320)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "IterMut<u64>", scope: !92, file: !2, size: 128, align: 64, elements: !102, templateParams: !110, identifier: "eaf6ffcf997f55fefe0fe953517dc695")
!102 = !{!103, !112, !114}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !101, file: !2, baseType: !104, size: 64, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u64>", scope: !105, file: !2, size: 64, align: 64, elements: !107, templateParams: !110, identifier: "655af7d67292cd451ce7aad5f60bcf7e")
!105 = !DINamespace(name: "non_null", scope: !106)
!106 = !DINamespace(name: "ptr", scope: !7)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !104, file: !2, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u64", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "T", type: !81)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !101, file: !2, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u64", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !101, file: !2, baseType: !115, align: 8)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut u64>", scope: !116, file: !2, align: 8, elements: !4, templateParams: !117, identifier: "9a36ca1e189dfefb198e65b1632b1e83")
!116 = !DINamespace(name: "marker", scope: !7)
!117 = !{!118}
!118 = !DITemplateTypeParameter(name: "T", type: !80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !88, file: !2, baseType: !19, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, file: !2, baseType: !19, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !88, file: !2, baseType: !19, size: 64, align: 64, offset: 576)
!122 = !{!123, !124}
!123 = !DITemplateTypeParameter(name: "A", type: !91)
!124 = !DITemplateTypeParameter(name: "B", type: !101)
!125 = !{!126}
!126 = !DILocalVariable(name: "self", arg: 1, scope: !54, file: !55, line: 76, type: !87)
!127 = !DILocation(line: 76, column: 13, scope: !54)
!128 = !DILocation(line: 77, column: 9, scope: !54)
!129 = !DILocation(line: 78, column: 6, scope: !54)
!130 = distinct !DISubprogram(name: "from_residual<core::result::Result<usize, !>, usize>", linkageName: "_ZN104_$LT$core..ops..control_flow..ControlFlow$LT$B$C$C$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17h22f6d2a4575b1792E", scope: !132, file: !131, line: 87, type: !135, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !145, retainedNodes: !178)
!131 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ops/control_flow.rs", directory: "", checksumkind: CSK_MD5, checksum: "dae96c2de2853f1bf78a32ab59b6143b")
!132 = !DINamespace(name: "{impl#1}", scope: !133)
!133 = !DINamespace(name: "control_flow", scope: !134)
!134 = !DINamespace(name: "ops", scope: !7)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !164}
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::result::Result<usize, !>, usize>", scope: !133, file: !2, size: 128, align: 64, elements: !138, identifier: "890b0029f41bd1417d45623198054a3e")
!138 = !{!139}
!139 = !DICompositeType(tag: DW_TAG_variant_part, scope: !133, file: !2, size: 128, align: 64, elements: !140, templateParams: !145, identifier: "890b0029f41bd1417d45623198054a3e_variant_part", discriminator: !163)
!140 = !{!141, !159}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !139, file: !2, baseType: !142, size: 128, align: 64, extraData: i64 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !137, file: !2, size: 128, align: 64, elements: !143, templateParams: !145, identifier: "890b0029f41bd1417d45623198054a3e::Continue")
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !142, file: !2, baseType: !19, size: 64, align: 64, offset: 64)
!145 = !{!146, !158}
!146 = !DITemplateTypeParameter(name: "B", type: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, !>", scope: !26, file: !2, size: 64, align: 64, elements: !148, identifier: "4a45c1b7494b60a4fc0ff0a3cb9f43a7")
!148 = !{!149}
!149 = !DICompositeType(tag: DW_TAG_variant_part, scope: !26, file: !2, size: 64, align: 64, elements: !150, templateParams: !155, identifier: "4a45c1b7494b60a4fc0ff0a3cb9f43a7_variant_part")
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !149, file: !2, baseType: !152, size: 64, align: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !147, file: !2, size: 64, align: 64, elements: !153, templateParams: !155, identifier: "4a45c1b7494b60a4fc0ff0a3cb9f43a7::Ok")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !152, file: !2, baseType: !19, size: 64, align: 64)
!155 = !{!156, !157}
!156 = !DITemplateTypeParameter(name: "T", type: !19)
!157 = !DITemplateTypeParameter(name: "E", type: !14)
!158 = !DITemplateTypeParameter(name: "C", type: !19)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !139, file: !2, baseType: !160, size: 128, align: 64, extraData: i64 1)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !137, file: !2, size: 128, align: 64, elements: !161, templateParams: !145, identifier: "890b0029f41bd1417d45623198054a3e::Break")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !160, file: !2, baseType: !147, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !133, file: !2, baseType: !81, size: 64, align: 64, flags: DIFlagArtificial)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::result::Result<usize, !>, core::convert::Infallible>", scope: !133, file: !2, size: 64, align: 64, elements: !165, identifier: "6ed4001f2feb4c1b2d87395a250536a1")
!165 = !{!166}
!166 = !DICompositeType(tag: DW_TAG_variant_part, scope: !133, file: !2, size: 64, align: 64, elements: !167, templateParams: !172, identifier: "6ed4001f2feb4c1b2d87395a250536a1_variant_part")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !166, file: !2, baseType: !169, size: 64, align: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !164, file: !2, size: 64, align: 64, elements: !170, templateParams: !172, identifier: "6ed4001f2feb4c1b2d87395a250536a1::Break")
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !169, file: !2, baseType: !147, size: 64, align: 64)
!172 = !{!146, !173}
!173 = !DITemplateTypeParameter(name: "C", type: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !175, file: !2, align: 8, elements: !176, identifier: "866eee8446b1bfa4f6d9cf9584e40412")
!175 = !DINamespace(name: "convert", scope: !7)
!176 = !{!177}
!177 = !DICompositeType(tag: DW_TAG_variant_part, scope: !175, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "866eee8446b1bfa4f6d9cf9584e40412_variant_part")
!178 = !{!179, !180}
!179 = !DILocalVariable(name: "residual", arg: 1, scope: !130, file: !131, line: 87, type: !164)
!180 = !DILocalVariable(name: "b", scope: !181, file: !131, line: 89, type: !147, align: 8)
!181 = distinct !DILexicalBlock(scope: !130, file: !131, line: 89, column: 13)
!182 = !DILocation(line: 87, column: 22, scope: !130)
!183 = !DILocation(line: 89, column: 32, scope: !130)
!184 = !DILocation(line: 89, column: 32, scope: !181)
!185 = !DILocation(line: 89, column: 38, scope: !181)
!186 = !DILocation(line: 91, column: 6, scope: !130)
!187 = !{i64 0, i64 2}
!188 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h9f1e94dea3447a52E", scope: !190, file: !189, line: 273, type: !192, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !98, retainedNodes: !204)
!189 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "a82bc19197b1c05f8386d5b2ec2441bd")
!190 = !DINamespace(name: "{impl#4}", scope: !191)
!191 = !DINamespace(name: "index", scope: !93)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !198, !194}
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !195, templateParams: !4, identifier: "f5bc56280f62752aca6114f169d6965e")
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !194, file: !2, baseType: !77, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !194, file: !2, baseType: !19, size: 64, align: 64, offset: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !199, file: !2, size: 64, align: 64, elements: !200, templateParams: !202, identifier: "3e48b56f3047a6495d250669d7a4f287")
!199 = !DINamespace(name: "range", scope: !134)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !198, file: !2, baseType: !19, size: 64, align: 64)
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "Idx", type: !19)
!204 = !{!205, !206}
!205 = !DILocalVariable(name: "self", arg: 1, scope: !188, file: !189, line: 273, type: !198)
!206 = !DILocalVariable(name: "slice", arg: 2, scope: !188, file: !189, line: 273, type: !194)
!207 = !DILocation(line: 273, column: 29, scope: !188)
!208 = !DILocation(line: 273, column: 35, scope: !188)
!209 = !DILocation(line: 275, column: 18, scope: !188)
!210 = !DILocation(line: 276, column: 6, scope: !188)
!211 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17ha992c0f29c96b9b9E", scope: !190, file: !189, line: 290, type: !212, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !98, retainedNodes: !231)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !198, !214, !218}
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !215, templateParams: !4, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !214, file: !2, baseType: !77, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !214, file: !2, baseType: !19, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Location", baseType: !219, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !220, file: !2, size: 192, align: 64, elements: !222, templateParams: !4, identifier: "9f9749776572719cc82f4bbe4f5eb8d")
!220 = !DINamespace(name: "location", scope: !221)
!221 = !DINamespace(name: "panic", scope: !7)
!222 = !{!223, !228, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !219, file: !2, baseType: !224, size: 128, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !225, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !224, file: !2, baseType: !77, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !224, file: !2, baseType: !19, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !219, file: !2, baseType: !229, size: 32, align: 32, offset: 128)
!229 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !219, file: !2, baseType: !229, size: 32, align: 32, offset: 160)
!231 = !{!232, !233}
!232 = !DILocalVariable(name: "self", arg: 1, scope: !211, file: !189, line: 290, type: !198)
!233 = !DILocalVariable(name: "slice", arg: 2, scope: !211, file: !189, line: 290, type: !214)
!234 = !DILocation(line: 290, column: 18, scope: !211)
!235 = !DILocation(line: 290, column: 24, scope: !211)
!236 = !DILocation(line: 291, column: 9, scope: !211)
!237 = !DILocation(line: 292, column: 6, scope: !211)
!238 = distinct !DISubprogram(name: "fold<core::slice::iter::IterMut<u8>, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h1a8dccf73dec9f9eE", scope: !240, file: !239, line: 95, type: !242, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !289, retainedNodes: !285)
!239 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/enumerate.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c34b678724f0d255a70ef8e29773480")
!240 = !DINamespace(name: "{impl#1}", scope: !241)
!241 = !DINamespace(name: "enumerate", scope: !58)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244, !10, !263}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumerate<core::slice::iter::IterMut<u8>>", scope: !241, file: !2, size: 192, align: 64, elements: !245, templateParams: !261, identifier: "f77ca556fbd62f1dd84303a89127dbcc")
!245 = !{!246, !260}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !244, file: !2, baseType: !247, size: 128, align: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "IterMut<u8>", scope: !92, file: !2, size: 128, align: 64, elements: !248, templateParams: !98, identifier: "7f72f3f5f85191f2e8584f77e0edf2d3")
!248 = !{!249, !253, !255}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !247, file: !2, baseType: !250, size: 64, align: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !105, file: !2, size: 64, align: 64, elements: !251, templateParams: !98, identifier: "406fec2678b8bb45d8db3433ccc0ff79")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !250, file: !2, baseType: !77, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !247, file: !2, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !247, file: !2, baseType: !256, align: 8)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut u8>", scope: !116, file: !2, align: 8, elements: !4, templateParams: !257, identifier: "1bf860fe723286515fb5df7f6bdae3e2")
!257 = !{!258}
!258 = !DITemplateTypeParameter(name: "T", type: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u8", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !244, file: !2, baseType: !19, size: 64, align: 64, offset: 128)
!261 = !{!262}
!262 = !DITemplateTypeParameter(name: "I", type: !247)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !264, file: !2, size: 128, align: 64, elements: !269, templateParams: !4, identifier: "1afa77dbc1037729b2c7483a7b769b37")
!264 = !DINamespace(name: "call", scope: !265)
!265 = !DINamespace(name: "for_each", scope: !266)
!266 = !DINamespace(name: "Iterator", scope: !267)
!267 = !DINamespace(name: "iterator", scope: !268)
!268 = !DINamespace(name: "traits", scope: !59)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !263, file: !2, baseType: !271, size: 128, align: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !272, file: !2, size: 128, align: 64, elements: !275, templateParams: !4, identifier: "45e5429ddd9ec79888ed4a4e20f823e5")
!272 = !DINamespace(name: "generate", scope: !273)
!273 = !DINamespace(name: "{impl#18}", scope: !274)
!274 = !DINamespace(name: "generic_array", scope: null)
!275 = !{!276, !282}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !271, file: !2, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !278, size: 64, align: 64, dwarfAddressSpace: 0)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !279, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "79ceb79ca2dfa0ce51d1e2c426c8ba77")
!279 = !DINamespace(name: "default", scope: !280)
!280 = !DINamespace(name: "{impl#0}", scope: !281)
!281 = !DINamespace(name: "impls", scope: !274)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__position", scope: !271, file: !2, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &mut usize", baseType: !284, size: 64, align: 64, dwarfAddressSpace: 0)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut usize", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!285 = !{!286, !287, !288}
!286 = !DILocalVariable(name: "self", arg: 1, scope: !238, file: !239, line: 95, type: !244)
!287 = !DILocalVariable(name: "init", arg: 2, scope: !238, file: !239, line: 95, type: !10)
!288 = !DILocalVariable(name: "fold", arg: 3, scope: !238, file: !239, line: 95, type: !263)
!289 = !{!262, !290, !291}
!290 = !DITemplateTypeParameter(name: "Acc", type: !10)
!291 = !DITemplateTypeParameter(name: "Fold", type: !263)
!292 = !DILocation(line: 95, column: 24, scope: !238)
!293 = !DILocation(line: 95, column: 30, scope: !238)
!294 = !DILocation(line: 95, column: 41, scope: !238)
!295 = !DILocation(line: 112, column: 9, scope: !238)
!296 = !DILocation(line: 112, column: 40, scope: !238)
!297 = !DILocation(line: 112, column: 30, scope: !238)
!298 = !DILocation(line: 113, column: 6, scope: !238)
!299 = distinct !DISubprogram(name: "fold<core::slice::iter::IterMut<u8>, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h7c9202e72b90e34cE", scope: !240, file: !239, line: 95, type: !300, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !315, retainedNodes: !311)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !244, !10, !302}
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !264, file: !2, size: 128, align: 64, elements: !303, templateParams: !4, identifier: "e03364802e7f62024a410d875c350a5")
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !302, file: !2, baseType: !305, size: 128, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !272, file: !2, size: 128, align: 64, elements: !306, templateParams: !4, identifier: "5f62a6d735102811d1b67d41cb45ffb")
!306 = !{!307, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !305, file: !2, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !279, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "70bce09b59517848bca0069e154f2172")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__position", scope: !305, file: !2, baseType: !283, size: 64, align: 64, offset: 64)
!311 = !{!312, !313, !314}
!312 = !DILocalVariable(name: "self", arg: 1, scope: !299, file: !239, line: 95, type: !244)
!313 = !DILocalVariable(name: "init", arg: 2, scope: !299, file: !239, line: 95, type: !10)
!314 = !DILocalVariable(name: "fold", arg: 3, scope: !299, file: !239, line: 95, type: !302)
!315 = !{!262, !290, !316}
!316 = !DITemplateTypeParameter(name: "Fold", type: !302)
!317 = !DILocation(line: 95, column: 24, scope: !299)
!318 = !DILocation(line: 95, column: 30, scope: !299)
!319 = !DILocation(line: 95, column: 41, scope: !299)
!320 = !DILocation(line: 112, column: 9, scope: !299)
!321 = !DILocation(line: 112, column: 40, scope: !299)
!322 = !DILocation(line: 112, column: 30, scope: !299)
!323 = !DILocation(line: 113, column: 6, scope: !299)
!324 = distinct !DISubprogram(name: "enumerate<&mut u8, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold9enumerate17ha7439193eea30a19E", scope: !325, file: !239, line: 100, type: !326, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !336, retainedNodes: !333)
!325 = !DINamespace(name: "fold", scope: !240)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !19, !302}
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !329, file: !2, size: 192, align: 64, elements: !330, templateParams: !4, identifier: "c58f5eaa806d2b4f2369382410cf52c6")
!329 = !DINamespace(name: "enumerate", scope: !325)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fold", scope: !328, file: !2, baseType: !302, size: 128, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !328, file: !2, baseType: !19, size: 64, align: 64, offset: 128)
!333 = !{!334, !335}
!334 = !DILocalVariable(name: "count", arg: 1, scope: !324, file: !239, line: 101, type: !19)
!335 = !DILocalVariable(name: "fold", arg: 2, scope: !324, file: !239, line: 102, type: !302)
!336 = !{!258, !290, !337}
!337 = !DITemplateTypeParameter(name: "impl FnMut(Acc, (usize, T)) -> Acc", type: !302)
!338 = !DILocation(line: 101, column: 13, scope: !324)
!339 = !DILocation(line: 102, column: 13, scope: !324)
!340 = !DILocation(line: 105, column: 13, scope: !324)
!341 = !DILocation(line: 110, column: 10, scope: !324)
!342 = distinct !DISubprogram(name: "enumerate<&mut u8, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold9enumerate17hc2852a400de6f966E", scope: !325, file: !239, line: 100, type: !343, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !352, retainedNodes: !349)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !19, !263}
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !329, file: !2, size: 192, align: 64, elements: !346, templateParams: !4, identifier: "f77afe4ee005cbec1d4249b4bb123019")
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fold", scope: !345, file: !2, baseType: !263, size: 128, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !345, file: !2, baseType: !19, size: 64, align: 64, offset: 128)
!349 = !{!350, !351}
!350 = !DILocalVariable(name: "count", arg: 1, scope: !342, file: !239, line: 101, type: !19)
!351 = !DILocalVariable(name: "fold", arg: 2, scope: !342, file: !239, line: 102, type: !263)
!352 = !{!258, !290, !353}
!353 = !DITemplateTypeParameter(name: "impl FnMut(Acc, (usize, T)) -> Acc", type: !263)
!354 = !DILocation(line: 101, column: 13, scope: !342)
!355 = !DILocation(line: 102, column: 13, scope: !342)
!356 = !DILocation(line: 105, column: 13, scope: !342)
!357 = !DILocation(line: 110, column: 10, scope: !342)
!358 = distinct !DISubprogram(name: "{closure#0}<&mut u8, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold9enumerate28_$u7b$$u7b$closure$u7d$$u7d$17hd917635a788b8fc3E", scope: !329, file: !239, line: 105, type: !359, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !336, retainedNodes: !362)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361, !10, !259}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!362 = !{!363, !364, !365, !366, !367}
!363 = !DILocalVariable(name: "acc", arg: 2, scope: !358, file: !239, line: 105, type: !10)
!364 = !DILocalVariable(name: "item", arg: 3, scope: !358, file: !239, line: 105, type: !259)
!365 = !DILocalVariable(name: "fold", scope: !358, file: !239, line: 102, type: !302, align: 8)
!366 = !DILocalVariable(name: "count", scope: !358, file: !239, line: 101, type: !19, align: 8)
!367 = !DILocalVariable(name: "acc", scope: !368, file: !239, line: 106, type: !10, align: 1)
!368 = distinct !DILexicalBlock(scope: !358, file: !239, line: 106, column: 17)
!369 = !DILocation(line: 106, column: 21, scope: !368)
!370 = !DILocation(line: 102, column: 13, scope: !358)
!371 = !DILocation(line: 101, column: 13, scope: !358)
!372 = !DILocation(line: 105, column: 19, scope: !358)
!373 = !DILocation(line: 105, column: 24, scope: !358)
!374 = !DILocation(line: 106, column: 27, scope: !358)
!375 = !DILocation(line: 106, column: 38, scope: !358)
!376 = !DILocation(line: 106, column: 37, scope: !358)
!377 = !DILocation(line: 107, column: 17, scope: !368)
!378 = !DILocation(line: 109, column: 14, scope: !358)
!379 = distinct !DISubprogram(name: "{closure#0}<&mut u8, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold9enumerate28_$u7b$$u7b$closure$u7d$$u7d$17hfb383f55a5a1f2abE", scope: !329, file: !239, line: 105, type: !380, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !352, retainedNodes: !383)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382, !10, !259}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !345, size: 64, align: 64, dwarfAddressSpace: 0)
!383 = !{!384, !385, !386, !387, !388}
!384 = !DILocalVariable(name: "acc", arg: 2, scope: !379, file: !239, line: 105, type: !10)
!385 = !DILocalVariable(name: "item", arg: 3, scope: !379, file: !239, line: 105, type: !259)
!386 = !DILocalVariable(name: "fold", scope: !379, file: !239, line: 102, type: !263, align: 8)
!387 = !DILocalVariable(name: "count", scope: !379, file: !239, line: 101, type: !19, align: 8)
!388 = !DILocalVariable(name: "acc", scope: !389, file: !239, line: 106, type: !10, align: 1)
!389 = distinct !DILexicalBlock(scope: !379, file: !239, line: 106, column: 17)
!390 = !DILocation(line: 106, column: 21, scope: !389)
!391 = !DILocation(line: 102, column: 13, scope: !379)
!392 = !DILocation(line: 101, column: 13, scope: !379)
!393 = !DILocation(line: 105, column: 19, scope: !379)
!394 = !DILocation(line: 105, column: 24, scope: !379)
!395 = !DILocation(line: 106, column: 27, scope: !379)
!396 = !DILocation(line: 106, column: 38, scope: !379)
!397 = !DILocation(line: 106, column: 37, scope: !379)
!398 = !DILocation(line: 107, column: 17, scope: !389)
!399 = !DILocation(line: 109, column: 14, scope: !379)
!400 = distinct !DISubprogram(name: "get_unchecked_mut<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h33fbd9740f45e7e3E", scope: !401, file: !189, line: 316, type: !402, scopeLine: 316, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !98, retainedNodes: !411)
!401 = !DINamespace(name: "{impl#5}", scope: !191)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !408, !404}
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u8]", file: !2, size: 128, align: 64, elements: !405, templateParams: !4, identifier: "5196b2ee1fdbf734c7f3a78e14d50170")
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !404, file: !2, baseType: !77, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !404, file: !2, baseType: !19, size: 64, align: 64, offset: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !199, file: !2, size: 64, align: 64, elements: !409, templateParams: !202, identifier: "e075dc6e7a89d0be4297c8fc5af78aa")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !408, file: !2, baseType: !19, size: 64, align: 64)
!411 = !{!412, !413}
!412 = !DILocalVariable(name: "self", arg: 1, scope: !400, file: !189, line: 316, type: !408)
!413 = !DILocalVariable(name: "slice", arg: 2, scope: !400, file: !189, line: 316, type: !404)
!414 = !DILocation(line: 316, column: 33, scope: !400)
!415 = !DILocation(line: 316, column: 39, scope: !400)
!416 = !DILocalVariable(name: "self", arg: 1, scope: !417, file: !418, line: 1177, type: !404)
!417 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h0c7dcb5107475c25E", scope: !419, file: !418, line: 1177, type: !421, scopeLine: 1177, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !98, retainedNodes: !423)
!418 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "dc9433fa5edb0740532b3ed97e3aaa10")
!419 = !DINamespace(name: "{impl#1}", scope: !420)
!420 = !DINamespace(name: "mut_ptr", scope: !106)
!421 = !DISubroutineType(types: !422)
!422 = !{!19, !404}
!423 = !{!416}
!424 = !DILocation(line: 1177, column: 22, scope: !417, inlinedAt: !425)
!425 = distinct !DILocation(line: 318, column: 31, scope: !400)
!426 = !DILocation(line: 1178, column: 9, scope: !417, inlinedAt: !425)
!427 = !DILocation(line: 318, column: 31, scope: !400)
!428 = !DILocation(line: 318, column: 18, scope: !400)
!429 = !DILocation(line: 319, column: 6, scope: !400)
!430 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h348a60144c1e23b5E", scope: !401, file: !189, line: 331, type: !431, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !98, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{!214, !408, !214, !218}
!433 = !{!434, !435}
!434 = !DILocalVariable(name: "self", arg: 1, scope: !430, file: !189, line: 331, type: !408)
!435 = !DILocalVariable(name: "slice", arg: 2, scope: !430, file: !189, line: 331, type: !214)
!436 = !DILocation(line: 331, column: 18, scope: !430)
!437 = !DILocation(line: 331, column: 24, scope: !430)
!438 = !DILocation(line: 332, column: 12, scope: !430)
!439 = !DILocation(line: 336, column: 24, scope: !430)
!440 = !DILocation(line: 333, column: 13, scope: !430)
!441 = !DILocation(line: 337, column: 6, scope: !430)
!442 = distinct !DISubprogram(name: "generate<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, generic_array::impls::{impl#0}::default::{closure#0}>", linkageName: "_ZN110_$LT$generic_array..GenericArray$LT$T$C$N$GT$$u20$as$u20$generic_array..sequence..GenericSequence$LT$T$GT$$GT$8generate17h49dc53ae557f8c18E", scope: !273, file: !443, line: 379, type: !444, scopeLine: 379, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !592, retainedNodes: !567)
!443 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/generic-array-0.14.6/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "934698f68e3f03355dd5c26abd04146e")
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !309}
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArray<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>", scope: !274, file: !2, size: 1344, align: 8, elements: !447, templateParams: !509, identifier: "f586e320ed7a89fbb73192e9b979eb6a")
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !446, file: !2, baseType: !449, size: 1344, align: 8)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>>>>", scope: !274, file: !2, size: 1344, align: 8, elements: !450, templateParams: !507, identifier: "6a51223affd1b0a79a2c6752b7a69eda")
!450 = !{!451, !505, !506}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !449, file: !2, baseType: !452, size: 672, align: 8)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>>>", scope: !274, file: !2, size: 672, align: 8, elements: !453, templateParams: !503, identifier: "9dbfd402a3a7f2febba2b53d3f32ddaf")
!453 = !{!454, !501, !502}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !452, file: !2, baseType: !455, size: 336, align: 8)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>>", scope: !274, file: !2, size: 336, align: 8, elements: !456, templateParams: !499, identifier: "16f3f140c92deae1f9df662b3280d735")
!456 = !{!457, !497, !498}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !455, file: !2, baseType: !458, size: 168, align: 8)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>", scope: !274, file: !2, size: 168, align: 8, elements: !459, templateParams: !495, identifier: "c2d4944d534315e618d5efd392a05777")
!459 = !{!460, !493, !494}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !458, file: !2, baseType: !461, size: 80, align: 8)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>", scope: !274, file: !2, size: 80, align: 8, elements: !462, templateParams: !491, identifier: "f5a4ff3910101caf13d0880c91036f11")
!462 = !{!463, !489, !490}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !461, file: !2, baseType: !464, size: 40, align: 8)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>", scope: !274, file: !2, size: 40, align: 8, elements: !465, templateParams: !487, identifier: "6355bdb09f227c1c4a25c5c375693dda")
!465 = !{!466, !485, !486}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !464, file: !2, baseType: !467, size: 16, align: 8)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>", scope: !274, file: !2, size: 16, align: 8, elements: !468, templateParams: !483, identifier: "5d378da713abcf1bc154641eddb15191")
!468 = !{!469, !480, !481}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !467, file: !2, baseType: !470, size: 8, align: 8)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplOdd<u8, [u8; 0]>", scope: !274, file: !2, size: 8, align: 8, elements: !471, templateParams: !478, identifier: "1f55f732718b6583b9d06b2d603d036")
!471 = !{!472, !476, !477}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !470, file: !2, baseType: !473, align: 8)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, align: 8, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 0, lowerBound: 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !470, file: !2, baseType: !473, align: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !470, file: !2, baseType: !27, size: 8, align: 8)
!478 = !{!99, !479}
!479 = !DITemplateTypeParameter(name: "U", type: !473)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !467, file: !2, baseType: !470, size: 8, align: 8, offset: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !467, file: !2, baseType: !482, align: 8, offset: 16)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !116, file: !2, align: 8, elements: !4, templateParams: !98, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!483 = !{!99, !484}
!484 = !DITemplateTypeParameter(name: "U", type: !470)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !464, file: !2, baseType: !467, size: 16, align: 8, offset: 16)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !2, baseType: !27, size: 8, align: 8, offset: 32)
!487 = !{!99, !488}
!488 = !DITemplateTypeParameter(name: "U", type: !467)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !461, file: !2, baseType: !464, size: 40, align: 8, offset: 40)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !461, file: !2, baseType: !482, align: 8, offset: 80)
!491 = !{!99, !492}
!492 = !DITemplateTypeParameter(name: "U", type: !464)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !458, file: !2, baseType: !461, size: 80, align: 8, offset: 80)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !458, file: !2, baseType: !27, size: 8, align: 8, offset: 160)
!495 = !{!99, !496}
!496 = !DITemplateTypeParameter(name: "U", type: !461)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !455, file: !2, baseType: !458, size: 168, align: 8, offset: 168)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !455, file: !2, baseType: !482, align: 8, offset: 336)
!499 = !{!99, !500}
!500 = !DITemplateTypeParameter(name: "U", type: !458)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !452, file: !2, baseType: !455, size: 336, align: 8, offset: 336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !452, file: !2, baseType: !482, align: 8, offset: 672)
!503 = !{!99, !504}
!504 = !DITemplateTypeParameter(name: "U", type: !455)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !449, file: !2, baseType: !452, size: 672, align: 8, offset: 672)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !449, file: !2, baseType: !482, align: 8, offset: 1344)
!507 = !{!99, !508}
!508 = !DITemplateTypeParameter(name: "U", type: !452)
!509 = !{!99, !510}
!510 = !DITemplateTypeParameter(name: "U", type: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !514, templateParams: !565, identifier: "3adc00e362c3acdffa672ac26ac4f94e")
!512 = !DINamespace(name: "uint", scope: !513)
!513 = !DINamespace(name: "typenum", scope: null)
!514 = !{!515, !564}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !511, file: !2, baseType: !516, align: 8)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !517, templateParams: !562, identifier: "3f845f97b570ba7b773e8567512bc078")
!517 = !{!518, !561}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !516, file: !2, baseType: !519, align: 8)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !520, templateParams: !559, identifier: "179d1c8581cfcff1e3b1f7a39a69e0c2")
!520 = !{!521, !558}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !519, file: !2, baseType: !522, align: 8)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>", scope: !512, file: !2, align: 8, elements: !523, templateParams: !556, identifier: "6243b9908b8be95f9b11a296f9032319")
!523 = !{!524, !555}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !522, file: !2, baseType: !525, align: 8)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !526, templateParams: !553, identifier: "493cdf0ed64774f7693fd6682106f07b")
!526 = !{!527, !552}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !525, file: !2, baseType: !528, align: 8)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>", scope: !512, file: !2, align: 8, elements: !529, templateParams: !550, identifier: "6176a270f118349e3a25afa86f7fffda")
!529 = !{!530, !549}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !528, file: !2, baseType: !531, align: 8)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !532, templateParams: !546, identifier: "4c6170cff869e6dd6689d88daf4d805f")
!532 = !{!533, !544}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !531, file: !2, baseType: !534, align: 8)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UTerm, typenum::bit::B1>", scope: !512, file: !2, align: 8, elements: !535, templateParams: !541, identifier: "272441dd357c75d89d199ed7e9040b1")
!535 = !{!536, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !534, file: !2, baseType: !537, align: 8)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "UTerm", scope: !512, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "4d68591b01f5c2b813b37c0038e83a04")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !534, file: !2, baseType: !539, align: 8)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "B1", scope: !540, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "8ccc6567864b02ac7daf355f41f198f2")
!540 = !DINamespace(name: "bit", scope: !513)
!541 = !{!542, !543}
!542 = !DITemplateTypeParameter(name: "U", type: !537)
!543 = !DITemplateTypeParameter(name: "B", type: !539)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !531, file: !2, baseType: !545, align: 8)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "B0", scope: !540, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "17f1a8bad085c4426d0a336484dc5acc")
!546 = !{!547, !548}
!547 = !DITemplateTypeParameter(name: "U", type: !534)
!548 = !DITemplateTypeParameter(name: "B", type: !545)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !528, file: !2, baseType: !539, align: 8)
!550 = !{!551, !543}
!551 = !DITemplateTypeParameter(name: "U", type: !531)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !525, file: !2, baseType: !545, align: 8)
!553 = !{!554, !548}
!554 = !DITemplateTypeParameter(name: "U", type: !528)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !522, file: !2, baseType: !539, align: 8)
!556 = !{!557, !543}
!557 = !DITemplateTypeParameter(name: "U", type: !525)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !519, file: !2, baseType: !545, align: 8)
!559 = !{!560, !548}
!560 = !DITemplateTypeParameter(name: "U", type: !522)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !516, file: !2, baseType: !545, align: 8)
!562 = !{!563, !548}
!563 = !DITemplateTypeParameter(name: "U", type: !519)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !511, file: !2, baseType: !545, align: 8)
!565 = !{!566, !548}
!566 = !DITemplateTypeParameter(name: "U", type: !516)
!567 = !{!568, !569, !589, !591}
!568 = !DILocalVariable(name: "f", arg: 1, scope: !442, file: !443, line: 379, type: !309)
!569 = !DILocalVariable(name: "destination", scope: !570, file: !443, line: 384, type: !571, align: 8)
!570 = distinct !DILexicalBlock(scope: !442, file: !443, line: 384, column: 13)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArrayBuilder<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>", scope: !274, file: !2, size: 1408, align: 64, elements: !572, templateParams: !587, identifier: "e4daf98b86c510f3ab5c9690e0bc2630")
!572 = !{!573, !586}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !571, file: !2, baseType: !574, size: 1344, align: 8, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<generic_array::GenericArray<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>>", scope: !575, file: !2, size: 1344, align: 8, elements: !577, templateParams: !584, identifier: "2cc1fe7c4a38c78cf15802e946e90dcf")
!575 = !DINamespace(name: "maybe_uninit", scope: !576)
!576 = !DINamespace(name: "mem", scope: !7)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !574, file: !2, baseType: !10, align: 8)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !574, file: !2, baseType: !580, size: 1344, align: 8)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<generic_array::GenericArray<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>>", scope: !581, file: !2, size: 1344, align: 8, elements: !582, templateParams: !584, identifier: "d9be39fc8a7addea7d8c9c6efc9a5cdb")
!581 = !DINamespace(name: "manually_drop", scope: !576)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !580, file: !2, baseType: !446, size: 1344, align: 8)
!584 = !{!585}
!585 = !DITemplateTypeParameter(name: "T", type: !446)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !571, file: !2, baseType: !19, size: 64, align: 64)
!587 = !{!99, !588}
!588 = !DITemplateTypeParameter(name: "N", type: !511)
!589 = !DILocalVariable(name: "destination_iter", scope: !590, file: !443, line: 387, type: !247, align: 8)
!590 = distinct !DILexicalBlock(scope: !570, file: !443, line: 387, column: 17)
!591 = !DILocalVariable(name: "position", scope: !590, file: !443, line: 387, type: !284, align: 8)
!592 = !{!99, !588, !593}
!593 = !DITemplateTypeParameter(name: "F", type: !309)
!594 = !DILocation(line: 379, column: 20, scope: !442)
!595 = !DILocation(line: 384, column: 17, scope: !570)
!596 = !DILocation(line: 387, column: 40, scope: !590)
!597 = !DILocation(line: 384, column: 35, scope: !442)
!598 = !DILocation(line: 387, column: 52, scope: !570)
!599 = !DILocation(line: 387, column: 22, scope: !570)
!600 = !DILocation(line: 387, column: 22, scope: !590)
!601 = !DILocation(line: 387, column: 40, scope: !570)
!602 = !DILocation(line: 389, column: 17, scope: !590)
!603 = !DILocation(line: 389, column: 55, scope: !590)
!604 = !DILocation(line: 396, column: 13, scope: !570)
!605 = !DILocation(line: 398, column: 5, scope: !442)
!606 = !DILocation(line: 398, column: 6, scope: !442)
!607 = distinct !DISubprogram(name: "generate<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, generic_array::impls::{impl#0}::default::{closure#0}>", linkageName: "_ZN110_$LT$generic_array..GenericArray$LT$T$C$N$GT$$u20$as$u20$generic_array..sequence..GenericSequence$LT$T$GT$$GT$8generate17hbdbfd0f879a0b51dE", scope: !273, file: !443, line: 379, type: !608, scopeLine: 379, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !712, retainedNodes: !690)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !278}
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArray<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>", scope: !274, file: !2, size: 1088, align: 8, elements: !611, templateParams: !653, identifier: "3408e7433dc4353f3608f421748a20a9")
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !610, file: !2, baseType: !613, size: 1088, align: 8)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>>>>", scope: !274, file: !2, size: 1088, align: 8, elements: !614, templateParams: !651, identifier: "74fef8675954f69ad78da4e937c2d03e")
!614 = !{!615, !649, !650}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !613, file: !2, baseType: !616, size: 544, align: 8)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>>>", scope: !274, file: !2, size: 544, align: 8, elements: !617, templateParams: !647, identifier: "ed7db3d323e22fdf52d905324be2a012")
!617 = !{!618, !645, !646}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !616, file: !2, baseType: !619, size: 272, align: 8)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>>", scope: !274, file: !2, size: 272, align: 8, elements: !620, templateParams: !643, identifier: "c810553c0a49e7b3ad54fa9f115318a6")
!620 = !{!621, !641, !642}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !619, file: !2, baseType: !622, size: 136, align: 8)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplOdd<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>>", scope: !274, file: !2, size: 136, align: 8, elements: !623, templateParams: !639, identifier: "9a64ad869d1b454d3b8a0926c7e3587d")
!623 = !{!624, !637, !638}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !622, file: !2, baseType: !625, size: 64, align: 8)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>>", scope: !274, file: !2, size: 64, align: 8, elements: !626, templateParams: !635, identifier: "9e71859f952bb6e095ae0ff5f2efcfc2")
!626 = !{!627, !633, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !625, file: !2, baseType: !628, size: 32, align: 8)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericArrayImplEven<u8, generic_array::GenericArrayImplEven<u8, generic_array::GenericArrayImplOdd<u8, [u8; 0]>>>", scope: !274, file: !2, size: 32, align: 8, elements: !629, templateParams: !487, identifier: "ecab41fcfc074cd258cd1009ce4fb39a")
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "parent1", scope: !628, file: !2, baseType: !467, size: 16, align: 8)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !628, file: !2, baseType: !467, size: 16, align: 8, offset: 16)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !628, file: !2, baseType: !482, align: 8, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !625, file: !2, baseType: !628, size: 32, align: 8, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !625, file: !2, baseType: !482, align: 8, offset: 64)
!635 = !{!99, !636}
!636 = !DITemplateTypeParameter(name: "U", type: !628)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !622, file: !2, baseType: !625, size: 64, align: 8, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !622, file: !2, baseType: !27, size: 8, align: 8, offset: 128)
!639 = !{!99, !640}
!640 = !DITemplateTypeParameter(name: "U", type: !625)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !619, file: !2, baseType: !622, size: 136, align: 8, offset: 136)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !619, file: !2, baseType: !482, align: 8, offset: 272)
!643 = !{!99, !644}
!644 = !DITemplateTypeParameter(name: "U", type: !622)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !616, file: !2, baseType: !619, size: 272, align: 8, offset: 272)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !616, file: !2, baseType: !482, align: 8, offset: 544)
!647 = !{!99, !648}
!648 = !DITemplateTypeParameter(name: "U", type: !619)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "parent2", scope: !613, file: !2, baseType: !616, size: 544, align: 8, offset: 544)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !613, file: !2, baseType: !482, align: 8, offset: 1088)
!651 = !{!99, !652}
!652 = !DITemplateTypeParameter(name: "U", type: !616)
!653 = !{!99, !654}
!654 = !DITemplateTypeParameter(name: "U", type: !655)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !656, templateParams: !688, identifier: "eed97367e4ea7e4afd4a74fc98dc86db")
!656 = !{!657, !687}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !655, file: !2, baseType: !658, align: 8)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !659, templateParams: !685, identifier: "93cf07e862b572ae6005c55775463493")
!659 = !{!660, !684}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !658, file: !2, baseType: !661, align: 8)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !662, templateParams: !682, identifier: "8a70f0a83cafca454ffc7a13c3271acd")
!662 = !{!663, !681}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !661, file: !2, baseType: !664, align: 8)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>", scope: !512, file: !2, align: 8, elements: !665, templateParams: !679, identifier: "9af47fc86c8ef5874fcb3b12493d0f82")
!665 = !{!666, !678}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !664, file: !2, baseType: !667, align: 8)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !668, templateParams: !676, identifier: "87376bee8b0faab5bd8f70fe878823c3")
!668 = !{!669, !675}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !667, file: !2, baseType: !670, align: 8)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>", scope: !512, file: !2, align: 8, elements: !671, templateParams: !674, identifier: "47dd9e26a0f58608d788549703fe2f0")
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "msb", scope: !670, file: !2, baseType: !531, align: 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !670, file: !2, baseType: !545, align: 8)
!674 = !{!551, !548}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !667, file: !2, baseType: !545, align: 8)
!676 = !{!677, !548}
!677 = !DITemplateTypeParameter(name: "U", type: !670)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !664, file: !2, baseType: !539, align: 8)
!679 = !{!680, !543}
!680 = !DITemplateTypeParameter(name: "U", type: !667)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !661, file: !2, baseType: !545, align: 8)
!682 = !{!683, !548}
!683 = !DITemplateTypeParameter(name: "U", type: !664)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !658, file: !2, baseType: !545, align: 8)
!685 = !{!686, !548}
!686 = !DITemplateTypeParameter(name: "U", type: !661)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !655, file: !2, baseType: !545, align: 8)
!688 = !{!689, !548}
!689 = !DITemplateTypeParameter(name: "U", type: !658)
!690 = !{!691, !692, !709, !711}
!691 = !DILocalVariable(name: "f", arg: 1, scope: !607, file: !443, line: 379, type: !278)
!692 = !DILocalVariable(name: "destination", scope: !693, file: !443, line: 384, type: !694, align: 8)
!693 = distinct !DILexicalBlock(scope: !607, file: !443, line: 384, column: 13)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArrayBuilder<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>", scope: !274, file: !2, size: 1152, align: 64, elements: !695, templateParams: !707, identifier: "b98ce93eed26baaedf38691864505170")
!695 = !{!696, !706}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !694, file: !2, baseType: !697, size: 1088, align: 8, offset: 64)
!697 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<generic_array::GenericArray<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>>", scope: !575, file: !2, size: 1088, align: 8, elements: !698, templateParams: !704, identifier: "f8718e160cf072bbc257f100412b4c42")
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !697, file: !2, baseType: !10, align: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !697, file: !2, baseType: !701, size: 1088, align: 8)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<generic_array::GenericArray<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>>>", scope: !581, file: !2, size: 1088, align: 8, elements: !702, templateParams: !704, identifier: "9b4af5c994835a13ed2d59ec3abcd81c")
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !701, file: !2, baseType: !610, size: 1088, align: 8)
!704 = !{!705}
!705 = !DITemplateTypeParameter(name: "T", type: !610)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !694, file: !2, baseType: !19, size: 64, align: 64)
!707 = !{!99, !708}
!708 = !DITemplateTypeParameter(name: "N", type: !655)
!709 = !DILocalVariable(name: "destination_iter", scope: !710, file: !443, line: 387, type: !247, align: 8)
!710 = distinct !DILexicalBlock(scope: !693, file: !443, line: 387, column: 17)
!711 = !DILocalVariable(name: "position", scope: !710, file: !443, line: 387, type: !284, align: 8)
!712 = !{!99, !708, !713}
!713 = !DITemplateTypeParameter(name: "F", type: !278)
!714 = !DILocation(line: 379, column: 20, scope: !607)
!715 = !DILocation(line: 384, column: 17, scope: !693)
!716 = !DILocation(line: 387, column: 40, scope: !710)
!717 = !DILocation(line: 384, column: 35, scope: !607)
!718 = !DILocation(line: 387, column: 52, scope: !693)
!719 = !DILocation(line: 387, column: 22, scope: !693)
!720 = !DILocation(line: 387, column: 22, scope: !710)
!721 = !DILocation(line: 387, column: 40, scope: !693)
!722 = !DILocation(line: 389, column: 17, scope: !710)
!723 = !DILocation(line: 389, column: 55, scope: !710)
!724 = !DILocation(line: 396, column: 13, scope: !693)
!725 = !DILocation(line: 398, column: 5, scope: !607)
!726 = !DILocation(line: 398, column: 6, scope: !607)
!727 = distinct !DISubprogram(name: "{closure#0}<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, generic_array::impls::{impl#0}::default::{closure#0}>", linkageName: "_ZN110_$LT$generic_array..GenericArray$LT$T$C$N$GT$$u20$as$u20$generic_array..sequence..GenericSequence$LT$T$GT$$GT$8generate28_$u7b$$u7b$closure$u7d$$u7d$17h4f3f29ceb0d010cbE", scope: !272, file: !443, line: 389, type: !728, scopeLine: 389, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !712, retainedNodes: !735)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !730, !731}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !271, size: 64, align: 64, dwarfAddressSpace: 0)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, &mut u8)", file: !2, size: 128, align: 64, elements: !732, templateParams: !4, identifier: "979841b3323b030da6f45aeec380399d")
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !731, file: !2, baseType: !19, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !731, file: !2, baseType: !259, size: 64, align: 64, offset: 64)
!735 = !{!736, !737, !738, !740, !741}
!736 = !DILocalVariable(name: "f", scope: !727, file: !443, line: 379, type: !278, align: 1)
!737 = !DILocalVariable(name: "position", scope: !727, file: !443, line: 387, type: !284, align: 8)
!738 = !DILocalVariable(name: "i", scope: !739, file: !443, line: 389, type: !19, align: 8)
!739 = distinct !DILexicalBlock(scope: !727, file: !443, line: 389, column: 66)
!740 = !DILocalVariable(name: "dst", scope: !739, file: !443, line: 389, type: !259, align: 8)
!741 = !DILocalVariable(arg: 2, scope: !727, file: !443, line: 389, type: !731)
!742 = !DILocation(line: 379, column: 20, scope: !727)
!743 = !DILocation(line: 387, column: 40, scope: !727)
!744 = !DILocation(line: 389, column: 56, scope: !727)
!745 = !DILocation(line: 389, column: 57, scope: !727)
!746 = !DILocation(line: 389, column: 57, scope: !739)
!747 = !DILocation(line: 389, column: 60, scope: !727)
!748 = !DILocation(line: 389, column: 60, scope: !739)
!749 = !DILocation(line: 390, column: 37, scope: !739)
!750 = !DILocation(line: 390, column: 21, scope: !739)
!751 = !DILocation(line: 392, column: 21, scope: !739)
!752 = !DILocation(line: 393, column: 18, scope: !727)
!753 = distinct !DISubprogram(name: "{closure#0}<u8, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, generic_array::impls::{impl#0}::default::{closure#0}>", linkageName: "_ZN110_$LT$generic_array..GenericArray$LT$T$C$N$GT$$u20$as$u20$generic_array..sequence..GenericSequence$LT$T$GT$$GT$8generate28_$u7b$$u7b$closure$u7d$$u7d$17h82759f998790a125E", scope: !272, file: !443, line: 389, type: !754, scopeLine: 389, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !592, retainedNodes: !757)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !756, !731}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !305, size: 64, align: 64, dwarfAddressSpace: 0)
!757 = !{!758, !759, !760, !762, !763}
!758 = !DILocalVariable(name: "f", scope: !753, file: !443, line: 379, type: !309, align: 1)
!759 = !DILocalVariable(name: "position", scope: !753, file: !443, line: 387, type: !284, align: 8)
!760 = !DILocalVariable(name: "i", scope: !761, file: !443, line: 389, type: !19, align: 8)
!761 = distinct !DILexicalBlock(scope: !753, file: !443, line: 389, column: 66)
!762 = !DILocalVariable(name: "dst", scope: !761, file: !443, line: 389, type: !259, align: 8)
!763 = !DILocalVariable(arg: 2, scope: !753, file: !443, line: 389, type: !731)
!764 = !DILocation(line: 379, column: 20, scope: !753)
!765 = !DILocation(line: 387, column: 40, scope: !753)
!766 = !DILocation(line: 389, column: 56, scope: !753)
!767 = !DILocation(line: 389, column: 57, scope: !753)
!768 = !DILocation(line: 389, column: 57, scope: !761)
!769 = !DILocation(line: 389, column: 60, scope: !753)
!770 = !DILocation(line: 389, column: 60, scope: !761)
!771 = !DILocation(line: 390, column: 37, scope: !761)
!772 = !DILocation(line: 390, column: 21, scope: !761)
!773 = !DILocation(line: 392, column: 21, scope: !761)
!774 = !DILocation(line: 393, column: 18, scope: !753)
!775 = distinct !DISubprogram(name: "new<core::slice::iter::ChunksExact<u8>, core::slice::iter::IterMut<u64>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3new17h01a2cd2934f106b6E", scope: !776, file: !55, line: 256, type: !777, scopeLine: 256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !122, retainedNodes: !779)
!776 = !DINamespace(name: "{impl#5}", scope: !57)
!777 = !DISubroutineType(types: !778)
!778 = !{!88, !91, !101}
!779 = !{!780, !781, !782, !784}
!780 = !DILocalVariable(name: "a", arg: 1, scope: !775, file: !55, line: 256, type: !91)
!781 = !DILocalVariable(name: "b", arg: 2, scope: !775, file: !55, line: 256, type: !101)
!782 = !DILocalVariable(name: "a_len", scope: !783, file: !55, line: 257, type: !19, align: 8)
!783 = distinct !DILexicalBlock(scope: !775, file: !55, line: 257, column: 9)
!784 = !DILocalVariable(name: "len", scope: !785, file: !55, line: 258, type: !19, align: 8)
!785 = distinct !DILexicalBlock(scope: !783, file: !55, line: 258, column: 9)
!786 = !DILocation(line: 256, column: 12, scope: !775)
!787 = !DILocation(line: 256, column: 18, scope: !775)
!788 = !DILocation(line: 257, column: 21, scope: !775)
!789 = !DILocation(line: 257, column: 13, scope: !783)
!790 = !DILocation(line: 258, column: 35, scope: !783)
!791 = !DILocation(line: 258, column: 19, scope: !783)
!792 = !DILocation(line: 258, column: 13, scope: !785)
!793 = !DILocation(line: 259, column: 15, scope: !785)
!794 = !DILocation(line: 259, column: 18, scope: !785)
!795 = !DILocation(line: 259, column: 9, scope: !785)
!796 = !DILocation(line: 260, column: 6, scope: !775)
!797 = distinct !DISubprogram(name: "next<core::slice::iter::ChunksExact<u8>, core::slice::iter::IterMut<u64>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$4next17h94540819d2e64123E", scope: !776, file: !55, line: 263, type: !60, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !122, retainedNodes: !798)
!798 = !{!799, !800, !802}
!799 = !DILocalVariable(name: "self", arg: 1, scope: !797, file: !55, line: 263, type: !87)
!800 = !DILocalVariable(name: "i", scope: !801, file: !55, line: 265, type: !19, align: 8)
!801 = distinct !DILexicalBlock(scope: !797, file: !55, line: 265, column: 13)
!802 = !DILocalVariable(name: "i", scope: !803, file: !55, line: 274, type: !19, align: 8)
!803 = distinct !DILexicalBlock(scope: !797, file: !55, line: 274, column: 13)
!804 = !DILocation(line: 263, column: 13, scope: !797)
!805 = !DILocation(line: 264, column: 12, scope: !797)
!806 = !DILocation(line: 264, column: 25, scope: !797)
!807 = !DILocation(line: 273, column: 19, scope: !797)
!808 = !DILocation(line: 265, column: 21, scope: !797)
!809 = !DILocation(line: 265, column: 17, scope: !801)
!810 = !DILocation(line: 268, column: 13, scope: !801)
!811 = !DILocation(line: 271, column: 23, scope: !801)
!812 = !DILocation(line: 271, column: 59, scope: !801)
!813 = !DILocation(line: 271, column: 22, scope: !801)
!814 = !DILocation(line: 271, column: 17, scope: !801)
!815 = !DILocation(line: 264, column: 9, scope: !797)
!816 = !DILocation(line: 287, column: 6, scope: !797)
!817 = !DILocation(line: 273, column: 46, scope: !797)
!818 = !DILocation(line: 273, column: 59, scope: !797)
!819 = !{i8 0, i8 2}
!820 = !DILocation(line: 285, column: 13, scope: !797)
!821 = !DILocation(line: 273, column: 16, scope: !797)
!822 = !DILocation(line: 274, column: 21, scope: !797)
!823 = !DILocation(line: 274, column: 17, scope: !803)
!824 = !DILocation(line: 276, column: 13, scope: !803)
!825 = !DILocation(line: 277, column: 13, scope: !803)
!826 = !DILocation(line: 281, column: 17, scope: !803)
!827 = !DILocation(line: 281, column: 51, scope: !803)
!828 = !DILocation(line: 283, column: 13, scope: !803)
!829 = distinct !DISubprogram(name: "fold<core::slice::iter::Iter<u8>, sha3::left_encode::{closure#0}, usize, core::iter::traits::iterator::Iterator::count::{closure#0}>", linkageName: "_ZN115_$LT$core..iter..adapters..take_while..TakeWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h633b14e7f2837978E", scope: !831, file: !830, line: 98, type: !833, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !862, retainedNodes: !858)
!830 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/take_while.rs", directory: "", checksumkind: CSK_MD5, checksum: "377635e148bc28b4565d87d0a1bd255d")
!831 = !DINamespace(name: "{impl#2}", scope: !832)
!832 = !DINamespace(name: "take_while", scope: !58)
!833 = !DISubroutineType(types: !834)
!834 = !{!19, !835, !19, !856}
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "TakeWhile<core::slice::iter::Iter<u8>, sha3::left_encode::{closure#0}>", scope: !832, file: !2, size: 192, align: 64, elements: !836, templateParams: !853, identifier: "9ccea5745126c0d317018ab9dd040d51")
!836 = !{!837, !847, !849}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !835, file: !2, baseType: !838, size: 128, align: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !92, file: !2, size: 128, align: 64, elements: !839, templateParams: !98, identifier: "d497f50a2820f37aaf72dc233672c27f")
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !838, file: !2, baseType: !250, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !838, file: !2, baseType: !77, size: 64, align: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !838, file: !2, baseType: !843, align: 8)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !116, file: !2, align: 8, elements: !4, templateParams: !844, identifier: "5ce1d76292b615ef89d76584ca834d06")
!844 = !{!845}
!845 = !DITemplateTypeParameter(name: "T", type: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !835, file: !2, baseType: !848, size: 8, align: 8, offset: 128)
!848 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !835, file: !2, baseType: !850, align: 8)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !851, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "9db425a1882e057e35d6d5c79b04cd31")
!851 = !DINamespace(name: "left_encode", scope: !852)
!852 = !DINamespace(name: "sha3", scope: null)
!853 = !{!854, !855}
!854 = !DITemplateTypeParameter(name: "I", type: !838)
!855 = !DITemplateTypeParameter(name: "P", type: !850)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !857, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "29220c09f75265e7b46654c0a7e3e3e2")
!857 = !DINamespace(name: "count", scope: !266)
!858 = !{!859, !860, !861}
!859 = !DILocalVariable(name: "self", arg: 1, scope: !829, file: !830, line: 98, type: !835)
!860 = !DILocalVariable(name: "init", arg: 2, scope: !829, file: !830, line: 98, type: !19)
!861 = !DILocalVariable(name: "fold", arg: 3, scope: !829, file: !830, line: 98, type: !856)
!862 = !{!854, !855, !863, !864}
!863 = !DITemplateTypeParameter(name: "Acc", type: !19)
!864 = !DITemplateTypeParameter(name: "Fold", type: !856)
!865 = !DILocation(line: 98, column: 24, scope: !829)
!866 = !DILocation(line: 98, column: 34, scope: !829)
!867 = !DILocation(line: 98, column: 45, scope: !829)
!868 = !DILocation(line: 108, column: 29, scope: !829)
!869 = !DILocation(line: 108, column: 9, scope: !829)
!870 = !DILocation(line: 109, column: 5, scope: !829)
!871 = !DILocation(line: 109, column: 6, scope: !829)
!872 = distinct !DISubprogram(name: "ok<usize, &u8, core::iter::traits::iterator::Iterator::count::{closure#0}>", linkageName: "_ZN115_$LT$core..iter..adapters..take_while..TakeWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold2ok17he3e69a9453bedba7E", scope: !873, file: !830, line: 104, type: !874, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !878, retainedNodes: !876)
!873 = !DINamespace(name: "fold", scope: !831)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !856}
!876 = !{!877}
!877 = !DILocalVariable(name: "f", arg: 1, scope: !872, file: !830, line: 104, type: !856)
!878 = !{!879, !845, !880}
!879 = !DITemplateTypeParameter(name: "B", type: !19)
!880 = !DITemplateTypeParameter(name: "impl FnMut(B, T) -> B", type: !856)
!881 = !DILocation(line: 104, column: 21, scope: !872)
!882 = !DILocation(line: 105, column: 13, scope: !872)
!883 = !DILocation(line: 106, column: 10, scope: !872)
!884 = distinct !DISubprogram(name: "{closure#0}<usize, &u8, core::iter::traits::iterator::Iterator::count::{closure#0}>", linkageName: "_ZN115_$LT$core..iter..adapters..take_while..TakeWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold2ok28_$u7b$$u7b$closure$u7d$$u7d$17hf212217ef2ad9471E", scope: !885, file: !830, line: 105, type: !886, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !878, retainedNodes: !892)
!885 = !DINamespace(name: "ok", scope: !873)
!886 = !DISubroutineType(types: !887)
!887 = !{!147, !888, !19, !846}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !889, size: 64, align: 64, dwarfAddressSpace: 0)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !885, file: !2, align: 8, elements: !890, templateParams: !4, identifier: "d1fdf6882c2a352882fbf50407edbddd")
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !889, file: !2, baseType: !856, align: 8)
!892 = !{!893, !894, !895}
!893 = !DILocalVariable(name: "acc", arg: 2, scope: !884, file: !830, line: 105, type: !19)
!894 = !DILocalVariable(name: "x", arg: 3, scope: !884, file: !830, line: 105, type: !846)
!895 = !DILocalVariable(name: "f", scope: !884, file: !830, line: 104, type: !856, align: 1)
!896 = !DILocation(line: 104, column: 21, scope: !884)
!897 = !DILocation(line: 105, column: 19, scope: !884)
!898 = !DILocation(line: 105, column: 24, scope: !884)
!899 = !DILocation(line: 105, column: 30, scope: !884)
!900 = !DILocation(line: 105, column: 27, scope: !884)
!901 = !DILocation(line: 105, column: 40, scope: !884)
!902 = distinct !DISubprogram(name: "try_fold<core::slice::iter::Iter<u8>, sha3::left_encode::{closure#0}, usize, core::iter::adapters::take_while::{impl#2}::fold::ok::{closure#0}, core::result::Result<usize, !>>", linkageName: "_ZN115_$LT$core..iter..adapters..take_while..TakeWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$8try_fold17h3c5bd705f0cbfd82E", scope: !831, file: !830, line: 67, type: !903, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !916, retainedNodes: !906)
!903 = !DISubroutineType(types: !904)
!904 = !{!147, !905, !19, !889}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut TakeWhile<core::slice::iter::Iter<u8>, sha3::left_encode::{closure#0}>", baseType: !835, size: 64, align: 64, dwarfAddressSpace: 0)
!906 = !{!907, !908, !909, !910, !913}
!907 = !DILocalVariable(name: "self", arg: 1, scope: !902, file: !830, line: 67, type: !905)
!908 = !DILocalVariable(name: "init", arg: 2, scope: !902, file: !830, line: 67, type: !19)
!909 = !DILocalVariable(name: "fold", arg: 3, scope: !902, file: !830, line: 67, type: !889)
!910 = !DILocalVariable(name: "flag", scope: !911, file: !830, line: 91, type: !912, align: 8)
!911 = distinct !DILexicalBlock(scope: !902, file: !830, line: 91, column: 13)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bool", baseType: !848, size: 64, align: 64, dwarfAddressSpace: 0)
!913 = !DILocalVariable(name: "p", scope: !914, file: !830, line: 92, type: !915, align: 8)
!914 = distinct !DILexicalBlock(scope: !911, file: !830, line: 92, column: 13)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !850, size: 64, align: 64, dwarfAddressSpace: 0)
!916 = !{!854, !855, !863, !917, !918}
!917 = !DITemplateTypeParameter(name: "Fold", type: !889)
!918 = !DITemplateTypeParameter(name: "R", type: !147)
!919 = !DILocation(line: 67, column: 31, scope: !902)
!920 = !DILocation(line: 67, column: 42, scope: !902)
!921 = !DILocation(line: 67, column: 53, scope: !902)
!922 = !DILocation(line: 88, column: 12, scope: !902)
!923 = !DILocation(line: 91, column: 24, scope: !902)
!924 = !DILocation(line: 91, column: 17, scope: !911)
!925 = !DILocation(line: 92, column: 21, scope: !911)
!926 = !DILocation(line: 92, column: 17, scope: !914)
!927 = !DILocation(line: 93, column: 13, scope: !914)
!928 = !DILocation(line: 93, column: 53, scope: !914)
!929 = !DILocation(line: 93, column: 38, scope: !914)
!930 = !DILocation(line: 89, column: 19, scope: !902)
!931 = !DILocation(line: 88, column: 9, scope: !902)
!932 = !DILocation(line: 95, column: 5, scope: !902)
!933 = !DILocation(line: 95, column: 6, scope: !902)
!934 = distinct !DISubprogram(name: "check<&u8, usize, core::result::Result<usize, !>, sha3::left_encode::{closure#0}, core::iter::adapters::take_while::{impl#2}::fold::ok::{closure#0}>", linkageName: "_ZN115_$LT$core..iter..adapters..take_while..TakeWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$8try_fold5check17hf74256acdfece5ddE", scope: !935, file: !830, line: 73, type: !936, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !948, retainedNodes: !944)
!935 = !DINamespace(name: "try_fold", scope: !831)
!936 = !DISubroutineType(types: !937)
!937 = !{!938, !912, !915, !889}
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !939, file: !2, size: 128, align: 64, elements: !940, templateParams: !4, identifier: "ca43ea771cbc5e8750285794afc85416")
!939 = !DINamespace(name: "check", scope: !935)
!940 = !{!941, !942, !943}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !938, file: !2, baseType: !915, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fold", scope: !938, file: !2, baseType: !889, align: 8)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !938, file: !2, baseType: !912, size: 64, align: 64, offset: 64)
!944 = !{!945, !946, !947}
!945 = !DILocalVariable(name: "flag", arg: 1, scope: !934, file: !830, line: 74, type: !912)
!946 = !DILocalVariable(name: "p", arg: 2, scope: !934, file: !830, line: 75, type: !915)
!947 = !DILocalVariable(name: "fold", arg: 3, scope: !934, file: !830, line: 76, type: !889)
!948 = !{!845, !863, !918, !949, !950}
!949 = !DITemplateTypeParameter(name: "impl FnMut(&T) -> bool", type: !850)
!950 = !DITemplateTypeParameter(name: "impl FnMut(Acc, T) -> R + 'a", type: !889)
!951 = !DILocation(line: 74, column: 13, scope: !934)
!952 = !DILocation(line: 75, column: 13, scope: !934)
!953 = !DILocation(line: 76, column: 13, scope: !934)
!954 = !DILocation(line: 78, column: 13, scope: !934)
!955 = !DILocation(line: 86, column: 10, scope: !934)
!956 = distinct !DISubprogram(name: "{closure#0}<&u8, usize, core::result::Result<usize, !>, sha3::left_encode::{closure#0}, core::iter::adapters::take_while::{impl#2}::fold::ok::{closure#0}>", linkageName: "_ZN115_$LT$core..iter..adapters..take_while..TakeWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$8try_fold5check28_$u7b$$u7b$closure$u7d$$u7d$17ha609fb092c953a39E", scope: !939, file: !830, line: 78, type: !957, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !948, retainedNodes: !960)
!957 = !DISubroutineType(types: !958)
!958 = !{!137, !959, !19, !846}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut {closure#0}", baseType: !938, size: 64, align: 64, dwarfAddressSpace: 0)
!960 = !{!961, !962, !963, !964, !965}
!961 = !DILocalVariable(name: "acc", arg: 2, scope: !956, file: !830, line: 78, type: !19)
!962 = !DILocalVariable(name: "x", arg: 3, scope: !956, file: !830, line: 78, type: !846)
!963 = !DILocalVariable(name: "p", scope: !956, file: !830, line: 75, type: !915, align: 8)
!964 = !DILocalVariable(name: "fold", scope: !956, file: !830, line: 76, type: !889, align: 1)
!965 = !DILocalVariable(name: "flag", scope: !956, file: !830, line: 74, type: !912, align: 8)
!966 = !DILocation(line: 75, column: 13, scope: !956)
!967 = !DILocation(line: 76, column: 13, scope: !956)
!968 = !DILocation(line: 74, column: 13, scope: !956)
!969 = !DILocation(line: 78, column: 19, scope: !956)
!970 = !DILocation(line: 78, column: 24, scope: !956)
!971 = !DILocation(line: 79, column: 20, scope: !956)
!972 = !DILocation(line: 82, column: 21, scope: !956)
!973 = !DILocation(line: 83, column: 46, scope: !956)
!974 = !DILocation(line: 80, column: 43, scope: !956)
!975 = !DILocation(line: 80, column: 53, scope: !956)
!976 = !DILocation(line: 80, column: 21, scope: !956)
!977 = !DILocation(line: 79, column: 17, scope: !956)
!978 = !DILocation(line: 85, column: 13, scope: !956)
!979 = !DILocation(line: 83, column: 21, scope: !956)
!980 = !DILocation(line: 85, column: 14, scope: !956)
!981 = distinct !DISubprogram(name: "digest_blocks<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, block_buffer::Eager, sha3::{impl#137}::new_with_function_name::{closure#2}>", linkageName: "_ZN12block_buffer35BlockBuffer$LT$BlockSize$C$Kind$GT$13digest_blocks17h196ba97a6f0a728cE", scope: !983, file: !982, line: 113, type: !996, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, templateParams: !1035, retainedNodes: !1012)
!982 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/block-buffer-0.10.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "9ffd207e06e802b5d88da8528bbd0f7e")
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlockBuffer<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B1>, typenum::bit::B0>, typenum::bit::B0>, typenum::bit::B0>, block_buffer::Eager>", scope: !984, file: !2, size: 1096, align: 8, elements: !985, templateParams: !993, identifier: "e1bc14681c072f07e23eac59c22cd994")
!984 = !DINamespace(name: "block_buffer", scope: null)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !983, file: !2, baseType: !610, size: 1088, align: 8)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !983, file: !2, baseType: !27, size: 8, align: 8, offset: 1088)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_pd", scope: !983, file: !2, baseType: !989, align: 8)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<block_buffer::Eager>", scope: !116, file: !2, align: 8, elements: !4, templateParams: !990, identifier: "a8404aa103352f02f030c5cfee2044a5")
!990 = !{!991}
!991 = !DITemplateTypeParameter(name: "T", type: !992)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "Eager", scope: !984, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "e4d0f98565863cdfaa9dcadd901e961c")
!993 = !{!994, !995}
!994 = !DITemplateTypeParameter(name: "BlockSize", type: !655)
!995 = !DITemplateTypeParameter(name: "Kind", type: !992)
