; ModuleID = 'solana_frozen_abi.a9c5bcf2-cgu.0'
source_filename = "solana_frozen_abi.a9c5bcf2-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"std::sync::atomic::AtomicUsize" = type { i64 }
%"std::string::String" = type { %"std::vec::Vec<u8>" }
%"std::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"std::panic::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"std::ops::RangeFull" = type {}
%"std::slice::ChunksExactMut<u8>" = type { { [0 x i8]*, i64 }, { [0 x i8]*, i64 }, i64 }
%"std::option::Option<usize>::Some" = type { [1 x i64], i64 }
%"[closure@std::iter::Iterator::for_each::call<std::string::String, [closure@<std::vec::Vec<std::string::String> as std::vec::spec_extend::SpecExtend<std::string::String, std::iter::Map<std::slice::Iter<&str>, [closure@/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.34/src/abi_digester.rs:141:18: 145:14]>>>::spec_extend::{closure#0}]>::{closure#0}]" = type { %"[closure@<std::vec::Vec<std::string::String> as std::vec::spec_extend::SpecExtend<std::string::String, std::iter::Map<std::slice::Iter<&str>, [closure@/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.34/src/abi_digester.rs:141:18: 145:14]>>>::spec_extend::{closure#0}]" }

!12 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !5, file: !2, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Option<lazy_static::lazy::{impl#0}::get::{closure#0}>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<lazy_static::lazy::{impl#0}::get::{closure#0}>", scope: !15, file: !2, size: 64, align: 64, elements: !17, identifier: "372cc007a07977def1a54351ddeef1c4")
!15 = !DINamespace(name: "option", scope: !16)
!16 = !DINamespace(name: "core", scope: null)
!17 = !{!18}
!18 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 64, align: 64, elements: !19, templateParams: !22, identifier: "372cc007a07977def1a54351ddeef1c4_variant_part", discriminator: !84)
!19 = !{!20, !262}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !18, file: !2, baseType: !21, size: 64, align: 64, extraData: i64 0)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !14, file: !2, size: 64, align: 64, elements: !4, templateParams: !22, identifier: "372cc007a07977def1a54351ddeef1c4::None")
!22 = !{!23}
!23 = !DITemplateTypeParameter(name: "T", type: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !25, file: !2, size: 64, align: 64, elements: !29, templateParams: !4, identifier: "de5e94cec692ff148a6322a07c9ac003")
!25 = !DINamespace(name: "get", scope: !26)
!26 = !DINamespace(name: "{impl#0}", scope: !27)
!27 = !DINamespace(name: "lazy", scope: !28)
!28 = !DINamespace(name: "lazy_static", scope: null)
!29 = !{!30, !258}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self", scope: !24, file: !2, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&Lazy<alloc::vec::Vec<u8, alloc::alloc::Global>>", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Lazy<alloc::vec::Vec<u8, alloc::alloc::Global>>", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !27, file: !2, size: 256, align: 64, elements: !34, templateParams: !49, identifier: "201744ff0200844293b5bbfd1fb76808")
!34 = !{!35, !88}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !33, file: !2, baseType: !36, size: 192, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !37, file: !2, size: 192, align: 64, elements: !38, templateParams: !86, identifier: "df4d9b0f92ca9662481c7efb64a97cd1")
!37 = !DINamespace(name: "cell", scope: !16)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !36, file: !2, baseType: !40, size: 192, align: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !37, file: !2, size: 192, align: 64, elements: !41, templateParams: !86, identifier: "39b3d6b2dfd60198d314c8262c4d65b")
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !40, file: !2, baseType: !43, size: 192, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !15, file: !2, size: 192, align: 64, elements: !44, identifier: "33163b47628f075339a1145b7b05336f")
!44 = !{!45}
!45 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 192, align: 64, elements: !46, templateParams: !49, identifier: "33163b47628f075339a1145b7b05336f_variant_part", discriminator: !84)
!46 = !{!47, !80}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !45, file: !2, baseType: !48, size: 192, align: 64, extraData: i64 0)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !43, file: !2, size: 192, align: 64, elements: !4, templateParams: !49, identifier: "33163b47628f075339a1145b7b05336f::None")
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "T", type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !52, file: !2, size: 192, align: 64, elements: !54, templateParams: !77, identifier: "56aa0380f8224c92be7dc99cfce9180f")
!52 = !DINamespace(name: "vec", scope: !53)
!53 = !DINamespace(name: "alloc", scope: null)
!54 = !{!55, !79}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !51, file: !2, baseType: !56, size: 128, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !57, file: !2, size: 128, align: 64, elements: !58, templateParams: !77, identifier: "47ed2282bf82d40f2b2c1ebc77e9f331")
!57 = !DINamespace(name: "raw_vec", scope: !53)
!58 = !{!59, !72, !74}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !56, file: !2, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !61, file: !2, size: 64, align: 64, elements: !63, templateParams: !70, identifier: "76ad11c5918345b022d81965d637386")
!61 = !DINamespace(name: "unique", scope: !62)
!62 = !DINamespace(name: "ptr", scope: !16)
!63 = !{!64, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !60, file: !2, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !60, file: !2, baseType: !68, align: 8)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !70, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!69 = !DINamespace(name: "marker", scope: !16)
!70 = !{!71}
!71 = !DITemplateTypeParameter(name: "T", type: !66)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !56, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !56, file: !2, baseType: !75, align: 8)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !76, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "9d0734f8822fbd33e4e561ab380af08d")
!76 = !DINamespace(name: "alloc", scope: !53)
!77 = !{!71, !78}
!78 = !DITemplateTypeParameter(name: "A", type: !75)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !51, file: !2, baseType: !73, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !45, file: !2, baseType: !81, size: 192, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !43, file: !2, size: 192, align: 64, elements: !82, templateParams: !49, identifier: "33163b47628f075339a1145b7b05336f::Some")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !81, file: !2, baseType: !51, size: 192, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !2, baseType: !85, size: 64, align: 64, flags: DIFlagArtificial)
!85 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!86 = !{!87}
!87 = !DITemplateTypeParameter(name: "T", type: !43)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !33, file: !2, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !8, file: !2, size: 64, align: 64, elements: !90, templateParams: !4, identifier: "1fbde1bcd0ed011930f5d3d3fe091c7")
!90 = !{!91, !102}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "state_and_queue", scope: !89, file: !2, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !93, file: !2, size: 64, align: 64, elements: !95, templateParams: !4, identifier: "5e41b245074eac955bc5023e46066561")
!93 = !DINamespace(name: "atomic", scope: !94)
!94 = !DINamespace(name: "sync", scope: !16)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !92, file: !2, baseType: !97, size: 64, align: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !37, file: !2, size: 64, align: 64, elements: !98, templateParams: !100, identifier: "df37019b130d2c01fbc34865afbd6522")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !97, file: !2, baseType: !73, size: 64, align: 64)
!100 = !{!101}
!101 = !DITemplateTypeParameter(name: "T", type: !73)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !89, file: !2, baseType: !103, align: 8)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*const std::sync::once::Waiter>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !104, identifier: "b0a9432132783db2dea61ab7de36dee8")
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "T", type: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const Waiter", baseType: !107, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waiter", scope: !8, file: !2, size: 192, align: 64, elements: !108, templateParams: !4, identifier: "4b959df2fa5f1211acd8123e44eeed16")
!108 = !{!109, !256, !257}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !107, file: !2, baseType: !110, size: 64, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<std::thread::Thread>>", scope: !37, file: !2, size: 64, align: 64, elements: !111, templateParams: !254, identifier: "4bd3b60d175083b2d03638765edb81d8")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !110, file: !2, baseType: !113, size: 64, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::thread::Thread>>", scope: !37, file: !2, size: 64, align: 64, elements: !114, templateParams: !254, identifier: "914aea111ec7ffe680d5f7742aa8df32")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !113, file: !2, baseType: !116, size: 64, align: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::thread::Thread>", scope: !15, file: !2, size: 64, align: 64, elements: !117, identifier: "e1e809684530125715213d9f1b61af78")
!117 = !{!118}
!118 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 64, align: 64, elements: !119, templateParams: !122, identifier: "e1e809684530125715213d9f1b61af78_variant_part", discriminator: !84)
!119 = !{!120, !250}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !118, file: !2, baseType: !121, size: 64, align: 64, extraData: i64 0)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !116, file: !2, size: 64, align: 64, elements: !4, templateParams: !122, identifier: "e1e809684530125715213d9f1b61af78::None")
!122 = !{!123}
!123 = !DITemplateTypeParameter(name: "T", type: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !125, file: !2, size: 64, align: 64, elements: !126, templateParams: !4, identifier: "a2a2c2a56481fb881a7eb6e01c9c89c4")
!125 = !DINamespace(name: "thread", scope: !10)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !124, file: !2, baseType: !128, size: 64, align: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !129, file: !2, size: 64, align: 64, elements: !130, templateParams: !244, identifier: "399839f28d289b51e76fbfc8f73895ab")
!129 = !DINamespace(name: "sync", scope: !53)
!130 = !{!131, !248}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !128, file: !2, baseType: !132, size: 64, align: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !133, file: !2, size: 64, align: 64, elements: !134, templateParams: !246, identifier: "e88946256462d456db13d8e314de6596")
!133 = !DINamespace(name: "non_null", scope: !62)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !132, file: !2, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ArcInner<std::thread::Inner>", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !129, file: !2, size: 640, align: 64, elements: !138, templateParams: !244, identifier: "b6c840a43d4f180afe9725f007775656")
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !137, file: !2, baseType: !92, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !137, file: !2, baseType: !92, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !137, file: !2, baseType: !142, size: 512, align: 64, offset: 128)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !125, file: !2, size: 512, align: 64, elements: !143, templateParams: !4, identifier: "7590b2094bafe2305ec36b1a296b9b3")
!143 = !{!144, !171, !180}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !2, baseType: !145, size: 128, align: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::ffi::c_str::CString>", scope: !15, file: !2, size: 128, align: 64, elements: !146, identifier: "19c748e11c7d5f51ef35a5828a0443a3")
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !148, templateParams: !151, identifier: "19c748e11c7d5f51ef35a5828a0443a3_variant_part", discriminator: !84)
!148 = !{!149, !167}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !2, baseType: !150, size: 128, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !145, file: !2, size: 128, align: 64, elements: !4, templateParams: !151, identifier: "19c748e11c7d5f51ef35a5828a0443a3::None")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !154, file: !2, size: 128, align: 64, elements: !156, templateParams: !4, identifier: "839ab753bf6674f3b648cd0fddce5660")
!154 = !DINamespace(name: "c_str", scope: !155)
!155 = !DINamespace(name: "ffi", scope: !10)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !153, file: !2, baseType: !158, size: 128, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !159, templateParams: !162, identifier: "b59722a6be25bb6578cf3d4b11e88249")
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !158, file: !2, baseType: !65, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !158, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!162 = !{!163, !78}
!163 = !DITemplateTypeParameter(name: "T", type: !164)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, align: 8, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: -1, lowerBound: 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !2, baseType: !168, size: 128, align: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !145, file: !2, size: 128, align: 64, elements: !169, templateParams: !151, identifier: "19c748e11c7d5f51ef35a5828a0443a3::Some")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !2, baseType: !153, size: 128, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !2, baseType: !172, size: 64, align: 64, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !125, file: !2, size: 64, align: 64, elements: !173, templateParams: !4, identifier: "9fbb44571d59bf2b1c86dc63dce25f9c")
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !172, file: !2, baseType: !175, size: 64, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !176, file: !2, size: 64, align: 64, elements: !178, templateParams: !4, identifier: "1e41a93ffc1e9a86a10273503e90f1e7")
!176 = !DINamespace(name: "nonzero", scope: !177)
!177 = !DINamespace(name: "num", scope: !16)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !2, baseType: !85, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !142, file: !2, baseType: !181, size: 320, align: 64, offset: 192)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !182, file: !2, size: 320, align: 64, elements: !185, templateParams: !4, identifier: "5cd505a94c61673a6b17193689631081")
!182 = !DINamespace(name: "generic", scope: !183)
!183 = !DINamespace(name: "thread_parker", scope: !184)
!184 = !DINamespace(name: "sys_common", scope: !10)
!185 = !{!186, !187, !227}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !2, baseType: !92, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !181, file: !2, baseType: !188, size: 128, align: 64, offset: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<()>", scope: !189, file: !2, size: 128, align: 64, elements: !190, templateParams: !225, identifier: "c877ed3440fbdf58e2aeed8f758e4412")
!189 = !DINamespace(name: "mutex", scope: !9)
!190 = !{!191, !209, !220}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !188, file: !2, baseType: !192, size: 64, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovableMutex", scope: !193, file: !2, size: 64, align: 64, elements: !194, templateParams: !4, identifier: "11fefaf6ce17553de8c18e693c9ffb8b")
!193 = !DINamespace(name: "mutex", scope: !184)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !192, file: !2, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::sbf::mutex::Mutex, alloc::alloc::Global>", baseType: !197, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !198, file: !2, size: 8, align: 8, elements: !201, templateParams: !4, identifier: "ee97b508b1363844ffebba9dec77d76")
!198 = !DINamespace(name: "mutex", scope: !199)
!199 = !DINamespace(name: "sbf", scope: !200)
!200 = !DINamespace(name: "sys", scope: !10)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !197, file: !2, baseType: !203, size: 8, align: 8)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<bool>", scope: !37, file: !2, size: 8, align: 8, elements: !204, templateParams: !207, identifier: "1d2efc1eecbe52d0c968aad4ca26331")
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !2, baseType: !206, size: 8, align: 8)
!206 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !206)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !188, file: !2, baseType: !210, size: 8, align: 8, offset: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !211, file: !2, size: 8, align: 8, elements: !212, templateParams: !4, identifier: "2287df844b97ce7e2ac5b6e5b5d659f9")
!211 = !DINamespace(name: "poison", scope: !9)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !210, file: !2, baseType: !214, size: 8, align: 8)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !93, file: !2, size: 8, align: 8, elements: !215, templateParams: !4, identifier: "ac8b099912c8a0b29442ebcbb2c8ea79")
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !214, file: !2, baseType: !217, size: 8, align: 8)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !37, file: !2, size: 8, align: 8, elements: !218, templateParams: !70, identifier: "5e9abfe57acac594c6b4d5ace44dc91c")
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !217, file: !2, baseType: !66, size: 8, align: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !2, baseType: !221, align: 8, offset: 72)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<()>", scope: !37, file: !2, align: 8, elements: !222, templateParams: !225, identifier: "54e48b01b3396e13bdcd619567a2cf86")
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !221, file: !2, baseType: !224, align: 8)
!224 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!225 = !{!226}
!226 = !DITemplateTypeParameter(name: "T", type: !224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "cvar", scope: !181, file: !2, baseType: !228, size: 128, align: 64, offset: 192)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !229, file: !2, size: 128, align: 64, elements: !230, templateParams: !4, identifier: "a8ec5e8321e8200ca1b4ce8f571c9714")
!229 = !DINamespace(name: "condvar", scope: !9)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !228, file: !2, baseType: !232, size: 128, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !233, file: !2, size: 128, align: 64, elements: !234, templateParams: !4, identifier: "7d2ed72ecc877b9946b2688a7dfacda0")
!233 = !DINamespace(name: "condvar", scope: !184)
!234 = !{!235, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !232, file: !2, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::sbf::condvar::Condvar, alloc::alloc::Global>", baseType: !237, size: 64, align: 64, dwarfAddressSpace: 0)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !238, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "524ebdfed447f5086ff1bc9f99b960f1")
!238 = !DINamespace(name: "condvar", scope: !199)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !232, file: !2, baseType: !240, size: 64, align: 64, offset: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "SameMutexCheck", scope: !241, file: !2, size: 64, align: 64, elements: !242, templateParams: !4, identifier: "5aa845b4d55f1c3486fdc9e7cb31d136")
!241 = !DINamespace(name: "check", scope: !233)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !240, file: !2, baseType: !92, size: 64, align: 64)
!244 = !{!245}
!245 = !DITemplateTypeParameter(name: "T", type: !142)
!246 = !{!247}
!247 = !DITemplateTypeParameter(name: "T", type: !137)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !128, file: !2, baseType: !249, align: 8)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !246, identifier: "1df19217760f73b1cb5d05a2bc5fdd92")
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !118, file: !2, baseType: !251, size: 64, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !116, file: !2, size: 64, align: 64, elements: !252, templateParams: !122, identifier: "e1e809684530125715213d9f1b61af78::Some")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !251, file: !2, baseType: !124, size: 64, align: 64)
!254 = !{!255}
!255 = !DITemplateTypeParameter(name: "T", type: !116)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !107, file: !2, baseType: !214, size: 8, align: 8, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !107, file: !2, baseType: !106, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !24, file: !2, baseType: !259, align: 8)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !260, align: 8, dwarfAddressSpace: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{!51}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !18, file: !2, baseType: !263, size: 64, align: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !14, file: !2, size: 64, align: 64, elements: !264, templateParams: !22, identifier: "372cc007a07977def1a54351ddeef1c4::Some")
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !263, file: !2, baseType: !24, size: 64, align: 64)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !269, identifier: "vtable")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&String", baseType: !270, size: 64, align: 64, dwarfAddressSpace: 0)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !271, file: !2, size: 192, align: 64, elements: !272, templateParams: !4, identifier: "96eaa147e4cb6ee42e5dcd78906547cd")
!271 = !DINamespace(name: "string", scope: !53)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !270, file: !2, baseType: !51, size: 192, align: 64)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !277, identifier: "vtable")
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowMutError", scope: !37, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "7eeb4ba8d26e094f613268deed6823e1")
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !281, identifier: "vtable")
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowError", scope: !37, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "7655c1c4be872185871ec07cf408bf33")
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !285, identifier: "vtable")
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !286, file: !2, align: 8, elements: !288, identifier: "a70a2e436c0463317b9b940cba899be")
!286 = !DINamespace(name: "encode", scope: !287)
!287 = !DINamespace(name: "bs58", scope: null)
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_variant_part, scope: !286, file: !2, align: 8, elements: !290, templateParams: !4, identifier: "a70a2e436c0463317b9b940cba899be_variant_part")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "BufferTooSmall", scope: !289, file: !2, baseType: !292, align: 8)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "BufferTooSmall", scope: !285, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "a70a2e436c0463317b9b940cba899be::BufferTooSmall")
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !296, identifier: "vtable")
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidOutputSize", scope: !297, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "a4fc8651518db2bb21c3726eca742245")
!297 = !DINamespace(name: "digest", scope: null)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !301, identifier: "vtable")
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !302, file: !2, size: 128, align: 64, elements: !304, templateParams: !4, identifier: "69f1f962e3822563c6bb167bec057b2c")
!302 = !DINamespace(name: "error", scope: !303)
!303 = !DINamespace(name: "io", scope: !10)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !301, file: !2, baseType: !306, size: 128, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !302, file: !2, size: 128, align: 64, elements: !307, identifier: "b2dbfc1ac6d6922b485924bc8bed010")
!307 = !{!308}
!308 = !DICompositeType(tag: DW_TAG_variant_part, scope: !302, file: !2, size: 128, align: 64, elements: !309, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010_variant_part", discriminator: !397)
!309 = !{!310, !315, !362, !372}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !308, file: !2, baseType: !311, size: 128, align: 64, extraData: i64 0)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !306, file: !2, size: 128, align: 64, elements: !312, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::Os")
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !311, file: !2, baseType: !314, size: 32, align: 32, offset: 32)
!314 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !308, file: !2, baseType: !316, size: 128, align: 64, extraData: i64 1)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !306, file: !2, size: 128, align: 64, elements: !317, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::Simple")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !316, file: !2, baseType: !319, size: 8, align: 8, offset: 8)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !302, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagEnumClass, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!321 = !DIEnumerator(name: "NotFound", value: 0)
!322 = !DIEnumerator(name: "PermissionDenied", value: 1)
!323 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!324 = !DIEnumerator(name: "ConnectionReset", value: 3)
!325 = !DIEnumerator(name: "HostUnreachable", value: 4)
!326 = !DIEnumerator(name: "NetworkUnreachable", value: 5)
!327 = !DIEnumerator(name: "ConnectionAborted", value: 6)
!328 = !DIEnumerator(name: "NotConnected", value: 7)
!329 = !DIEnumerator(name: "AddrInUse", value: 8)
!330 = !DIEnumerator(name: "AddrNotAvailable", value: 9)
!331 = !DIEnumerator(name: "NetworkDown", value: 10)
!332 = !DIEnumerator(name: "BrokenPipe", value: 11)
!333 = !DIEnumerator(name: "AlreadyExists", value: 12)
!334 = !DIEnumerator(name: "WouldBlock", value: 13)
!335 = !DIEnumerator(name: "NotADirectory", value: 14)
!336 = !DIEnumerator(name: "IsADirectory", value: 15)
!337 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16)
!338 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17)
!339 = !DIEnumerator(name: "FilesystemLoop", value: 18)
!340 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19)
!341 = !DIEnumerator(name: "InvalidInput", value: 20)
!342 = !DIEnumerator(name: "InvalidData", value: 21)
!343 = !DIEnumerator(name: "TimedOut", value: 22)
!344 = !DIEnumerator(name: "WriteZero", value: 23)
!345 = !DIEnumerator(name: "StorageFull", value: 24)
!346 = !DIEnumerator(name: "NotSeekable", value: 25)
!347 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26)
!348 = !DIEnumerator(name: "FileTooLarge", value: 27)
!349 = !DIEnumerator(name: "ResourceBusy", value: 28)
!350 = !DIEnumerator(name: "ExecutableFileBusy", value: 29)
!351 = !DIEnumerator(name: "Deadlock", value: 30)
!352 = !DIEnumerator(name: "CrossesDevices", value: 31)
!353 = !DIEnumerator(name: "TooManyLinks", value: 32)
!354 = !DIEnumerator(name: "FilenameTooLong", value: 33)
!355 = !DIEnumerator(name: "ArgumentListTooLong", value: 34)
!356 = !DIEnumerator(name: "Interrupted", value: 35)
!357 = !DIEnumerator(name: "Unsupported", value: 36)
!358 = !DIEnumerator(name: "UnexpectedEof", value: 37)
!359 = !DIEnumerator(name: "OutOfMemory", value: 38)
!360 = !DIEnumerator(name: "Other", value: 39)
!361 = !DIEnumerator(name: "Uncategorized", value: 40)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !308, file: !2, baseType: !363, size: 128, align: 64, extraData: i64 2)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !306, file: !2, size: 128, align: 64, elements: !364, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::SimpleMessage")
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !363, file: !2, baseType: !319, size: 8, align: 8, offset: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !363, file: !2, baseType: !367, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !368, size: 64, align: 64, dwarfAddressSpace: 0)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !369, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !368, file: !2, baseType: !65, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !368, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !308, file: !2, baseType: !373, size: 128, align: 64, extraData: i64 3)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !306, file: !2, size: 128, align: 64, elements: !374, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::Custom")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !373, file: !2, baseType: !376, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !377, size: 64, align: 64, dwarfAddressSpace: 0)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !302, file: !2, size: 192, align: 64, elements: !378, templateParams: !4, identifier: "1f4969fa038b273abfa39b7e982dff20")
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !377, file: !2, baseType: !319, size: 8, align: 8, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !377, file: !2, baseType: !381, size: 128, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", scope: !382, file: !2, size: 128, align: 64, elements: !383, templateParams: !391, identifier: "5ea046ff38e8262ae5fd9e712928a3ca")
!382 = !DINamespace(name: "boxed", scope: !53)
!383 = !{!384, !386}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !381, file: !2, baseType: !385, size: 64, align: 64, flags: DIFlagArtificial)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !381, file: !2, baseType: !387, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !388, size: 64, align: 64, dwarfAddressSpace: 0)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 192, align: 64, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 3, lowerBound: 0)
!391 = !{!392, !78}
!392 = !DITemplateTypeParameter(name: "T", type: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !394, templateParams: !4, identifier: "73ee555cfc6112afe69c3a638dc4b32d")
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !393, file: !2, baseType: !385, size: 64, align: 64, flags: DIFlagArtificial)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !393, file: !2, baseType: !387, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !302, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagArtificial)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !401, identifier: "vtable")
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "FromUtf8Error", scope: !271, file: !2, size: 320, align: 64, elements: !402, templateParams: !4, identifier: "8e4d590b0f3fe7c8a1defffca688e87c")
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !401, file: !2, baseType: !51, size: 192, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !401, file: !2, baseType: !405, size: 128, align: 64, offset: 192)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !406, file: !2, size: 128, align: 64, elements: !408, templateParams: !4, identifier: "23e62222a878f93eb05b6b1bf847e978")
!406 = !DINamespace(name: "error", scope: !407)
!407 = !DINamespace(name: "str", scope: !16)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !405, file: !2, baseType: !73, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !405, file: !2, baseType: !411, size: 16, align: 8, offset: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !15, file: !2, size: 16, align: 8, elements: !412, identifier: "b8190189d3b92788fb333a57bdc50a8b")
!412 = !{!413}
!413 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 16, align: 8, elements: !414, templateParams: !70, identifier: "b8190189d3b92788fb333a57bdc50a8b_variant_part", discriminator: !421)
!414 = !{!415, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !413, file: !2, baseType: !416, size: 16, align: 8, extraData: i64 0)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !411, file: !2, size: 16, align: 8, elements: !4, templateParams: !70, identifier: "b8190189d3b92788fb333a57bdc50a8b::None")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !413, file: !2, baseType: !418, size: 16, align: 8, extraData: i64 1)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !411, file: !2, size: 16, align: 8, elements: !419, templateParams: !70, identifier: "b8190189d3b92788fb333a57bdc50a8b::Some")
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !418, file: !2, baseType: !66, size: 8, align: 8, offset: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagArtificial)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !425, identifier: "vtable")
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryFromSliceError", scope: !426, file: !2, align: 8, elements: !427, templateParams: !4, identifier: "7d433bee47af4cec79597a74e6cd8a5c")
!426 = !DINamespace(name: "array", scope: !16)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !425, file: !2, baseType: !224, align: 8)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !432, identifier: "vtable")
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowedPlaceholder", scope: !433, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "474049c373d1f181480db256ce045d6b")
!433 = !DINamespace(name: "fmt", scope: !434)
!434 = !DINamespace(name: "{impl#29}", scope: !435)
!435 = !DINamespace(name: "fmt", scope: !16)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !439, identifier: "vtable")
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ref<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>", scope: !37, file: !2, size: 128, align: 64, elements: !440, templateParams: !475, identifier: "9bafbbae9d587329621d601e4dd32ad9")
!440 = !{!441, !461}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !439, file: !2, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Vec<alloc::string::String, alloc::alloc::Global>", baseType: !443, size: 64, align: 64, dwarfAddressSpace: 0)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::string::String, alloc::alloc::Global>", scope: !52, file: !2, size: 192, align: 64, elements: !444, templateParams: !459, identifier: "a456cb6c06ca17439991ada1155957f3")
!444 = !{!445, !460}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !443, file: !2, baseType: !446, size: 128, align: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::string::String, alloc::alloc::Global>", scope: !57, file: !2, size: 128, align: 64, elements: !447, templateParams: !459, identifier: "e596dafaaaad77761fa453932dff10a3")
!447 = !{!448, !457, !458}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !446, file: !2, baseType: !449, size: 64, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::string::String>", scope: !61, file: !2, size: 64, align: 64, elements: !450, templateParams: !455, identifier: "cec11d189254e0cfc9448ed45317f73c")
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !449, file: !2, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const String", baseType: !270, size: 64, align: 64, dwarfAddressSpace: 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !449, file: !2, baseType: !454, align: 8)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::string::String>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !455, identifier: "fdbb520f43f05ac56d94add2404f3f8")
!455 = !{!456}
!456 = !DITemplateTypeParameter(name: "T", type: !270)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !446, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !446, file: !2, baseType: !75, align: 8)
!459 = !{!456, !78}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !443, file: !2, baseType: !73, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !439, file: !2, baseType: !462, size: 64, align: 64, offset: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowRef", scope: !37, file: !2, size: 64, align: 64, elements: !463, templateParams: !4, identifier: "b4437e329e4ea0a1b63a71ca0420d36c")
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !462, file: !2, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Cell<isize>", baseType: !466, size: 64, align: 64, dwarfAddressSpace: 0)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<isize>", scope: !37, file: !2, size: 64, align: 64, elements: !467, templateParams: !473, identifier: "4e95b0f2a1a1d843af31431b8d46a5a9")
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !466, file: !2, baseType: !469, size: 64, align: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !37, file: !2, size: 64, align: 64, elements: !470, templateParams: !473, identifier: "a478319df2321c642b07e6e189247bf")
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !469, file: !2, baseType: !472, size: 64, align: 64)
!472 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!473 = !{!474}
!474 = !DITemplateTypeParameter(name: "T", type: !472)
!475 = !{!476}
!476 = !DITemplateTypeParameter(name: "T", type: !443)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !480, identifier: "vtable")
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Rc<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", baseType: !481, size: 64, align: 64, dwarfAddressSpace: 0)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", scope: !482, file: !2, size: 64, align: 64, elements: !483, templateParams: !504, identifier: "e73a13a22371edee87c4a00cb809a50b")
!482 = !DINamespace(name: "rc", scope: !53)
!483 = !{!484, !508}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !481, file: !2, baseType: !485, size: 64, align: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>>", scope: !133, file: !2, size: 64, align: 64, elements: !486, templateParams: !506, identifier: "4f8f81646807bafb2bc6186f6536b1c5")
!486 = !{!487}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !485, file: !2, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", baseType: !489, size: 64, align: 64, dwarfAddressSpace: 0)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>", scope: !482, file: !2, size: 384, align: 64, elements: !490, templateParams: !504, identifier: "1bb1f8aaf95e62df6f5fdc791677f882")
!490 = !{!491, !495, !496}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !489, file: !2, baseType: !492, size: 64, align: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !37, file: !2, size: 64, align: 64, elements: !493, templateParams: !100, identifier: "d610ccc56ed6bc2d95c5846672673907")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !492, file: !2, baseType: !97, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !489, file: !2, baseType: !492, size: 64, align: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !489, file: !2, baseType: !497, size: 256, align: 64, offset: 128)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>", scope: !37, file: !2, size: 256, align: 64, elements: !498, templateParams: !475, identifier: "f71da3585e5aa46413ef2205601098be")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !497, file: !2, baseType: !466, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !497, file: !2, baseType: !501, size: 192, align: 64, offset: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>", scope: !37, file: !2, size: 192, align: 64, elements: !502, templateParams: !475, identifier: "9e302beca984fb472dee4230f6b4c4aa")
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !501, file: !2, baseType: !443, size: 192, align: 64)
!504 = !{!505}
!505 = !DITemplateTypeParameter(name: "T", type: !497)
!506 = !{!507}
!507 = !DITemplateTypeParameter(name: "T", type: !489)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !481, file: !2, baseType: !509, align: 8)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>>>>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !506, identifier: "39d05a85712567cf47e70e32a224a268")
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !513, identifier: "vtable")
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !516, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !517, identifier: "vtable")
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !206, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !521, identifier: "vtable")
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Option<alloc::string::String>", baseType: !522, size: 64, align: 64, dwarfAddressSpace: 0)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !15, file: !2, size: 192, align: 64, elements: !523, identifier: "928d549314dd3f53d1e9214fcd617748")
!523 = !{!524}
!524 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 192, align: 64, elements: !525, templateParams: !455, identifier: "928d549314dd3f53d1e9214fcd617748_variant_part", discriminator: !84)
!525 = !{!526, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !524, file: !2, baseType: !527, size: 192, align: 64, extraData: i64 0)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !522, file: !2, size: 192, align: 64, elements: !4, templateParams: !455, identifier: "928d549314dd3f53d1e9214fcd617748::None")
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !524, file: !2, baseType: !529, size: 192, align: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !522, file: !2, size: 192, align: 64, elements: !530, templateParams: !455, identifier: "928d549314dd3f53d1e9214fcd617748::Some")
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !529, file: !2, baseType: !270, size: 192, align: 64)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !367, identifier: "vtable")
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !538, identifier: "vtable")
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Box<solana_frozen_abi::abi_digester::DigestError, alloc::alloc::Global>", baseType: !539, size: 64, align: 64, dwarfAddressSpace: 0)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<solana_frozen_abi::abi_digester::DigestError, alloc::alloc::Global>", baseType: !540, size: 64, align: 64, dwarfAddressSpace: 0)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "DigestError", scope: !541, file: !2, size: 384, align: 64, elements: !543, identifier: "9b5f834b66e28c13a24bf3051dc358e3")
!541 = !DINamespace(name: "abi_digester", scope: !542)
!542 = !DINamespace(name: "solana_frozen_abi", scope: null)
!543 = !{!544}
!544 = !DICompositeType(tag: DW_TAG_variant_part, scope: !541, file: !2, size: 384, align: 64, elements: !545, templateParams: !4, identifier: "9b5f834b66e28c13a24bf3051dc358e3_variant_part", discriminator: !561)
!545 = !{!546, !548, !553, !559}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "NoneIsSerialized", scope: !544, file: !2, baseType: !547, size: 384, align: 64, extraData: i64 0)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoneIsSerialized", scope: !540, file: !2, size: 384, align: 64, elements: !4, templateParams: !4, identifier: "9b5f834b66e28c13a24bf3051dc358e3::NoneIsSerialized")
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !544, file: !2, baseType: !549, size: 384, align: 64, extraData: i64 1)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", scope: !540, file: !2, size: 384, align: 64, elements: !550, templateParams: !4, identifier: "9b5f834b66e28c13a24bf3051dc358e3::Node")
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !549, file: !2, baseType: !368, size: 128, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !549, file: !2, baseType: !539, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Leaf", scope: !544, file: !2, baseType: !554, size: 384, align: 64, extraData: i64 2)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Leaf", scope: !540, file: !2, size: 384, align: 64, elements: !555, templateParams: !4, identifier: "9b5f834b66e28c13a24bf3051dc358e3::Leaf")
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !554, file: !2, baseType: !368, size: 128, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !554, file: !2, baseType: !368, size: 128, align: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !554, file: !2, baseType: !539, size: 64, align: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ArithmeticOverflow", scope: !544, file: !2, baseType: !560, size: 384, align: 64, extraData: i64 3)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArithmeticOverflow", scope: !540, file: !2, size: 384, align: 64, elements: !4, templateParams: !4, identifier: "9b5f834b66e28c13a24bf3051dc358e3::ArithmeticOverflow")
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !541, file: !2, baseType: !85, size: 64, align: 64, flags: DIFlagArtificial)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "VEC_U8", linkageName: "_ZN17solana_frozen_abi11abi_example6VEC_U817h0c8d69ec7ee57db7E", scope: !564, file: !565, line: 161, type: !566, isLocal: true, isDefinition: true, align: 1)
!564 = !DINamespace(name: "abi_example", scope: !542)
!565 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_U8", scope: !564, file: !2, align: 8, elements: !567, templateParams: !4, identifier: "fc15430a78cfc410e4b4067a88e2f0c1")
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !566, file: !2, baseType: !224, align: 8)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN82_$LT$solana_frozen_abi..abi_example..VEC_U8$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h1bc2c1bcace7a955E", scope: !571, file: !574, line: 55, type: !33, isLocal: true, isDefinition: true, align: 8)
!571 = !DINamespace(name: "__stability", scope: !572)
!572 = !DINamespace(name: "deref", scope: !573)
!573 = !DINamespace(name: "{impl#109}", scope: !564)
!574 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/inline_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "fc5d559d75244cdb0dd66f0094444434")
!575 = !{i32 7, !"PIC Level", i32 2}
!576 = !{i32 2, !"Debug Info Version", i32 3}
!577 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !578, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, globals: !621)
!578 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.34/src/lib.rs", directory: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-frozen-abi-1.10.34")
!579 = !{!580, !319, !589, !594, !602, !609, !615, !619}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LevelFilter", scope: !581, file: !2, baseType: !85, size: 64, align: 64, flags: DIFlagEnumClass, elements: !582)
!581 = !DINamespace(name: "log", scope: null)
!582 = !{!583, !584, !585, !586, !587, !588}
!583 = !DIEnumerator(name: "Off", value: 0, isUnsigned: true)
!584 = !DIEnumerator(name: "Error", value: 1, isUnsigned: true)
!585 = !DIEnumerator(name: "Warn", value: 2, isUnsigned: true)
!586 = !DIEnumerator(name: "Info", value: 3, isUnsigned: true)
!587 = !DIEnumerator(name: "Debug", value: 4, isUnsigned: true)
!588 = !DIEnumerator(name: "Trace", value: 5, isUnsigned: true)
!589 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !590, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagEnumClass, elements: !591)
!590 = !DINamespace(name: "result", scope: !16)
!591 = !{!592, !593}
!592 = !DIEnumerator(name: "Ok", value: 0)
!593 = !DIEnumerator(name: "Err", value: 1)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !595, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagEnumClass, elements: !597)
!595 = !DINamespace(name: "v1", scope: !596)
!596 = !DINamespace(name: "rt", scope: !435)
!597 = !{!598, !599, !600, !601}
!598 = !DIEnumerator(name: "Left", value: 0)
!599 = !DIEnumerator(name: "Right", value: 1)
!600 = !DIEnumerator(name: "Center", value: 2)
!601 = !DIEnumerator(name: "Unknown", value: 3)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !93, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagEnumClass, elements: !603)
!603 = !{!604, !605, !606, !607, !608}
!604 = !DIEnumerator(name: "Relaxed", value: 0)
!605 = !DIEnumerator(name: "Release", value: 1)
!606 = !DIEnumerator(name: "Acquire", value: 2)
!607 = !DIEnumerator(name: "AcqRel", value: 3)
!608 = !DIEnumerator(name: "SeqCst", value: 4)
!609 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !610, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagEnumClass, elements: !611)
!610 = !DINamespace(name: "panicking", scope: !16)
!611 = !{!612, !613, !614}
!612 = !DIEnumerator(name: "Eq", value: 0)
!613 = !DIEnumerator(name: "Ne", value: 1)
!614 = !DIEnumerator(name: "Match", value: 2)
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !57, file: !2, baseType: !66, size: 8, align: 8, flags: DIFlagEnumClass, elements: !616)
!616 = !{!617, !618}
!617 = !DIEnumerator(name: "Uninitialized", value: 0)
!618 = !DIEnumerator(name: "Zeroed", value: 1)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Level", scope: !581, file: !2, baseType: !85, size: 64, align: 64, flags: DIFlagEnumClass, elements: !620)
!620 = !{!584, !585, !586, !587, !588}
!621 = !{!0, !266, !274, !278, !282, !293, !298, !398, !422, !429, !436, !477, !510, !514, !518, !532, !535, !562, !569}
!622 = distinct !DISubprogram(name: "index", linkageName: "_ZN100_$LT$alloc..string..String$u20$as$u20$core..ops..index..Index$LT$core..ops..range..RangeFull$GT$$GT$5index17hfd521ef2e6226cd3E", scope: !624, file: !623, line: 2234, type: !625, scopeLine: 2234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !4, retainedNodes: !639)
!623 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "6e72f4c70a64aa2b17dc14952632c4d9")
!624 = !DINamespace(name: "{impl#28}", scope: !271)
!625 = !DISubroutineType(types: !626)
!626 = !{!368, !269, !627, !630}
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !628, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "1653552c7e3df01a09c3f8c9edf4257")
!628 = !DINamespace(name: "range", scope: !629)
!629 = !DINamespace(name: "ops", scope: !16)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Location", baseType: !631, size: 64, align: 64, dwarfAddressSpace: 0)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !632, file: !2, size: 192, align: 64, elements: !634, templateParams: !4, identifier: "9f9749776572719cc82f4bbe4f5eb8d")
!632 = !DINamespace(name: "location", scope: !633)
!633 = !DINamespace(name: "panic", scope: !16)
!634 = !{!635, !636, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !631, file: !2, baseType: !368, size: 128, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !631, file: !2, baseType: !637, size: 32, align: 32, offset: 128)
!637 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !631, file: !2, baseType: !637, size: 32, align: 32, offset: 160)
!639 = !{!640, !641}
!640 = !DILocalVariable(name: "self", arg: 1, scope: !622, file: !623, line: 2234, type: !269)
!641 = !DILocalVariable(name: "_index", arg: 2, scope: !622, file: !623, line: 2234, type: !627)
!642 = !DILocation(line: 2234, column: 14, scope: !622)
!643 = !DILocation(line: 2234, column: 21, scope: !622)
!644 = !DILocation(line: 2235, column: 43, scope: !622)
!645 = !DILocation(line: 2235, column: 18, scope: !622)
!646 = !DILocation(line: 2236, column: 6, scope: !622)
!647 = distinct !DISubprogram(name: "__iterator_get_unchecked<u8>", linkageName: "_ZN101_$LT$core..slice..iter..ChunksExactMut$LT$T$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$24__iterator_get_unchecked17hb7004d855dea50caE", scope: !649, file: !648, line: 1925, type: !652, scopeLine: 1925, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !70, retainedNodes: !664)
!648 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "5aaa66a4d49b9ecc9bcb7869337da7d8")
!649 = !DINamespace(name: "{impl#94}", scope: !650)
!650 = !DINamespace(name: "iter", scope: !651)
!651 = !DINamespace(name: "slice", scope: !16)
!652 = !DISubroutineType(types: !653)
!653 = !{!654, !658, !73}
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !655, templateParams: !4, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !654, file: !2, baseType: !65, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !654, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut ChunksExactMut<u8>", baseType: !659, size: 64, align: 64, dwarfAddressSpace: 0)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChunksExactMut<u8>", scope: !650, file: !2, size: 320, align: 64, elements: !660, templateParams: !70, identifier: "e571b1fc82cd9aa7badfb8e1cdfc58bf")
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !659, file: !2, baseType: !654, size: 128, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !659, file: !2, baseType: !654, size: 128, align: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !659, file: !2, baseType: !73, size: 64, align: 64, offset: 256)
!664 = !{!665, !666, !667}
!665 = !DILocalVariable(name: "self", arg: 1, scope: !647, file: !648, line: 1925, type: !658)
!666 = !DILocalVariable(name: "idx", arg: 2, scope: !647, file: !648, line: 1925, type: !73)
!667 = !DILocalVariable(name: "start", scope: !668, file: !648, line: 1926, type: !73, align: 8)
!668 = distinct !DILexicalBlock(scope: !647, file: !648, line: 1926, column: 9)
!669 = !DILocation(line: 1925, column: 40, scope: !647)
!670 = !DILocation(line: 1925, column: 51, scope: !647)
!671 = !DILocation(line: 1926, column: 27, scope: !647)
!672 = !DILocation(line: 1926, column: 21, scope: !647)
!673 = !DILocation(line: 1926, column: 13, scope: !668)
!674 = !DILocation(line: 1928, column: 37, scope: !668)
!675 = !DILocalVariable(name: "self", arg: 1, scope: !676, file: !677, line: 618, type: !385)
!676 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hb4f3b1bf3ce7c852E", scope: !678, file: !677, line: 618, type: !680, scopeLine: 618, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !70, retainedNodes: !682)
!677 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "dc9433fa5edb0740532b3ed97e3aaa10")
!678 = !DINamespace(name: "{impl#0}", scope: !679)
!679 = !DINamespace(name: "mut_ptr", scope: !62)
!680 = !DISubroutineType(types: !681)
!681 = !{!385, !385, !73}
!682 = !{!675, !683}
!683 = !DILocalVariable(name: "count", arg: 2, scope: !676, file: !677, line: 618, type: !73)
!684 = !DILocation(line: 618, column: 29, scope: !676, inlinedAt: !685)
!685 = distinct !DILocation(line: 1928, column: 37, scope: !668)
!686 = !DILocation(line: 618, column: 35, scope: !676, inlinedAt: !685)
!687 = !DILocalVariable(name: "self", arg: 1, scope: !688, file: !677, line: 235, type: !385)
!688 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17hea82da2e33ceea15E", scope: !678, file: !677, line: 235, type: !689, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !70, retainedNodes: !691)
!689 = !DISubroutineType(types: !690)
!690 = !{!385, !385, !472}
!691 = !{!687, !692}
!692 = !DILocalVariable(name: "count", arg: 2, scope: !688, file: !677, line: 235, type: !472)
!693 = !DILocation(line: 235, column: 32, scope: !688, inlinedAt: !694)
!694 = distinct !DILocation(line: 623, column: 18, scope: !676, inlinedAt: !685)
!695 = !DILocation(line: 235, column: 38, scope: !688, inlinedAt: !694)
!696 = !DILocation(line: 242, column: 18, scope: !688, inlinedAt: !694)
!697 = !DILocation(line: 1928, column: 69, scope: !668)
!698 = !DILocation(line: 1928, column: 18, scope: !668)
!699 = !DILocation(line: 1929, column: 6, scope: !647)
!700 = distinct !DISubprogram(name: "size_hint<u8>", linkageName: "_ZN101_$LT$core..slice..iter..ChunksExactMut$LT$T$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h034b855b3d176643E", scope: !649, file: !648, line: 1895, type: !701, scopeLine: 1895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !70, retainedNodes: !718)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !717}
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 192, align: 64, elements: !704, templateParams: !4, identifier: "2c591a652793c3427965aa09ecad855d")
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !703, file: !2, baseType: !73, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !703, file: !2, baseType: !707, size: 128, align: 64, offset: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !15, file: !2, size: 128, align: 64, elements: !708, identifier: "4849786e80860f5416c4c6b259f5a683")
!708 = !{!709}
!709 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !710, templateParams: !100, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !84)
!710 = !{!711, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !709, file: !2, baseType: !712, size: 128, align: 64, extraData: i64 0)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !707, file: !2, size: 128, align: 64, elements: !4, templateParams: !100, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !709, file: !2, baseType: !714, size: 128, align: 64, extraData: i64 1)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !707, file: !2, size: 128, align: 64, elements: !715, templateParams: !100, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !714, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&ChunksExactMut<u8>", baseType: !659, size: 64, align: 64, dwarfAddressSpace: 0)
!718 = !{!719, !720}
!719 = !DILocalVariable(name: "self", arg: 1, scope: !700, file: !648, line: 1895, type: !717)
!720 = !DILocalVariable(name: "n", scope: !721, file: !648, line: 1896, type: !73, align: 8)
!721 = distinct !DILexicalBlock(scope: !700, file: !648, line: 1896, column: 9)
!722 = !DILocation(line: 1895, column: 18, scope: !700)
!723 = !DILocation(line: 1896, column: 17, scope: !700)
!724 = !DILocation(line: 1896, column: 32, scope: !700)
!725 = !DILocation(line: 1896, column: 13, scope: !721)
!726 = !DILocation(line: 1897, column: 13, scope: !721)
!727 = !DILocation(line: 1897, column: 9, scope: !721)
!728 = !{i64 0, i64 2}
!729 = !DILocation(line: 1898, column: 6, scope: !700)
!730 = distinct !DISubprogram(name: "fold<alloc::string::String, core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h6b9150722082d4b5E", scope: !732, file: !731, line: 120, type: !736, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !788, retainedNodes: !784)
!731 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "00602ae7f764e64d630128e594388e5e")
!732 = !DINamespace(name: "{impl#2}", scope: !733)
!733 = !DINamespace(name: "map", scope: !734)
!734 = !DINamespace(name: "adapters", scope: !735)
!735 = !DINamespace(name: "iter", scope: !16)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !738, !224, !762}
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}>", scope: !733, file: !2, size: 128, align: 64, elements: !739, templateParams: !759, identifier: "6d99c32f9c2d44f824c1f654a9a2946a")
!739 = !{!740, !755}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !738, file: !2, baseType: !741, size: 128, align: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<&str>", scope: !650, file: !2, size: 128, align: 64, elements: !742, templateParams: !748, identifier: "3777ffedd3a0b92589c48390525c0eea")
!742 = !{!743, !750, !751}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !741, file: !2, baseType: !744, size: 64, align: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&str>", scope: !133, file: !2, size: 64, align: 64, elements: !745, templateParams: !748, identifier: "9bdda3955565479650f1b965e5a7f07f")
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !744, file: !2, baseType: !747, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !368, size: 64, align: 64, dwarfAddressSpace: 0)
!748 = !{!749}
!749 = !DITemplateTypeParameter(name: "T", type: !368)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !741, file: !2, baseType: !747, size: 64, align: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !741, file: !2, baseType: !752, align: 8)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&&str>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !753, identifier: "2312e3a961fce1e229b01cf1faed2e76")
!753 = !{!754}
!754 = !DITemplateTypeParameter(name: "T", type: !367)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !738, file: !2, baseType: !756, align: 8)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !757, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "4a45f7249137924f159068557d0d65d0")
!757 = !DINamespace(name: "update", scope: !758)
!758 = !DINamespace(name: "{impl#2}", scope: !541)
!759 = !{!760, !761}
!760 = !DITemplateTypeParameter(name: "I", type: !741)
!761 = !DITemplateTypeParameter(name: "F", type: !756)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !763, file: !2, size: 192, align: 64, elements: !768, templateParams: !4, identifier: "a7e726a9b49859a5957d2100a2be66e")
!763 = !DINamespace(name: "call", scope: !764)
!764 = !DINamespace(name: "for_each", scope: !765)
!765 = !DINamespace(name: "Iterator", scope: !766)
!766 = !DINamespace(name: "iterator", scope: !767)
!767 = !DINamespace(name: "traits", scope: !735)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !762, file: !2, baseType: !770, size: 192, align: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !771, file: !2, size: 192, align: 64, elements: !774, templateParams: !4, identifier: "7c59ad253a7247cdf9d6d3f17cb5e51e")
!771 = !DINamespace(name: "spec_extend", scope: !772)
!772 = !DINamespace(name: "{impl#1}", scope: !773)
!773 = !DINamespace(name: "spec_extend", scope: !52)
!774 = !{!775, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !770, file: !2, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut String", baseType: !270, size: 64, align: 64, dwarfAddressSpace: 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "local_len", scope: !770, file: !2, baseType: !778, size: 128, align: 64, offset: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "SetLenOnDrop", scope: !779, file: !2, size: 128, align: 64, elements: !780, templateParams: !4, identifier: "60cd495ccd28d054b31bcc0f1bbc0816")
!779 = !DINamespace(name: "set_len_on_drop", scope: !52)
!780 = !{!781, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !778, file: !2, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut usize", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "local_len", scope: !778, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!784 = !{!785, !786, !787}
!785 = !DILocalVariable(name: "self", arg: 1, scope: !730, file: !731, line: 120, type: !738)
!786 = !DILocalVariable(name: "init", arg: 2, scope: !730, file: !731, line: 120, type: !224)
!787 = !DILocalVariable(name: "g", arg: 3, scope: !730, file: !731, line: 120, type: !762)
!788 = !{!789, !760, !761, !790, !791}
!789 = !DITemplateTypeParameter(name: "B", type: !270)
!790 = !DITemplateTypeParameter(name: "Acc", type: !224)
!791 = !DITemplateTypeParameter(name: "G", type: !762)
!792 = !DILocation(line: 120, column: 21, scope: !730)
!793 = !DILocation(line: 120, column: 27, scope: !730)
!794 = !DILocation(line: 120, column: 38, scope: !730)
!795 = !DILocation(line: 124, column: 47, scope: !730)
!796 = !DILocation(line: 124, column: 30, scope: !730)
!797 = !DILocation(line: 124, column: 9, scope: !730)
!798 = !DILocation(line: 125, column: 6, scope: !730)
!799 = distinct !DISubprogram(name: "try_fold<usize, core::slice::iter::Iter<alloc::string::String>, alloc::str::join_generic_copy::{closure#0}::{closure#0}, usize, fn(usize, usize) -> core::option::Option<usize>, core::option::Option<usize>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$8try_fold17h4730f268eb32b092E", scope: !732, file: !731, line: 111, type: !800, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !832, retainedNodes: !828)
!800 = !DISubroutineType(types: !801)
!801 = !{!707, !802, !73, !825}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Map<core::slice::iter::Iter<alloc::string::String>, alloc::str::join_generic_copy::{closure#0}::{closure#0}>", baseType: !803, size: 64, align: 64, dwarfAddressSpace: 0)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<alloc::string::String>, alloc::str::join_generic_copy::{closure#0}::{closure#0}>", scope: !733, file: !2, size: 128, align: 64, elements: !804, templateParams: !822, identifier: "fb52c80bc7ec6ff4e3649da3522b4487")
!804 = !{!805, !817}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !803, file: !2, baseType: !806, size: 128, align: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<alloc::string::String>", scope: !650, file: !2, size: 128, align: 64, elements: !807, templateParams: !455, identifier: "34044fed42283366dea5cc32a2956d45")
!807 = !{!808, !812, !813}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !806, file: !2, baseType: !809, size: 64, align: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::string::String>", scope: !133, file: !2, size: 64, align: 64, elements: !810, templateParams: !455, identifier: "cd893dff82d14c83f978ec5e4be8d4fe")
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !809, file: !2, baseType: !452, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !806, file: !2, baseType: !452, size: 64, align: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !806, file: !2, baseType: !814, align: 8)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&alloc::string::String>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !815, identifier: "dbc730f3c0081ab7cdfa3da34f14184b")
!815 = !{!816}
!816 = !DITemplateTypeParameter(name: "T", type: !269)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !803, file: !2, baseType: !818, align: 8)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !819, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "348083920401f0fcb3d58586222966dc")
!819 = !DINamespace(name: "{closure#0}", scope: !820)
!820 = !DINamespace(name: "join_generic_copy", scope: !821)
!821 = !DINamespace(name: "str", scope: !53)
!822 = !{!823, !824}
!823 = !DITemplateTypeParameter(name: "I", type: !806)
!824 = !DITemplateTypeParameter(name: "F", type: !818)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(usize, usize) -> core::option::Option<usize>", baseType: !826, align: 8, dwarfAddressSpace: 0)
!826 = !DISubroutineType(types: !827)
!827 = !{!707, !73, !73}
!828 = !{!829, !830, !831}
!829 = !DILocalVariable(name: "self", arg: 1, scope: !799, file: !731, line: 111, type: !802)
!830 = !DILocalVariable(name: "init", arg: 2, scope: !799, file: !731, line: 111, type: !73)
!831 = !DILocalVariable(name: "g", arg: 3, scope: !799, file: !731, line: 111, type: !825)
!832 = !{!833, !823, !824, !834, !835, !836}
!833 = !DITemplateTypeParameter(name: "B", type: !73)
!834 = !DITemplateTypeParameter(name: "Acc", type: !73)
!835 = !DITemplateTypeParameter(name: "G", type: !825)
!836 = !DITemplateTypeParameter(name: "R", type: !707)
!837 = !DILocation(line: 111, column: 28, scope: !799)
!838 = !DILocation(line: 111, column: 39, scope: !799)
!839 = !DILocation(line: 111, column: 50, scope: !799)
!840 = !DILocation(line: 117, column: 47, scope: !799)
!841 = !DILocation(line: 117, column: 34, scope: !799)
!842 = !DILocation(line: 117, column: 9, scope: !799)
!843 = !DILocation(line: 118, column: 6, scope: !799)
!844 = distinct !DISubprogram(name: "size_hint<alloc::string::String, core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h5293f5da53ee1093E", scope: !732, file: !731, line: 107, type: !845, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !850, retainedNodes: !848)
!845 = !DISubroutineType(types: !846)
!846 = !{!703, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Map<core::slice::iter::Iter<&str>, solana_frozen_abi::abi_digester::{impl#2}::update::{closure#0}>", baseType: !738, size: 64, align: 64, dwarfAddressSpace: 0)
!848 = !{!849}
!849 = !DILocalVariable(name: "self", arg: 1, scope: !844, file: !731, line: 107, type: !847)
!850 = !{!789, !760, !761}
!851 = !DILocation(line: 107, column: 18, scope: !844)
!852 = !DILocation(line: 108, column: 9, scope: !844)
!853 = !DILocation(line: 109, column: 6, scope: !844)
!854 = distinct !DISubprogram(name: "next<core::slice::iter::ChunksExactMut<u8>, core::slice::iter::Iter<u32>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h4b72385861a283afE", scope: !856, file: !855, line: 76, type: !858, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !899, retainedNodes: !902)
!855 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/iter/adapters/zip.rs", directory: "", checksumkind: CSK_MD5, checksum: "f4879531fb05d5b8b226fa4bf4c2f512")
!856 = !DINamespace(name: "{impl#1}", scope: !857)
!857 = !DINamespace(name: "zip", scope: !734)
!858 = !DISubroutineType(types: !859)
!859 = !{!860, !877}
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(&mut [u8], &u32)>", scope: !15, file: !2, size: 192, align: 64, elements: !861, identifier: "9693b085f8745e23426d204494045ded")
!861 = !{!862}
!862 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 192, align: 64, elements: !863, templateParams: !866, identifier: "9693b085f8745e23426d204494045ded_variant_part", discriminator: !84)
!863 = !{!864, !873}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !862, file: !2, baseType: !865, size: 192, align: 64, extraData: i64 0)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !860, file: !2, size: 192, align: 64, elements: !4, templateParams: !866, identifier: "9693b085f8745e23426d204494045ded::None")
!866 = !{!867}
!867 = !DITemplateTypeParameter(name: "T", type: !868)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&mut [u8], &u32)", file: !2, size: 192, align: 64, elements: !869, templateParams: !4, identifier: "69174ddb67290a6641699b89256df0eb")
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !868, file: !2, baseType: !654, size: 128, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !868, file: !2, baseType: !872, size: 64, align: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !637, size: 64, align: 64, dwarfAddressSpace: 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !862, file: !2, baseType: !874, size: 192, align: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !860, file: !2, size: 192, align: 64, elements: !875, templateParams: !866, identifier: "9693b085f8745e23426d204494045ded::Some")
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !874, file: !2, baseType: !868, size: 192, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Zip<core::slice::iter::ChunksExactMut<u8>, core::slice::iter::Iter<u32>>", baseType: !878, size: 64, align: 64, dwarfAddressSpace: 0)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::slice::iter::ChunksExactMut<u8>, core::slice::iter::Iter<u32>>", scope: !857, file: !2, size: 640, align: 64, elements: !879, templateParams: !899, identifier: "7740f65415c9eb15cd66ac6cb7746243")
!879 = !{!880, !881, !896, !897, !898}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !878, file: !2, baseType: !659, size: 320, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !878, file: !2, baseType: !882, size: 128, align: 64, offset: 320)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u32>", scope: !650, file: !2, size: 128, align: 64, elements: !883, templateParams: !889, identifier: "2399f617fc39695640df2cedabeca438")
!883 = !{!884, !891, !892}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !882, file: !2, baseType: !885, size: 64, align: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u32>", scope: !133, file: !2, size: 64, align: 64, elements: !886, templateParams: !889, identifier: "ec5c51d7a5154aa967e8d6aeafb3bfe1")
!886 = !{!887}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !885, file: !2, baseType: !888, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u32", baseType: !637, size: 64, align: 64, dwarfAddressSpace: 0)
!889 = !{!890}
!890 = !DITemplateTypeParameter(name: "T", type: !637)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !882, file: !2, baseType: !888, size: 64, align: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !882, file: !2, baseType: !893, align: 8)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u32>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !894, identifier: "1d35292fe7496218cbd0467e0e94625e")
!894 = !{!895}
!895 = !DITemplateTypeParameter(name: "T", type: !872)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !878, file: !2, baseType: !73, size: 64, align: 64, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !878, file: !2, baseType: !73, size: 64, align: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !878, file: !2, baseType: !73, size: 64, align: 64, offset: 576)
!899 = !{!900, !901}
!900 = !DITemplateTypeParameter(name: "A", type: !659)
!901 = !DITemplateTypeParameter(name: "B", type: !882)
!902 = !{!903}
!903 = !DILocalVariable(name: "self", arg: 1, scope: !854, file: !855, line: 76, type: !877)
!904 = !DILocation(line: 76, column: 13, scope: !854)
!905 = !DILocation(line: 77, column: 9, scope: !854)
!906 = !DILocation(line: 78, column: 6, scope: !854)
!907 = distinct !DISubprogram(name: "next_back", linkageName: "_ZN102_$LT$core..str..iter..CharIndices$u20$as$u20$core..iter..traits..double_ended..DoubleEndedIterator$GT$9next_back17h8e401ac6d7d70474E", scope: !909, file: !908, line: 171, type: !911, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !4, retainedNodes: !951)
!908 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "f779e00203b15b13d5c175584230dbb4")
!909 = !DINamespace(name: "{impl#6}", scope: !910)
!910 = !DINamespace(name: "iter", scope: !407)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !931}
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, char)>", scope: !15, file: !2, size: 128, align: 64, elements: !914, identifier: "31d4e8368d6edb6eb866d0c699ce3b34")
!914 = !{!915}
!915 = !DICompositeType(tag: DW_TAG_variant_part, scope: !15, file: !2, size: 128, align: 64, elements: !916, templateParams: !919, identifier: "31d4e8368d6edb6eb866d0c699ce3b34_variant_part", discriminator: !930)
!916 = !{!917, !926}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !915, file: !2, baseType: !918, size: 128, align: 64, extraData: i64 1114112)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !913, file: !2, size: 128, align: 64, elements: !4, templateParams: !919, identifier: "31d4e8368d6edb6eb866d0c699ce3b34::None")
!919 = !{!920}
!920 = !DITemplateTypeParameter(name: "T", type: !921)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, char)", file: !2, size: 128, align: 64, elements: !922, templateParams: !4, identifier: "6e1ae05d5199b141d676567142ce0f12")
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !921, file: !2, baseType: !73, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !921, file: !2, baseType: !925, size: 32, align: 32, offset: 64)
!925 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !915, file: !2, baseType: !927, size: 128, align: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !913, file: !2, size: 128, align: 64, elements: !928, templateParams: !919, identifier: "31d4e8368d6edb6eb866d0c699ce3b34::Some")
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !927, file: !2, baseType: !921, size: 128, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !2, baseType: !637, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut CharIndices", baseType: !932, size: 64, align: 64, dwarfAddressSpace: 0)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharIndices", scope: !910, file: !2, size: 192, align: 64, elements: !933, templateParams: !4, identifier: "b5243a1c7944575ae3fa63467372053")
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "front_offset", scope: !932, file: !2, baseType: !73, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !932, file: !2, baseType: !936, size: 128, align: 64, offset: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chars", scope: !910, file: !2, size: 128, align: 64, elements: !937, templateParams: !4, identifier: "730b184303cd94baa6286550fbfb3ab6")
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !936, file: !2, baseType: !939, size: 128, align: 64)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !650, file: !2, size: 128, align: 64, elements: !940, templateParams: !70, identifier: "d497f50a2820f37aaf72dc233672c27f")
!940 = !{!941, !945, !946}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !939, file: !2, baseType: !942, size: 64, align: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !133, file: !2, size: 64, align: 64, elements: !943, templateParams: !70, identifier: "406fec2678b8bb45d8db3433ccc0ff79")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !942, file: !2, baseType: !65, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !939, file: !2, baseType: !65, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !939, file: !2, baseType: !947, align: 8)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !69, file: !2, align: 8, elements: !4, templateParams: !948, identifier: "5ce1d76292b615ef89d76584ca834d06")
!948 = !{!949}
!949 = !DITemplateTypeParameter(name: "T", type: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!951 = !{!952}
!952 = !DILocalVariable(name: "self", arg: 1, scope: !907, file: !908, line: 171, type: !931)
!953 = !DILocation(line: 171, column: 18, scope: !907)
!954 = !DILocation(line: 172, column: 9, scope: !907)
!955 = !{i32 0, i32 1114113}
!956 = !DILocation(line: 172, column: 35, scope: !907)
!957 = !DILocation(line: 176, column: 6, scope: !907)
!958 = distinct !DISubprogram(name: "{closure#0}", linkageName: "_ZN102_$LT$core..str..iter..CharIndices$u20$as$u20$core..iter..traits..double_ended..DoubleEndedIterator$GT$9next_back28_$u7b$$u7b$closure$u7d$$u7d$17hceb1b5c6b476bdb7E", scope: !959, file: !908, line: 172, type: !960, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !4, retainedNodes: !966)
!959 = !DINamespace(name: "next_back", scope: !909)
!960 = !DISubroutineType(types: !961)
!961 = !{!921, !962, !925}
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !959, file: !2, size: 64, align: 64, elements: !963, templateParams: !4, identifier: "110767daeb61ed497a13a716f71fce38")
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self", scope: !962, file: !2, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&mut CharIndices", baseType: !931, size: 64, align: 64, dwarfAddressSpace: 0)
!966 = !{!967, !968, !969}
!967 = !DILocalVariable(name: "ch", arg: 2, scope: !958, file: !908, line: 172, type: !925)
!968 = !DILocalVariable(name: "self", scope: !958, file: !908, line: 171, type: !931, align: 8)
!969 = !DILocalVariable(name: "index", scope: !970, file: !908, line: 173, type: !73, align: 8)
!970 = distinct !DILexicalBlock(scope: !958, file: !908, line: 173, column: 13)
!971 = !DILocation(line: 171, column: 18, scope: !958)
!972 = !DILocation(line: 172, column: 36, scope: !958)
!973 = !DILocation(line: 173, column: 25, scope: !958)
!974 = !DILocation(line: 173, column: 45, scope: !958)
!975 = !DILocalVariable(name: "self", arg: 1, scope: !976, file: !977, line: 119, type: !981)
!976 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN102_$LT$core..slice..iter..Iter$LT$T$GT$$u20$as$u20$core..iter..traits..exact_size..ExactSizeIterator$GT$3len17h2835548d8e095906E", scope: !978, file: !977, line: 119, type: !979, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !577, templateParams: !70, retainedNodes: !982)
!977 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/slice/iter/macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "eaa73f4306714798d2867dabeabed334")
!978 = !DINamespace(name: "{impl#171}", scope: !650)
!979 = !DISubroutineType(types: !980)
!980 = !{!73, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Iter<u8>", baseType: !939, size: 64, align: 64, dwarfAddressSpace: 0)
!982 = !{!975, !983, !985, !987}
!983 = !DILocalVariable(name: "start", scope: !984, file: !977, line: 120, type: !942, align: 8)
!984 = distinct !DILexicalBlock(scope: !976, file: !977, line: 18, column: 9)
!985 = !DILocalVariable(name: "size", scope: !986, file: !977, line: 120, type: !73, align: 8)
!986 = distinct !DILexicalBlock(scope: !984, file: !977, line: 19, column: 9)
!987 = !DILocalVariable(name: "diff", scope: !988, file: !977, line: 120, type: !73, align: 8)
!988 = distinct !DILexicalBlock(scope: !986, file: !977, line: 29, column: 13)
!989 = !DILocation(line: 119, column: 20, scope: !976, inlinedAt: !990)
!990 = distinct !DILocation(line: 173, column: 45, scope: !958)
!991 = !DILocation(line: 120, column: 17, scope: !976, inlinedAt: !990)
!992 = !DILocation(line: 120, column: 17, scope: !984, inlinedAt: !990)
!993 = !DILocalVariable(arg: 1, scope: !994, file: !648, line: 40, type: !65)
