; ModuleID = 'spl_associated_token_account.9a025ed9-cgu.0'
source_filename = "spl_associated_token_account.9a025ed9-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpfel"

%"std::io::Error" = type { %"std::io::error::Repr" }
%"std::io::error::Repr" = type { i8, [15 x i8] }
%"std::result::Result<(), std::io::Error>" = type { i8, [15 x i8] }
%"std::result::Result<std::convert::Infallible, std::io::Error>::Err" = type { %"std::io::Error" }
%"std::result::Result<(), std::io::Error>::Err" = type { %"std::io::Error" }
%"std::result::Result<instruction::AssociatedTokenAccountInstruction, std::io::Error>" = type { i8, [15 x i8] }
%"std::result::Result<instruction::AssociatedTokenAccountInstruction, std::io::Error>::Err" = type { %"std::io::Error" }
%"std::string::String" = type { %"std::vec::Vec<u8>" }
%"std::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"instruction::AssociatedTokenAccountInstruction::Create" = type {}
%"std::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Opaque" = type {}
%"std::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"std::panic::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"std::rc::RcBox<std::cell::RefCell<&mut [u8]>>" = type { i64, i64, %"std::cell::RefCell<&mut [u8]>" }
%"std::cell::RefCell<&mut [u8]>" = type { i64, { i8*, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !2, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !5, identifier: "vtable")
!4 = !{}
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !6, file: !2, size: 128, align: 64, elements: !9, templateParams: !4, identifier: "69f1f962e3822563c6bb167bec057b2c")
!6 = !DINamespace(name: "error", scope: !7)
!7 = !DINamespace(name: "io", scope: !8)
!8 = !DINamespace(name: "std", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !5, file: !2, baseType: !11, size: 128, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !6, file: !2, size: 128, align: 64, elements: !12, identifier: "b2dbfc1ac6d6922b485924bc8bed010")
!12 = !{!13}
!13 = !DICompositeType(tag: DW_TAG_variant_part, scope: !6, file: !2, size: 128, align: 64, elements: !14, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010_variant_part", discriminator: !109)
!14 = !{!15, !20, !68, !80}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !13, file: !2, baseType: !16, size: 128, align: 64, extraData: i64 0)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !11, file: !2, size: 128, align: 64, elements: !17, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::Os")
!17 = !{!18}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !16, file: !2, baseType: !19, size: 32, align: 32, offset: 32)
!19 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !13, file: !2, baseType: !21, size: 128, align: 64, extraData: i64 1)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !11, file: !2, size: 128, align: 64, elements: !22, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::Simple")
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !21, file: !2, baseType: !24, size: 8, align: 8, offset: 8)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !6, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !26)
!25 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!27 = !DIEnumerator(name: "NotFound", value: 0)
!28 = !DIEnumerator(name: "PermissionDenied", value: 1)
!29 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!30 = !DIEnumerator(name: "ConnectionReset", value: 3)
!31 = !DIEnumerator(name: "HostUnreachable", value: 4)
!32 = !DIEnumerator(name: "NetworkUnreachable", value: 5)
!33 = !DIEnumerator(name: "ConnectionAborted", value: 6)
!34 = !DIEnumerator(name: "NotConnected", value: 7)
!35 = !DIEnumerator(name: "AddrInUse", value: 8)
!36 = !DIEnumerator(name: "AddrNotAvailable", value: 9)
!37 = !DIEnumerator(name: "NetworkDown", value: 10)
!38 = !DIEnumerator(name: "BrokenPipe", value: 11)
!39 = !DIEnumerator(name: "AlreadyExists", value: 12)
!40 = !DIEnumerator(name: "WouldBlock", value: 13)
!41 = !DIEnumerator(name: "NotADirectory", value: 14)
!42 = !DIEnumerator(name: "IsADirectory", value: 15)
!43 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16)
!44 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17)
!45 = !DIEnumerator(name: "FilesystemLoop", value: 18)
!46 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19)
!47 = !DIEnumerator(name: "InvalidInput", value: 20)
!48 = !DIEnumerator(name: "InvalidData", value: 21)
!49 = !DIEnumerator(name: "TimedOut", value: 22)
!50 = !DIEnumerator(name: "WriteZero", value: 23)
!51 = !DIEnumerator(name: "StorageFull", value: 24)
!52 = !DIEnumerator(name: "NotSeekable", value: 25)
!53 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26)
!54 = !DIEnumerator(name: "FileTooLarge", value: 27)
!55 = !DIEnumerator(name: "ResourceBusy", value: 28)
!56 = !DIEnumerator(name: "ExecutableFileBusy", value: 29)
!57 = !DIEnumerator(name: "Deadlock", value: 30)
!58 = !DIEnumerator(name: "CrossesDevices", value: 31)
!59 = !DIEnumerator(name: "TooManyLinks", value: 32)
!60 = !DIEnumerator(name: "FilenameTooLong", value: 33)
!61 = !DIEnumerator(name: "ArgumentListTooLong", value: 34)
!62 = !DIEnumerator(name: "Interrupted", value: 35)
!63 = !DIEnumerator(name: "Unsupported", value: 36)
!64 = !DIEnumerator(name: "UnexpectedEof", value: 37)
!65 = !DIEnumerator(name: "OutOfMemory", value: 38)
!66 = !DIEnumerator(name: "Other", value: 39)
!67 = !DIEnumerator(name: "Uncategorized", value: 40)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !13, file: !2, baseType: !69, size: 128, align: 64, extraData: i64 2)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !11, file: !2, size: 128, align: 64, elements: !70, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::SimpleMessage")
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !69, file: !2, baseType: !24, size: 8, align: 8, offset: 8)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !69, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !75, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !74, file: !2, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !74, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !13, file: !2, baseType: !81, size: 128, align: 64, extraData: i64 3)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !11, file: !2, size: 128, align: 64, elements: !82, templateParams: !4, identifier: "b2dbfc1ac6d6922b485924bc8bed010::Custom")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !81, file: !2, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !6, file: !2, size: 192, align: 64, elements: !86, templateParams: !4, identifier: "1f4969fa038b273abfa39b7e982dff20")
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !85, file: !2, baseType: !24, size: 8, align: 8, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !85, file: !2, baseType: !89, size: 128, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", scope: !90, file: !2, size: 128, align: 64, elements: !92, templateParams: !100, identifier: "5ea046ff38e8262ae5fd9e712928a3ca")
!90 = !DINamespace(name: "boxed", scope: !91)
!91 = !DINamespace(name: "alloc", scope: null)
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !89, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !89, file: !2, baseType: !96, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 192, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 3, lowerBound: 0)
!100 = !{!101, !106}
!101 = !DITemplateTypeParameter(name: "T", type: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !103, templateParams: !4, identifier: "73ee555cfc6112afe69c3a638dc4b32d")
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !102, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !102, file: !2, baseType: !96, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!106 = !DITemplateTypeParameter(name: "A", type: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !108, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "9d0734f8822fbd33e4e561ab380af08d")
!108 = !DINamespace(name: "alloc", scope: !91)
!109 = !DIDerivedType(tag: DW_TAG_member, scope: !6, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagArtificial)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "ID", linkageName: "_ZN28spl_associated_token_account2ID17h2c78a3f5ca622435E", scope: !112, file: !113, line: 19, type: !114, isLocal: false, isDefinition: true, align: 1)
!112 = !DINamespace(name: "spl_associated_token_account", scope: null)
!113 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/spl-associated-token-account-1.0.5/src/lib.rs", directory: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/spl-associated-token-account-1.0.5", checksumkind: CSK_MD5, checksum: "c25ee1e279e2496c3c74308fa2acbaa6")
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pubkey", scope: !115, file: !2, size: 256, align: 8, elements: !117, templateParams: !4, identifier: "a81210f31f9b20ffe048629424c3a0e6")
!115 = !DINamespace(name: "pubkey", scope: !116)
!116 = !DINamespace(name: "solana_program", scope: null)
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !114, file: !2, baseType: !119, size: 256, align: 8)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, align: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 32, lowerBound: 0)
!122 = !{i32 7, !"PIC Level", i32 2}
!123 = !{i32 2, !"Debug Info Version", i32 3}
!124 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !125, producer: "clang LLVM (rustc version 1.56.0-dev)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, globals: !148)
!125 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/spl-associated-token-account-1.0.5/src/lib.rs", directory: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/spl-associated-token-account-1.0.5")
!126 = !{!24, !127, !133, !142}
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !128, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !130)
!128 = !DINamespace(name: "result", scope: !129)
!129 = !DINamespace(name: "core", scope: null)
!130 = !{!131, !132}
!131 = !DIEnumerator(name: "Ok", value: 0)
!132 = !DIEnumerator(name: "Err", value: 1)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !134, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !137)
!134 = !DINamespace(name: "v1", scope: !135)
!135 = !DINamespace(name: "rt", scope: !136)
!136 = !DINamespace(name: "fmt", scope: !129)
!137 = !{!138, !139, !140, !141}
!138 = !DIEnumerator(name: "Left", value: 0)
!139 = !DIEnumerator(name: "Right", value: 1)
!140 = !DIEnumerator(name: "Center", value: 2)
!141 = !DIEnumerator(name: "Unknown", value: 3)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !143, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagEnumClass, elements: !144)
!143 = !DINamespace(name: "panicking", scope: !129)
!144 = !{!145, !146, !147}
!145 = !DIEnumerator(name: "Eq", value: 0)
!146 = !DIEnumerator(name: "Ne", value: 1)
!147 = !DIEnumerator(name: "Match", value: 2)
!148 = !{!0, !110}
!149 = distinct !DISubprogram(name: "sol_log", linkageName: "_ZN14solana_program3log7sol_log17h6f763182291a5031E", scope: !151, file: !150, line: 92, type: !152, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !154)
!150 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/solana-program-1.10.34/src/log.rs", directory: "", checksumkind: CSK_MD5, checksum: "81bb6e4be8152e016d66e542800f5aec")
!151 = !DINamespace(name: "log", scope: !116)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !74}
!154 = !{!155}
!155 = !DILocalVariable(name: "message", arg: 1, scope: !149, file: !150, line: 92, type: !74)
!156 = !DILocation(line: 92, column: 16, scope: !149)
!157 = !DILocation(line: 95, column: 18, scope: !149)
!158 = !DILocation(line: 95, column: 36, scope: !149)
!159 = !DILocation(line: 95, column: 9, scope: !149)
!160 = !DILocation(line: 100, column: 2, scope: !149)
!161 = distinct !DISubprogram(name: "from_residual<(), std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h0b90e483a6cf3fa0E", scope: !163, file: !162, line: 1913, type: !164, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !201, retainedNodes: !197)
!162 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "f73030f150a3926f0f5a346ed13cef73")
!163 = !DINamespace(name: "{impl#37}", scope: !128)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !183}
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !128, file: !2, size: 128, align: 64, elements: !167, identifier: "f3716c15d363f3c73359a4da88b21539")
!167 = !{!168}
!168 = !DICompositeType(tag: DW_TAG_variant_part, scope: !128, file: !2, size: 128, align: 64, elements: !169, templateParams: !175, identifier: "f3716c15d363f3c73359a4da88b21539_variant_part", discriminator: !182)
!169 = !{!170, !178}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !168, file: !2, baseType: !171, size: 128, align: 64, extraData: i64 4)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !166, file: !2, size: 128, align: 64, elements: !172, templateParams: !175, identifier: "f3716c15d363f3c73359a4da88b21539::Ok")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !2, baseType: !174, align: 8)
!174 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!175 = !{!176, !177}
!176 = !DITemplateTypeParameter(name: "T", type: !174)
!177 = !DITemplateTypeParameter(name: "E", type: !5)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !168, file: !2, baseType: !179, size: 128, align: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !166, file: !2, size: 128, align: 64, elements: !180, templateParams: !175, identifier: "f3716c15d363f3c73359a4da88b21539::Err")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !179, file: !2, baseType: !5, size: 128, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !2, baseType: !25, size: 8, align: 8, flags: DIFlagArtificial)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, std::io::error::Error>", scope: !128, file: !2, size: 128, align: 64, elements: !184, identifier: "9933c6569f7991d33bdb1d8aefa8214b")
!184 = !{!185}
!185 = !DICompositeType(tag: DW_TAG_variant_part, scope: !128, file: !2, size: 128, align: 64, elements: !186, templateParams: !191, identifier: "9933c6569f7991d33bdb1d8aefa8214b_variant_part")
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !185, file: !2, baseType: !188, size: 128, align: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !183, file: !2, size: 128, align: 64, elements: !189, templateParams: !191, identifier: "9933c6569f7991d33bdb1d8aefa8214b::Err")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !188, file: !2, baseType: !5, size: 128, align: 64)
!191 = !{!192, !177}
!192 = !DITemplateTypeParameter(name: "T", type: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !194, file: !2, align: 8, elements: !195, identifier: "866eee8446b1bfa4f6d9cf9584e40412")
!194 = !DINamespace(name: "convert", scope: !129)
!195 = !{!196}
!196 = !DICompositeType(tag: DW_TAG_variant_part, scope: !194, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "866eee8446b1bfa4f6d9cf9584e40412_variant_part")
!197 = !{!198, !199}
!198 = !DILocalVariable(name: "residual", arg: 1, scope: !161, file: !162, line: 1913, type: !183)
!199 = !DILocalVariable(name: "e", scope: !200, file: !162, line: 1915, type: !5, align: 8)
!200 = distinct !DILexicalBlock(scope: !161, file: !162, line: 1915, column: 13)
!201 = !{!176, !177, !202}
!202 = !DITemplateTypeParameter(name: "F", type: !5)
!203 = !DILocation(line: 1913, column: 22, scope: !161)
!204 = !DILocation(line: 1915, column: 17, scope: !200)
!205 = !DILocation(line: 1915, column: 17, scope: !161)
!206 = !DILocation(line: 1915, column: 38, scope: !200)
!207 = !DILocation(line: 1915, column: 27, scope: !200)
!208 = !DILocation(line: 1915, column: 23, scope: !200)
!209 = !DILocation(line: 1917, column: 6, scope: !161)
!210 = distinct !DISubprogram(name: "from_residual<spl_associated_token_account::instruction::AssociatedTokenAccountInstruction, std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h33a39f23483cad35E", scope: !163, file: !162, line: 1913, type: !211, scopeLine: 1913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !238, retainedNodes: !234)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !183}
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<spl_associated_token_account::instruction::AssociatedTokenAccountInstruction, std::io::error::Error>", scope: !128, file: !2, size: 128, align: 64, elements: !214, identifier: "d62cac556bc6b52344f8b51386140d42")
!214 = !{!215}
!215 = !DICompositeType(tag: DW_TAG_variant_part, scope: !128, file: !2, size: 128, align: 64, elements: !216, templateParams: !228, identifier: "d62cac556bc6b52344f8b51386140d42_variant_part", discriminator: !182)
!216 = !{!217, !230}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !215, file: !2, baseType: !218, size: 128, align: 64, extraData: i64 4)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !213, file: !2, size: 128, align: 64, elements: !219, templateParams: !228, identifier: "d62cac556bc6b52344f8b51386140d42::Ok")
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !218, file: !2, baseType: !221, align: 8)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssociatedTokenAccountInstruction", scope: !222, file: !2, align: 8, elements: !223, identifier: "56f16339b677a1d8464182a8736ade1f")
!222 = !DINamespace(name: "instruction", scope: !112)
!223 = !{!224}
!224 = !DICompositeType(tag: DW_TAG_variant_part, scope: !222, file: !2, align: 8, elements: !225, templateParams: !4, identifier: "56f16339b677a1d8464182a8736ade1f_variant_part")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Create", scope: !224, file: !2, baseType: !227, align: 8)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Create", scope: !221, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "56f16339b677a1d8464182a8736ade1f::Create")
!228 = !{!229, !177}
!229 = !DITemplateTypeParameter(name: "T", type: !221)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !215, file: !2, baseType: !231, size: 128, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !213, file: !2, size: 128, align: 64, elements: !232, templateParams: !228, identifier: "d62cac556bc6b52344f8b51386140d42::Err")
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !231, file: !2, baseType: !5, size: 128, align: 64)
!234 = !{!235, !236}
!235 = !DILocalVariable(name: "residual", arg: 1, scope: !210, file: !162, line: 1913, type: !183)
!236 = !DILocalVariable(name: "e", scope: !237, file: !162, line: 1915, type: !5, align: 8)
!237 = distinct !DILexicalBlock(scope: !210, file: !162, line: 1915, column: 13)
!238 = !{!229, !177, !202}
!239 = !DILocation(line: 1913, column: 22, scope: !210)
!240 = !DILocation(line: 1915, column: 17, scope: !237)
!241 = !DILocation(line: 1915, column: 17, scope: !210)
!242 = !DILocation(line: 1915, column: 38, scope: !237)
!243 = !DILocation(line: 1915, column: 27, scope: !237)
!244 = !DILocation(line: 1915, column: 23, scope: !237)
!245 = !DILocation(line: 1917, column: 6, scope: !210)
!246 = distinct !DISubprogram(name: "to_string", linkageName: "_ZN47_$LT$str$u20$as$u20$alloc..string..ToString$GT$9to_string17hc39ba37da46b496aE", scope: !248, file: !247, line: 2444, type: !250, scopeLine: 2444, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !277)
!247 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "6e72f4c70a64aa2b17dc14952632c4d9")
!248 = !DINamespace(name: "{impl#44}", scope: !249)
!249 = !DINamespace(name: "string", scope: !91)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !74}
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !249, file: !2, size: 192, align: 64, elements: !253, templateParams: !4, identifier: "96eaa147e4cb6ee42e5dcd78906547cd")
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !252, file: !2, baseType: !255, size: 192, align: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !256, file: !2, size: 192, align: 64, elements: !257, templateParams: !275, identifier: "56aa0380f8224c92be7dc99cfce9180f")
!256 = !DINamespace(name: "vec", scope: !91)
!257 = !{!258, !276}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !255, file: !2, baseType: !259, size: 128, align: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !260, file: !2, size: 128, align: 64, elements: !261, templateParams: !275, identifier: "47ed2282bf82d40f2b2c1ebc77e9f331")
!260 = !DINamespace(name: "raw_vec", scope: !91)
!261 = !{!262, !273, !274}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !259, file: !2, baseType: !263, size: 64, align: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !264, file: !2, size: 64, align: 64, elements: !266, templateParams: !271, identifier: "76ad11c5918345b022d81965d637386")
!264 = !DINamespace(name: "unique", scope: !265)
!265 = !DINamespace(name: "ptr", scope: !129)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !263, file: !2, baseType: !77, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !263, file: !2, baseType: !269, align: 8)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !270, file: !2, align: 8, elements: !4, templateParams: !271, identifier: "d9180f7e28d2761ea11f32bda27bf4b6")
!270 = !DINamespace(name: "marker", scope: !129)
!271 = !{!272}
!272 = !DITemplateTypeParameter(name: "T", type: !25)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !259, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !259, file: !2, baseType: !107, align: 8)
!275 = !{!272, !106}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !255, file: !2, baseType: !79, size: 64, align: 64, offset: 128)
!277 = !{!278}
!278 = !DILocalVariable(name: "self", arg: 1, scope: !246, file: !247, line: 2444, type: !74)
!279 = !DILocation(line: 2444, column: 18, scope: !246)
!280 = !DILocation(line: 2445, column: 9, scope: !246)
!281 = !DILocation(line: 2446, column: 6, scope: !246)
!282 = distinct !DISubprogram(name: "new<spl_associated_token_account::instruction::AssociatedTokenAccountInstruction>", linkageName: "_ZN4core3fmt10ArgumentV13new17h233b580cbc7e89d6E", scope: !284, file: !283, line: 302, type: !323, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !332, retainedNodes: !329)
!283 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "fc8dfb4543b7986b6225b25d4f76a5ce")
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !136, file: !2, size: 128, align: 64, elements: !285, templateParams: !4, identifier: "899142106ae236a2208250e894c2e1f5")
!285 = !{!286, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !2, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Opaque", baseType: !288, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !2, align: 8, elements: !4, identifier: "877e2849686608d7fea70d5469669ca4")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !284, file: !2, baseType: !290, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!291 = !DISubroutineType(types: !292)
!292 = !{!127, !287, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Formatter", baseType: !294, size: 64, align: 64, dwarfAddressSpace: 0)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !136, file: !2, size: 512, align: 64, elements: !295, templateParams: !4, identifier: "37f4daa474efe0abec93026f6af11d04")
!295 = !{!296, !298, !300, !301, !317, !318}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !294, file: !2, baseType: !297, size: 32, align: 32, offset: 384)
!297 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !294, file: !2, baseType: !299, size: 32, align: 32, offset: 416)
!299 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !294, file: !2, baseType: !133, size: 8, align: 8, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !294, file: !2, baseType: !302, size: 128, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !303, file: !2, size: 128, align: 64, elements: !304, identifier: "4849786e80860f5416c4c6b259f5a683")
!303 = !DINamespace(name: "option", scope: !129)
!304 = !{!305}
!305 = !DICompositeType(tag: DW_TAG_variant_part, scope: !303, file: !2, size: 128, align: 64, elements: !306, templateParams: !309, identifier: "4849786e80860f5416c4c6b259f5a683_variant_part", discriminator: !315)
!306 = !{!307, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !305, file: !2, baseType: !308, size: 128, align: 64, extraData: i64 0)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !302, file: !2, size: 128, align: 64, elements: !4, templateParams: !309, identifier: "4849786e80860f5416c4c6b259f5a683::None")
!309 = !{!310}
!310 = !DITemplateTypeParameter(name: "T", type: !79)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !305, file: !2, baseType: !312, size: 128, align: 64, extraData: i64 1)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !302, file: !2, size: 128, align: 64, elements: !313, templateParams: !309, identifier: "4849786e80860f5416c4c6b259f5a683::Some")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !312, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, scope: !303, file: !2, baseType: !316, size: 64, align: 64, flags: DIFlagArtificial)
!316 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !294, file: !2, baseType: !302, size: 128, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !294, file: !2, baseType: !319, size: 128, align: 64, offset: 256)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !320, templateParams: !4, identifier: "ab0a0458a7bfc4114bcaaa179b3e8910")
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !319, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !319, file: !2, baseType: !96, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!323 = !DISubroutineType(types: !324)
!324 = !{!284, !325, !326}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&AssociatedTokenAccountInstruction", baseType: !221, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&spl_associated_token_account::instruction::AssociatedTokenAccountInstruction, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !327, size: 64, align: 64, dwarfAddressSpace: 0)
!327 = !DISubroutineType(types: !328)
!328 = !{!127, !325, !293}
!329 = !{!330, !331}
!330 = !DILocalVariable(name: "x", arg: 1, scope: !282, file: !283, line: 302, type: !325)
!331 = !DILocalVariable(name: "f", arg: 2, scope: !282, file: !283, line: 302, type: !326)
!332 = !{!229}
!333 = !DILocation(line: 302, column: 23, scope: !282)
!334 = !DILocation(line: 302, column: 33, scope: !282)
!335 = !DILocation(line: 311, column: 42, scope: !282)
!336 = !DILocation(line: 311, column: 68, scope: !282)
!337 = !DILocation(line: 311, column: 18, scope: !282)
!338 = !DILocation(line: 312, column: 6, scope: !282)
!339 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num49_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u8$GT$3fmt17h4c1a587c89ac9fabE", scope: !341, file: !340, line: 185, type: !343, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !346)
!340 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6524fcfb870cfd6b104419b40f655d55")
!341 = !DINamespace(name: "{impl#84}", scope: !342)
!342 = !DINamespace(name: "num", scope: !136)
!343 = !DISubroutineType(types: !344)
!344 = !{!127, !345, !293}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!346 = !{!347, !348}
!347 = !DILocalVariable(name: "self", arg: 1, scope: !339, file: !340, line: 185, type: !345)
!348 = !DILocalVariable(name: "f", arg: 2, scope: !339, file: !340, line: 185, type: !293)
!349 = !DILocation(line: 185, column: 20, scope: !339)
!350 = !DILocation(line: 185, column: 27, scope: !339)
!351 = !DILocation(line: 186, column: 20, scope: !339)
!352 = !DILocation(line: 188, column: 27, scope: !339)
!353 = !DILocation(line: 187, column: 21, scope: !339)
!354 = !DILocation(line: 186, column: 17, scope: !339)
!355 = !DILocation(line: 193, column: 14, scope: !339)
!356 = !{i8 0, i8 2}
!357 = !DILocation(line: 191, column: 21, scope: !339)
!358 = !DILocation(line: 189, column: 21, scope: !339)
!359 = !DILocation(line: 188, column: 24, scope: !339)
!360 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117ha3582218cf629f25E", scope: !361, file: !283, line: 350, type: !419, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !421)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !136, file: !2, size: 384, align: 64, elements: !362, templateParams: !4, identifier: "503d474dbdb4b9bdcb6335aff8fef947")
!362 = !{!363, !369, !413}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !361, file: !2, baseType: !364, size: 128, align: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !365, templateParams: !4, identifier: "e5181a2ba73cefd2b9372dc5646453a9")
!365 = !{!366, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !364, file: !2, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !364, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !361, file: !2, baseType: !370, size: 128, align: 64, offset: 128)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !303, file: !2, size: 128, align: 64, elements: !371, identifier: "397a0ac37bf3530f2da349092773bdb1")
!371 = !{!372}
!372 = !DICompositeType(tag: DW_TAG_variant_part, scope: !303, file: !2, size: 128, align: 64, elements: !373, templateParams: !376, identifier: "397a0ac37bf3530f2da349092773bdb1_variant_part", discriminator: !315)
!373 = !{!374, !409}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !372, file: !2, baseType: !375, size: 128, align: 64, extraData: i64 0)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !370, file: !2, size: 128, align: 64, elements: !4, templateParams: !376, identifier: "397a0ac37bf3530f2da349092773bdb1::None")
!376 = !{!377}
!377 = !DITemplateTypeParameter(name: "T", type: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !379, templateParams: !4, identifier: "c45b2a5be65217bea740b1a64f131289")
!379 = !{!380, !408}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !378, file: !2, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const Argument", baseType: !382, size: 64, align: 64, dwarfAddressSpace: 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !134, file: !2, size: 448, align: 64, elements: !383, templateParams: !4, identifier: "be1a2a63eebf5bd46c1acffa2dd6e315")
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !382, file: !2, baseType: !79, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !382, file: !2, baseType: !386, size: 384, align: 64, offset: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !134, file: !2, size: 384, align: 64, elements: !387, templateParams: !4, identifier: "69ce227e4aab17788d1c0f03469b02a7")
!387 = !{!388, !389, !390, !391, !407}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !386, file: !2, baseType: !299, size: 32, align: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !386, file: !2, baseType: !133, size: 8, align: 8, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !386, file: !2, baseType: !297, size: 32, align: 32, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !386, file: !2, baseType: !392, size: 128, align: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !134, file: !2, size: 128, align: 64, elements: !393, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e")
!393 = !{!394}
!394 = !DICompositeType(tag: DW_TAG_variant_part, scope: !134, file: !2, size: 128, align: 64, elements: !395, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e_variant_part", discriminator: !406)
!395 = !{!396, !400, !404}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !394, file: !2, baseType: !397, size: 128, align: 64, extraData: i64 0)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !392, file: !2, size: 128, align: 64, elements: !398, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Is")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !397, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !394, file: !2, baseType: !401, size: 128, align: 64, extraData: i64 1)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !392, file: !2, size: 128, align: 64, elements: !402, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Param")
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !401, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !394, file: !2, baseType: !405, size: 128, align: 64, extraData: i64 2)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !392, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "8d4678e8b2f8b7aec73eabb6bdd8f01e::Implied")
!406 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !2, baseType: !316, size: 64, align: 64, flags: DIFlagArtificial)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !386, file: !2, baseType: !392, size: 128, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !378, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !372, file: !2, baseType: !410, size: 128, align: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !370, file: !2, size: 128, align: 64, elements: !411, templateParams: !376, identifier: "397a0ac37bf3530f2da349092773bdb1::Some")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !2, baseType: !378, size: 128, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !361, file: !2, baseType: !414, size: 128, align: 64, offset: 256)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !415, templateParams: !4, identifier: "afd1d87e15705e622b365ca1c27d8ada")
!415 = !{!416, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !414, file: !2, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ArgumentV1", baseType: !284, size: 64, align: 64, dwarfAddressSpace: 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !414, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!361, !364, !414}
!421 = !{!422, !423}
!422 = !DILocalVariable(name: "pieces", arg: 1, scope: !360, file: !283, line: 351, type: !364)
!423 = !DILocalVariable(name: "args", arg: 2, scope: !360, file: !283, line: 352, type: !414)
!424 = !DILocation(line: 351, column: 9, scope: !360)
!425 = !DILocation(line: 352, column: 9, scope: !360)
!426 = !DILocation(line: 354, column: 12, scope: !360)
!427 = !DILocation(line: 354, column: 56, scope: !360)
!428 = !DILocation(line: 354, column: 41, scope: !360)
!429 = !DILocation(line: 357, column: 34, scope: !360)
!430 = !DILocation(line: 357, column: 9, scope: !360)
!431 = !DILocation(line: 358, column: 6, scope: !360)
!432 = !DILocation(line: 355, column: 13, scope: !360)
!433 = distinct !DISubprogram(name: "size_of_val<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", linkageName: "_ZN4core3mem11size_of_val17h4064206b340bd2e3E", scope: !435, file: !434, line: 330, type: !436, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !478, retainedNodes: !476)
!434 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "00a9ca3300eee460d5c61559b280a726")
!435 = !DINamespace(name: "mem", scope: !129)
!436 = !DISubroutineType(types: !437)
!437 = !{!79, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&RcBox<core::cell::RefCell<&mut [u8]>>", baseType: !439, size: 64, align: 64, dwarfAddressSpace: 0)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut [u8]>>", scope: !440, file: !2, size: 320, align: 64, elements: !441, templateParams: !474, identifier: "ec7aebffa1601b4d3001fa488717db04")
!440 = !DINamespace(name: "rc", scope: !91)
!441 = !{!442, !450, !451}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !439, file: !2, baseType: !443, size: 64, align: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !444, file: !2, size: 64, align: 64, elements: !445, templateParams: !309, identifier: "d610ccc56ed6bc2d95c5846672673907")
!444 = !DINamespace(name: "cell", scope: !129)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !443, file: !2, baseType: !447, size: 64, align: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !444, file: !2, size: 64, align: 64, elements: !448, templateParams: !309, identifier: "df37019b130d2c01fbc34865afbd6522")
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !447, file: !2, baseType: !79, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !439, file: !2, baseType: !443, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !439, file: !2, baseType: !452, size: 192, align: 64, offset: 128)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut [u8]>", scope: !444, file: !2, size: 192, align: 64, elements: !453, templateParams: !472, identifier: "7b8d8c983afddbdb1c520939bc6434de")
!453 = !{!454, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !452, file: !2, baseType: !455, size: 64, align: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<isize>", scope: !444, file: !2, size: 64, align: 64, elements: !456, templateParams: !462, identifier: "4e95b0f2a1a1d843af31431b8d46a5a9")
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !455, file: !2, baseType: !458, size: 64, align: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !444, file: !2, size: 64, align: 64, elements: !459, templateParams: !462, identifier: "a478319df2321c642b07e6e189247bf")
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !458, file: !2, baseType: !461, size: 64, align: 64)
!461 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!462 = !{!463}
!463 = !DITemplateTypeParameter(name: "T", type: !461)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !452, file: !2, baseType: !465, size: 128, align: 64, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut [u8]>", scope: !444, file: !2, size: 128, align: 64, elements: !466, templateParams: !472, identifier: "832d880ad3cb9da2c7f8e74d7eb471dc")
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !465, file: !2, baseType: !468, size: 128, align: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !469, templateParams: !4, identifier: "7596319ecf86f60af9b48d8c05ebf9f7")
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !468, file: !2, baseType: !77, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!472 = !{!473}
!473 = !DITemplateTypeParameter(name: "T", type: !468)
!474 = !{!475}
!475 = !DITemplateTypeParameter(name: "T", type: !452)
!476 = !{!477}
!477 = !DILocalVariable(name: "val", arg: 1, scope: !433, file: !434, line: 330, type: !438)
!478 = !{!479}
!479 = !DITemplateTypeParameter(name: "T", type: !439)
!480 = !DILocation(line: 330, column: 37, scope: !433)
!481 = !DILocation(line: 332, column: 14, scope: !433)
!482 = !DILocation(line: 333, column: 2, scope: !433)
!483 = distinct !DISubprogram(name: "size_of_val<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", linkageName: "_ZN4core3mem11size_of_val17hae883d06a1696056E", scope: !435, file: !434, line: 330, type: !484, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !506, retainedNodes: !504)
!484 = !DISubroutineType(types: !485)
!485 = !{!79, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&RcBox<core::cell::RefCell<&mut u64>>", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<core::cell::RefCell<&mut u64>>", scope: !440, file: !2, size: 256, align: 64, elements: !488, templateParams: !502, identifier: "cd940ff313dfbf2c8cc0f66ebb255962")
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !487, file: !2, baseType: !443, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !487, file: !2, baseType: !443, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !487, file: !2, baseType: !492, size: 128, align: 64, offset: 128)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<&mut u64>", scope: !444, file: !2, size: 128, align: 64, elements: !493, templateParams: !500, identifier: "7d2673a3f332cc6d0037c3d8efd0c31")
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !492, file: !2, baseType: !455, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !492, file: !2, baseType: !496, size: 64, align: 64, offset: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<&mut u64>", scope: !444, file: !2, size: 64, align: 64, elements: !497, templateParams: !500, identifier: "fede724123caa5feb7f972fe06520498")
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !496, file: !2, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u64", baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!500 = !{!501}
!501 = !DITemplateTypeParameter(name: "T", type: !499)
!502 = !{!503}
!503 = !DITemplateTypeParameter(name: "T", type: !492)
!504 = !{!505}
!505 = !DILocalVariable(name: "val", arg: 1, scope: !483, file: !434, line: 330, type: !486)
!506 = !{!507}
!507 = !DITemplateTypeParameter(name: "T", type: !487)
!508 = !DILocation(line: 330, column: 37, scope: !483)
!509 = !DILocation(line: 332, column: 14, scope: !483)
!510 = !DILocation(line: 333, column: 2, scope: !483)
!511 = distinct !DISubprogram(name: "align_of_val<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", linkageName: "_ZN4core3mem12align_of_val17h02861c5bcc4143a4E", scope: !435, file: !434, line: 468, type: !436, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !478, retainedNodes: !512)
!512 = !{!513}
!513 = !DILocalVariable(name: "val", arg: 1, scope: !511, file: !434, line: 468, type: !438)
!514 = !DILocation(line: 468, column: 38, scope: !511)
!515 = !DILocation(line: 470, column: 14, scope: !511)
!516 = !DILocation(line: 471, column: 2, scope: !511)
!517 = distinct !DISubprogram(name: "align_of_val<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", linkageName: "_ZN4core3mem12align_of_val17h497aee5abac9e235E", scope: !435, file: !434, line: 468, type: !484, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !506, retainedNodes: !518)
!518 = !{!519}
!519 = !DILocalVariable(name: "val", arg: 1, scope: !517, file: !434, line: 468, type: !486)
!520 = !DILocation(line: 468, column: 38, scope: !517)
!521 = !DILocation(line: 470, column: 14, scope: !517)
!522 = !DILocation(line: 471, column: 2, scope: !517)
!523 = distinct !DISubprogram(name: "to_le_bytes", linkageName: "_ZN4core3num20_$LT$impl$u20$u8$GT$11to_le_bytes17h7445b8ef6fbf8a8bE", scope: !525, file: !524, line: 2091, type: !527, scopeLine: 2091, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !532)
!524 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "8bd5648afa999a95525abfd2832ef4ce")
!525 = !DINamespace(name: "{impl#6}", scope: !526)
!526 = !DINamespace(name: "num", scope: !129)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !25}
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, align: 8, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 1, lowerBound: 0)
!532 = !{!533}
!533 = !DILocalVariable(name: "self", arg: 1, scope: !523, file: !524, line: 2091, type: !25)
!534 = !DILocation(line: 2091, column: 34, scope: !523)
!535 = !DILocalVariable(name: "self", arg: 1, scope: !536, file: !524, line: 385, type: !25)
!536 = distinct !DISubprogram(name: "to_le", linkageName: "_ZN4core3num20_$LT$impl$u20$u8$GT$5to_le17h1031295ea73dbfc7E", scope: !525, file: !524, line: 385, type: !537, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!25, !25}
!539 = !{!535}
!540 = !DILocation(line: 385, column: 28, scope: !536, inlinedAt: !541)
!541 = distinct !DILocation(line: 2092, column: 13, scope: !523)
!542 = !DILocation(line: 2092, column: 13, scope: !523)
!543 = !DILocation(line: 2093, column: 10, scope: !523)
!544 = distinct !DISubprogram(name: "to_ne_bytes", linkageName: "_ZN4core3num20_$LT$impl$u20$u8$GT$11to_ne_bytes17h549e436e201bb20cE", scope: !525, file: !524, line: 2126, type: !527, scopeLine: 2126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !545)
!545 = !{!546}
!546 = !DILocalVariable(name: "self", arg: 1, scope: !544, file: !524, line: 2126, type: !25)
!547 = !DILocation(line: 2126, column: 34, scope: !544)
!548 = !DILocation(line: 2129, column: 22, scope: !544)
!549 = !DILocation(line: 2130, column: 10, scope: !544)
!550 = distinct !DISubprogram(name: "new_unchecked", linkageName: "_ZN4core3num7nonzero12NonZeroUsize13new_unchecked17h403c5b611598a334E", scope: !552, file: !551, line: 54, type: !556, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !558)
!551 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/num/nonzero.rs", directory: "", checksumkind: CSK_MD5, checksum: "07b0126d41e0d52cc6d98b96652bf4bd")
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroUsize", scope: !553, file: !2, size: 64, align: 64, elements: !554, templateParams: !4, identifier: "21623c21723d1648102501c4f9f9b08d")
!553 = !DINamespace(name: "nonzero", scope: !526)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !552, file: !2, baseType: !79, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!552, !79}
!558 = !{!559}
!559 = !DILocalVariable(name: "n", arg: 1, scope: !550, file: !551, line: 54, type: !79)
!560 = !DILocation(line: 54, column: 51, scope: !550)
!561 = !DILocation(line: 56, column: 30, scope: !550)
!562 = !DILocation(line: 57, column: 18, scope: !550)
!563 = !{i64 1, i64 0}
!564 = distinct !DISubprogram(name: "get", linkageName: "_ZN4core3num7nonzero12NonZeroUsize3get17hfcf16a5426450047E", scope: !552, file: !551, line: 76, type: !565, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!79, !552}
!567 = !{!568}
!568 = !DILocalVariable(name: "self", arg: 1, scope: !564, file: !551, line: 76, type: !552)
!569 = !DILocation(line: 76, column: 34, scope: !564)
!570 = !DILocation(line: 78, column: 18, scope: !564)
!571 = distinct !DISubprogram(name: "drop_in_place<solana_program::account_info::AccountInfo>", linkageName: "_ZN4core3ptr62drop_in_place$LT$solana_program..account_info..AccountInfo$GT$17hd1338e6d4cf6ac95E", scope: !265, file: !572, line: 188, type: !573, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !610, retainedNodes: !608)
!572 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "207736266ff0d04d675044b37a0a2de6")
!573 = !DISubroutineType(types: !574)
!574 = !{null, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut AccountInfo", baseType: !576, size: 64, align: 64, dwarfAddressSpace: 0)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountInfo", scope: !577, file: !2, size: 384, align: 64, elements: !578, templateParams: !4, identifier: "2a2d21d971673a11e7cb67e0e1bbcd25")
!577 = !DINamespace(name: "account_info", scope: !116)
!578 = !{!579, !581, !583, !584, !595, !605, !606, !607}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !576, file: !2, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Pubkey", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "is_signer", scope: !576, file: !2, baseType: !582, size: 8, align: 8, offset: 320)
!582 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "is_writable", scope: !576, file: !2, baseType: !582, size: 8, align: 8, offset: 328)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lamports", scope: !576, file: !2, baseType: !585, size: 64, align: 64, offset: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut u64>>", scope: !440, file: !2, size: 64, align: 64, elements: !586, templateParams: !502, identifier: "6ef7b15072feeefd759461885cf3019e")
!586 = !{!587, !593}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !585, file: !2, baseType: !588, size: 64, align: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !589, file: !2, size: 64, align: 64, elements: !590, templateParams: !506, identifier: "d2d32bd76a770e3b785a79f0ea18809c")
!589 = !DINamespace(name: "non_null", scope: !265)
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !588, file: !2, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut u64>>", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !585, file: !2, baseType: !594, align: 8)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", scope: !270, file: !2, align: 8, elements: !4, templateParams: !506, identifier: "b13e3795bbeaa5fcb9501203d2a3f0a3")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !576, file: !2, baseType: !596, size: 64, align: 64, offset: 128)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::RefCell<&mut [u8]>>", scope: !440, file: !2, size: 64, align: 64, elements: !597, templateParams: !474, identifier: "3be54905e4a87e92cc158a3b6326395f")
!597 = !{!598, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !596, file: !2, baseType: !599, size: 64, align: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !589, file: !2, size: 64, align: 64, elements: !600, templateParams: !478, identifier: "d4796e70143da55513d65b6d5d324f4e")
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !599, file: !2, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const RcBox<core::cell::RefCell<&mut [u8]>>", baseType: !439, size: 64, align: 64, dwarfAddressSpace: 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !596, file: !2, baseType: !604, align: 8)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", scope: !270, file: !2, align: 8, elements: !4, templateParams: !478, identifier: "be8bb6f9922b714c56ddf772f9c2429f")
!605 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !576, file: !2, baseType: !580, size: 64, align: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "executable", scope: !576, file: !2, baseType: !582, size: 8, align: 8, offset: 336)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rent_epoch", scope: !576, file: !2, baseType: !316, size: 64, align: 64, offset: 256)
!608 = !{!609}
!609 = !DILocalVariable(arg: 1, scope: !571, file: !572, line: 188, type: !575)
!610 = !{!611}
!611 = !DITemplateTypeParameter(name: "T", type: !576)
!612 = !DILocation(line: 188, column: 1, scope: !571)
!613 = distinct !DISubprogram(name: "drop_in_place<[solana_program::account_info::AccountInfo; 2]>", linkageName: "_ZN4core3ptr83drop_in_place$LT$$u5b$solana_program..account_info..AccountInfo$u3b$$u20$2$u5d$$GT$17h75e209ab0f496bf0E", scope: !265, file: !572, line: 188, type: !614, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !622, retainedNodes: !620)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut [solana_program::account_info::AccountInfo; 2]", baseType: !617, size: 64, align: 64, dwarfAddressSpace: 0)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 768, align: 64, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 2, lowerBound: 0)
!620 = !{!621}
!621 = !DILocalVariable(arg: 1, scope: !613, file: !572, line: 188, type: !616)
!622 = !{!623}
!623 = !DITemplateTypeParameter(name: "T", type: !617)
!624 = !DILocation(line: 188, column: 1, scope: !613)
!625 = distinct !DISubprogram(name: "drop_in_place<[solana_program::account_info::AccountInfo; 3]>", linkageName: "_ZN4core3ptr83drop_in_place$LT$$u5b$solana_program..account_info..AccountInfo$u3b$$u20$3$u5d$$GT$17h20b6d89c26859b9dE", scope: !265, file: !572, line: 188, type: !626, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !632, retainedNodes: !630)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut [solana_program::account_info::AccountInfo; 3]", baseType: !629, size: 64, align: 64, dwarfAddressSpace: 0)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1152, align: 64, elements: !98)
!630 = !{!631}
!631 = !DILocalVariable(arg: 1, scope: !625, file: !572, line: 188, type: !628)
!632 = !{!633}
!633 = !DITemplateTypeParameter(name: "T", type: !629)
!634 = !DILocation(line: 188, column: 1, scope: !625)
!635 = distinct !DISubprogram(name: "drop_in_place<[solana_program::account_info::AccountInfo; 4]>", linkageName: "_ZN4core3ptr83drop_in_place$LT$$u5b$solana_program..account_info..AccountInfo$u3b$$u20$4$u5d$$GT$17h450a7fe2fb1c89cbE", scope: !265, file: !572, line: 188, type: !636, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !644, retainedNodes: !642)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut [solana_program::account_info::AccountInfo; 4]", baseType: !639, size: 64, align: 64, dwarfAddressSpace: 0)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1536, align: 64, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 4, lowerBound: 0)
!642 = !{!643}
!643 = !DILocalVariable(arg: 1, scope: !635, file: !572, line: 188, type: !638)
!644 = !{!645}
!645 = !DITemplateTypeParameter(name: "T", type: !639)
!646 = !DILocation(line: 188, column: 1, scope: !635)
!647 = distinct !DISubprogram(name: "drop_in_place<alloc::rc::Rc<core::cell::RefCell<&mut u64>>>", linkageName: "_ZN4core3ptr84drop_in_place$LT$alloc..rc..Rc$LT$core..cell..RefCell$LT$$RF$mut$u20$u64$GT$$GT$$GT$17h4afc26db9c438599E", scope: !265, file: !572, line: 188, type: !648, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !653, retainedNodes: !651)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut Rc<core::cell::RefCell<&mut u64>>", baseType: !585, size: 64, align: 64, dwarfAddressSpace: 0)
!651 = !{!652}
!652 = !DILocalVariable(arg: 1, scope: !647, file: !572, line: 188, type: !650)
!653 = !{!654}
!654 = !DITemplateTypeParameter(name: "T", type: !585)
!655 = !DILocation(line: 188, column: 1, scope: !647)
!656 = distinct !DISubprogram(name: "cast<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>, u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$4cast17hc9e3a950203da9d1E", scope: !599, file: !657, line: 385, type: !658, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !665, retainedNodes: !663)
!657 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "c5d45e507157c14ac9b8f7e5ac0abc2b")
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !599}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !589, file: !2, size: 64, align: 64, elements: !661, templateParams: !271, identifier: "406fec2678b8bb45d8db3433ccc0ff79")
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !660, file: !2, baseType: !77, size: 64, align: 64)
!663 = !{!664}
!664 = !DILocalVariable(name: "self", arg: 1, scope: !656, file: !657, line: 385, type: !599)
!665 = !{!479, !666}
!666 = !DITemplateTypeParameter(name: "U", type: !25)
!667 = !DILocation(line: 385, column: 26, scope: !656)
!668 = !DILocation(line: 387, column: 41, scope: !656)
!669 = !DILocation(line: 387, column: 18, scope: !656)
!670 = !DILocation(line: 388, column: 6, scope: !656)
!671 = distinct !DISubprogram(name: "cast<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>, u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$4cast17hced07d964d7e7783E", scope: !588, file: !657, line: 385, type: !672, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !676, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{!660, !588}
!674 = !{!675}
!675 = !DILocalVariable(name: "self", arg: 1, scope: !671, file: !657, line: 385, type: !588)
!676 = !{!507, !666}
!677 = !DILocation(line: 385, column: 26, scope: !671)
!678 = !DILocation(line: 387, column: 41, scope: !671)
!679 = !DILocation(line: 387, column: 18, scope: !671)
!680 = !DILocation(line: 388, column: 6, scope: !671)
!681 = distinct !DISubprogram(name: "drop_in_place<alloc::rc::Rc<core::cell::RefCell<&mut [u8]>>>", linkageName: "_ZN4core3ptr93drop_in_place$LT$alloc..rc..Rc$LT$core..cell..RefCell$LT$$RF$mut$u20$$u5b$u8$u5d$$GT$$GT$$GT$17h9720d0ff808d0339E", scope: !265, file: !572, line: 188, type: !682, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !687, retainedNodes: !685)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut Rc<core::cell::RefCell<&mut [u8]>>", baseType: !596, size: 64, align: 64, dwarfAddressSpace: 0)
!685 = !{!686}
!686 = !DILocalVariable(arg: 1, scope: !681, file: !572, line: 188, type: !684)
!687 = !{!688}
!688 = !DITemplateTypeParameter(name: "T", type: !596)
!689 = !DILocation(line: 188, column: 1, scope: !681)
!690 = distinct !DISubprogram(name: "len", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$3len17h4599e2124372f230E", scope: !692, file: !691, line: 144, type: !694, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !696)
!691 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "b7b520611187314acaad1212020f8f10")
!692 = !DINamespace(name: "{impl#0}", scope: !693)
!693 = !DINamespace(name: "str", scope: !129)
!694 = !DISubroutineType(types: !695)
!695 = !{!79, !74}
!696 = !{!697}
!697 = !DILocalVariable(name: "self", arg: 1, scope: !690, file: !691, line: 144, type: !74)
!698 = !DILocation(line: 144, column: 22, scope: !690)
!699 = !DILocalVariable(name: "self", arg: 1, scope: !700, file: !691, line: 235, type: !74)
!700 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17h965286b1f8aa9597E", scope: !692, file: !691, line: 235, type: !701, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !707)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !74}
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !704, templateParams: !4, identifier: "585202bcfc7dfd1dd72e8befe2491ee4")
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !703, file: !2, baseType: !77, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !703, file: !2, baseType: !79, size: 64, align: 64, offset: 64)
!707 = !{!699}
!708 = !DILocation(line: 235, column: 27, scope: !700, inlinedAt: !709)
!709 = distinct !DILocation(line: 145, column: 9, scope: !690)
!710 = !DILocation(line: 237, column: 18, scope: !700, inlinedAt: !709)
!711 = !DILocation(line: 238, column: 6, scope: !700, inlinedAt: !709)
!712 = !DILocation(line: 145, column: 9, scope: !690)
!713 = !DILocation(line: 146, column: 6, scope: !690)
!714 = distinct !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$6as_ptr17hbe490c23c6018626E", scope: !692, file: !691, line: 308, type: !715, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!77, !74}
!717 = !{!718}
!718 = !DILocalVariable(name: "self", arg: 1, scope: !714, file: !691, line: 308, type: !74)
!719 = !DILocation(line: 308, column: 25, scope: !714)
!720 = !DILocation(line: 309, column: 9, scope: !714)
!721 = !DILocation(line: 310, column: 6, scope: !714)
!722 = distinct !DISubprogram(name: "from_utf8_unchecked", linkageName: "_ZN4core3str8converts19from_utf8_unchecked17hf1e4d1edbb0c3050E", scope: !724, file: !723, line: 161, type: !725, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !727)
!723 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "6dc06e04abe21bfc38810894182da58e")
!724 = !DINamespace(name: "converts", scope: !693)
!725 = !DISubroutineType(types: !726)
!726 = !{!74, !703}
!727 = !{!728}
!728 = !DILocalVariable(name: "v", arg: 1, scope: !722, file: !723, line: 161, type: !703)
!729 = !DILocation(line: 161, column: 41, scope: !722)
!730 = !DILocation(line: 164, column: 14, scope: !722)
!731 = !DILocation(line: 165, column: 2, scope: !722)
!732 = distinct !DISubprogram(name: "from_size_align_unchecked", linkageName: "_ZN4core5alloc6layout6Layout25from_size_align_unchecked17h2e05f152e322cbf8E", scope: !734, file: !733, line: 98, type: !740, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !742)
!733 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/alloc/layout.rs", directory: "", checksumkind: CSK_MD5, checksum: "b4b6ecfc5f3b5a48d9382f58835da573")
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !735, file: !2, size: 128, align: 64, elements: !737, templateParams: !4, identifier: "f69d3395c48d400fe21824ae0e4df080")
!735 = !DINamespace(name: "layout", scope: !736)
!736 = !DINamespace(name: "alloc", scope: !129)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "size_", scope: !734, file: !2, baseType: !79, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "align_", scope: !734, file: !2, baseType: !552, size: 64, align: 64, offset: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!734, !79, !79}
!742 = !{!743, !744}
!743 = !DILocalVariable(name: "size", arg: 1, scope: !732, file: !733, line: 98, type: !79)
!744 = !DILocalVariable(name: "align", arg: 2, scope: !732, file: !733, line: 98, type: !79)
!745 = !DILocation(line: 98, column: 51, scope: !732)
!746 = !DILocation(line: 98, column: 64, scope: !732)
!747 = !DILocation(line: 100, column: 48, scope: !732)
!748 = !DILocation(line: 100, column: 9, scope: !732)
!749 = !DILocation(line: 101, column: 6, scope: !732)
!750 = distinct !DISubprogram(name: "size", linkageName: "_ZN4core5alloc6layout6Layout4size17h83709176a142bbefE", scope: !734, file: !733, line: 107, type: !751, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !754)
!751 = !DISubroutineType(types: !752)
!752 = !{!79, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Layout", baseType: !734, size: 64, align: 64, dwarfAddressSpace: 0)
!754 = !{!755}
!755 = !DILocalVariable(name: "self", arg: 1, scope: !750, file: !733, line: 107, type: !753)
!756 = !DILocation(line: 107, column: 23, scope: !750)
!757 = !DILocation(line: 108, column: 9, scope: !750)
!758 = !DILocation(line: 109, column: 6, scope: !750)
!759 = distinct !DISubprogram(name: "align", linkageName: "_ZN4core5alloc6layout6Layout5align17ha26032fe44b43326E", scope: !734, file: !733, line: 115, type: !751, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !760)
!760 = !{!761}
!761 = !DILocalVariable(name: "self", arg: 1, scope: !759, file: !733, line: 115, type: !753)
!762 = !DILocation(line: 115, column: 24, scope: !759)
!763 = !DILocation(line: 116, column: 9, scope: !759)
!764 = !DILocation(line: 117, column: 6, scope: !759)
!765 = distinct !DISubprogram(name: "dangling", linkageName: "_ZN4core5alloc6layout6Layout8dangling17h41f59100ee6bfaf6E", scope: !734, file: !733, line: 187, type: !766, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{!660, !753}
!768 = !{!769}
!769 = !DILocalVariable(name: "self", arg: 1, scope: !765, file: !733, line: 187, type: !753)
!770 = !DILocation(line: 187, column: 27, scope: !765)
!771 = !DILocation(line: 189, column: 41, scope: !765)
!772 = !DILocation(line: 189, column: 18, scope: !765)
!773 = !DILocation(line: 190, column: 6, scope: !765)
!774 = distinct !DISubprogram(name: "for_value<alloc::rc::RcBox<core::cell::RefCell<&mut [u8]>>>", linkageName: "_ZN4core5alloc6layout6Layout9for_value17h78597239a103c83eE", scope: !734, file: !733, line: 137, type: !775, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !478, retainedNodes: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{!734, !438}
!777 = !{!778, !779, !781}
!778 = !DILocalVariable(name: "t", arg: 1, scope: !774, file: !733, line: 137, type: !438)
!779 = !DILocalVariable(name: "size", scope: !780, file: !733, line: 138, type: !79, align: 8)
!780 = distinct !DILexicalBlock(scope: !774, file: !733, line: 138, column: 9)
!781 = !DILocalVariable(name: "align", scope: !780, file: !733, line: 138, type: !79, align: 8)
!782 = !DILocation(line: 137, column: 33, scope: !774)
!783 = !DILocation(line: 138, column: 30, scope: !774)
!784 = !DILocation(line: 138, column: 51, scope: !774)
!785 = !DILocation(line: 138, column: 29, scope: !774)
!786 = !DILocation(line: 138, column: 14, scope: !774)
!787 = !DILocation(line: 138, column: 14, scope: !780)
!788 = !DILocation(line: 138, column: 20, scope: !774)
!789 = !DILocation(line: 138, column: 20, scope: !780)
!790 = !DILocation(line: 141, column: 18, scope: !780)
!791 = !DILocation(line: 142, column: 6, scope: !774)
!792 = distinct !DISubprogram(name: "for_value<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", linkageName: "_ZN4core5alloc6layout6Layout9for_value17hee00c5f224955cc8E", scope: !734, file: !733, line: 137, type: !793, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !506, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{!734, !486}
!795 = !{!796, !797, !799}
!796 = !DILocalVariable(name: "t", arg: 1, scope: !792, file: !733, line: 137, type: !486)
!797 = !DILocalVariable(name: "size", scope: !798, file: !733, line: 138, type: !79, align: 8)
!798 = distinct !DILexicalBlock(scope: !792, file: !733, line: 138, column: 9)
!799 = !DILocalVariable(name: "align", scope: !798, file: !733, line: 138, type: !79, align: 8)
!800 = !DILocation(line: 137, column: 33, scope: !792)
!801 = !DILocation(line: 138, column: 30, scope: !792)
!802 = !DILocation(line: 138, column: 51, scope: !792)
!803 = !DILocation(line: 138, column: 29, scope: !792)
!804 = !DILocation(line: 138, column: 14, scope: !792)
!805 = !DILocation(line: 138, column: 14, scope: !798)
!806 = !DILocation(line: 138, column: 20, scope: !792)
!807 = !DILocation(line: 138, column: 20, scope: !798)
!808 = !DILocation(line: 141, column: 18, scope: !798)
!809 = !DILocation(line: 142, column: 6, scope: !792)
!810 = distinct !DISubprogram(name: "clone", linkageName: "_ZN4core5clone5impls52_$LT$impl$u20$core..clone..Clone$u20$for$u20$u64$GT$5clone17h8d15434dbd9830d9E", scope: !812, file: !811, line: 183, type: !815, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !818)
!811 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/core/src/clone.rs", directory: "", checksumkind: CSK_MD5, checksum: "234b7513444e11fc1c70a64cfc2357fe")
!812 = !DINamespace(name: "{impl#9}", scope: !813)
!813 = !DINamespace(name: "impls", scope: !814)
!814 = !DINamespace(name: "clone", scope: !129)
!815 = !DISubroutineType(types: !816)
!816 = !{!316, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!818 = !{!819}
!819 = !DILocalVariable(name: "self", arg: 1, scope: !810, file: !811, line: 183, type: !817)
!820 = !DILocation(line: 183, column: 30, scope: !810)
!821 = !DILocation(line: 184, column: 25, scope: !810)
!822 = !DILocation(line: 185, column: 22, scope: !810)
!823 = distinct !DISubprogram(name: "clone", linkageName: "_ZN4core5clone5impls53_$LT$impl$u20$core..clone..Clone$u20$for$u20$bool$GT$5clone17hc47d7f9bbe4f8b17E", scope: !824, file: !811, line: 183, type: !825, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !828)
!824 = !DINamespace(name: "{impl#19}", scope: !813)
!825 = !DISubroutineType(types: !826)
!826 = !{!582, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !582, size: 64, align: 64, dwarfAddressSpace: 0)
!828 = !{!829}
!829 = !DILocalVariable(name: "self", arg: 1, scope: !823, file: !811, line: 183, type: !827)
!830 = !DILocation(line: 183, column: 30, scope: !823)
!831 = !DILocation(line: 184, column: 25, scope: !823)
!832 = !DILocation(line: 185, column: 22, scope: !823)
!833 = distinct !DISubprogram(name: "unwrap<alloc::vec::Vec<u8, alloc::alloc::Global>, std::io::error::Error>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$6unwrap17hfe695998e1a5d618E", scope: !834, file: !162, line: 1296, type: !849, scopeLine: 1296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !842, retainedNodes: !859)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<alloc::vec::Vec<u8, alloc::alloc::Global>, std::io::error::Error>", scope: !128, file: !2, size: 256, align: 64, elements: !835, identifier: "223f47b23f80c39eeaf5ac5a718dca7d")
!835 = !{!836}
!836 = !DICompositeType(tag: DW_TAG_variant_part, scope: !128, file: !2, size: 256, align: 64, elements: !837, templateParams: !842, identifier: "223f47b23f80c39eeaf5ac5a718dca7d_variant_part", discriminator: !848)
!837 = !{!838, !844}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !836, file: !2, baseType: !839, size: 256, align: 64, extraData: i64 0)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !834, file: !2, size: 256, align: 64, elements: !840, templateParams: !842, identifier: "223f47b23f80c39eeaf5ac5a718dca7d::Ok")
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !839, file: !2, baseType: !255, size: 192, align: 64, offset: 64)
!842 = !{!843, !177}
!843 = !DITemplateTypeParameter(name: "T", type: !255)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !836, file: !2, baseType: !845, size: 256, align: 64, extraData: i64 1)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !834, file: !2, size: 256, align: 64, elements: !846, templateParams: !842, identifier: "223f47b23f80c39eeaf5ac5a718dca7d::Err")
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !845, file: !2, baseType: !5, size: 128, align: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !2, baseType: !316, size: 64, align: 64, flags: DIFlagArtificial)
!849 = !DISubroutineType(types: !850)
!850 = !{!255, !834, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Location", baseType: !852, size: 64, align: 64, dwarfAddressSpace: 0)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !853, file: !2, size: 192, align: 64, elements: !855, templateParams: !4, identifier: "9f9749776572719cc82f4bbe4f5eb8d")
!853 = !DINamespace(name: "location", scope: !854)
!854 = !DINamespace(name: "panic", scope: !129)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !852, file: !2, baseType: !74, size: 128, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !852, file: !2, baseType: !297, size: 32, align: 32, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !852, file: !2, baseType: !297, size: 32, align: 32, offset: 160)
!859 = !{!860, !861, !863}
!860 = !DILocalVariable(name: "self", arg: 1, scope: !833, file: !162, line: 1296, type: !834)
!861 = !DILocalVariable(name: "t", scope: !862, file: !162, line: 1298, type: !255, align: 8)
!862 = distinct !DILexicalBlock(scope: !833, file: !162, line: 1298, column: 13)
!863 = !DILocalVariable(name: "e", scope: !864, file: !162, line: 1299, type: !5, align: 8)
!864 = distinct !DILexicalBlock(scope: !833, file: !162, line: 1299, column: 13)
!865 = !DILocation(line: 1298, column: 16, scope: !862)
!866 = !DILocation(line: 1296, column: 19, scope: !833)
!867 = !DILocation(line: 1299, column: 17, scope: !864)
!868 = !DILocation(line: 1297, column: 15, scope: !833)
!869 = !{i64 0, i64 2}
!870 = !DILocation(line: 1297, column: 9, scope: !833)
!871 = !DILocation(line: 1298, column: 16, scope: !833)
!872 = !DILocation(line: 1301, column: 6, scope: !833)
!873 = !DILocation(line: 1299, column: 17, scope: !833)
!874 = !DILocation(line: 1299, column: 84, scope: !864)
!875 = !DILocation(line: 1299, column: 23, scope: !864)
!876 = distinct !DISubprogram(name: "map_err<spl_associated_token_account::instruction::AssociatedTokenAccountInstruction, std::io::error::Error, solana_program::program_error::ProgramError, spl_associated_token_account::processor::process_instruction::{closure#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h266878220ab4444dE", scope: !213, file: !162, line: 850, type: !877, scopeLine: 850, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !954, retainedNodes: !947)
!877 = !DISubroutineType(types: !878)
!878 = !{!879, !213, !944}
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<spl_associated_token_account::instruction::AssociatedTokenAccountInstruction, solana_program::program_error::ProgramError>", scope: !128, file: !2, size: 256, align: 64, elements: !880, identifier: "fdbd33773aa0101744e7b733c0920fb1")
!880 = !{!881}
!881 = !DICompositeType(tag: DW_TAG_variant_part, scope: !128, file: !2, size: 256, align: 64, elements: !882, templateParams: !887, identifier: "fdbd33773aa0101744e7b733c0920fb1_variant_part", discriminator: !943)
!882 = !{!883, !939}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !881, file: !2, baseType: !884, size: 256, align: 64, extraData: i64 20)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !879, file: !2, size: 256, align: 64, elements: !885, templateParams: !887, identifier: "fdbd33773aa0101744e7b733c0920fb1::Ok")
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !884, file: !2, baseType: !221, align: 8)
!887 = !{!229, !888}
!888 = !DITemplateTypeParameter(name: "E", type: !889)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProgramError", scope: !890, file: !2, size: 256, align: 64, elements: !891, identifier: "14e28924a5bbfb62cb524b675ea2c03a")
!890 = !DINamespace(name: "program_error", scope: !116)
!891 = !{!892}
!892 = !DICompositeType(tag: DW_TAG_variant_part, scope: !890, file: !2, size: 256, align: 64, elements: !893, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a_variant_part", discriminator: !938)
!893 = !{!894, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922, !924, !928, !930, !932, !934, !936}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !892, file: !2, baseType: !895, size: 256, align: 64, extraData: i64 0)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !889, file: !2, size: 256, align: 64, elements: !896, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::Custom")
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !895, file: !2, baseType: !297, size: 32, align: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidArgument", scope: !892, file: !2, baseType: !899, size: 256, align: 64, extraData: i64 1)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidArgument", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidArgument")
!900 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidInstructionData", scope: !892, file: !2, baseType: !901, size: 256, align: 64, extraData: i64 2)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidInstructionData", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidInstructionData")
!902 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidAccountData", scope: !892, file: !2, baseType: !903, size: 256, align: 64, extraData: i64 3)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidAccountData", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidAccountData")
!904 = !DIDerivedType(tag: DW_TAG_member, name: "AccountDataTooSmall", scope: !892, file: !2, baseType: !905, size: 256, align: 64, extraData: i64 4)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountDataTooSmall", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountDataTooSmall")
!906 = !DIDerivedType(tag: DW_TAG_member, name: "InsufficientFunds", scope: !892, file: !2, baseType: !907, size: 256, align: 64, extraData: i64 5)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "InsufficientFunds", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InsufficientFunds")
!908 = !DIDerivedType(tag: DW_TAG_member, name: "IncorrectProgramId", scope: !892, file: !2, baseType: !909, size: 256, align: 64, extraData: i64 6)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "IncorrectProgramId", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::IncorrectProgramId")
!910 = !DIDerivedType(tag: DW_TAG_member, name: "MissingRequiredSignature", scope: !892, file: !2, baseType: !911, size: 256, align: 64, extraData: i64 7)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "MissingRequiredSignature", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::MissingRequiredSignature")
!912 = !DIDerivedType(tag: DW_TAG_member, name: "AccountAlreadyInitialized", scope: !892, file: !2, baseType: !913, size: 256, align: 64, extraData: i64 8)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountAlreadyInitialized", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountAlreadyInitialized")
!914 = !DIDerivedType(tag: DW_TAG_member, name: "UninitializedAccount", scope: !892, file: !2, baseType: !915, size: 256, align: 64, extraData: i64 9)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "UninitializedAccount", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::UninitializedAccount")
!916 = !DIDerivedType(tag: DW_TAG_member, name: "NotEnoughAccountKeys", scope: !892, file: !2, baseType: !917, size: 256, align: 64, extraData: i64 10)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotEnoughAccountKeys", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::NotEnoughAccountKeys")
!918 = !DIDerivedType(tag: DW_TAG_member, name: "AccountBorrowFailed", scope: !892, file: !2, baseType: !919, size: 256, align: 64, extraData: i64 11)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountBorrowFailed", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountBorrowFailed")
!920 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSeedLengthExceeded", scope: !892, file: !2, baseType: !921, size: 256, align: 64, extraData: i64 12)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxSeedLengthExceeded", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::MaxSeedLengthExceeded")
!922 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidSeeds", scope: !892, file: !2, baseType: !923, size: 256, align: 64, extraData: i64 13)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidSeeds", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidSeeds")
!924 = !DIDerivedType(tag: DW_TAG_member, name: "BorshIoError", scope: !892, file: !2, baseType: !925, size: 256, align: 64, extraData: i64 14)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorshIoError", scope: !889, file: !2, size: 256, align: 64, elements: !926, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::BorshIoError")
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !925, file: !2, baseType: !252, size: 192, align: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "AccountNotRentExempt", scope: !892, file: !2, baseType: !929, size: 256, align: 64, extraData: i64 15)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccountNotRentExempt", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::AccountNotRentExempt")
!930 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedSysvar", scope: !892, file: !2, baseType: !931, size: 256, align: 64, extraData: i64 16)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsupportedSysvar", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::UnsupportedSysvar")
!932 = !DIDerivedType(tag: DW_TAG_member, name: "IllegalOwner", scope: !892, file: !2, baseType: !933, size: 256, align: 64, extraData: i64 17)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "IllegalOwner", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::IllegalOwner")
!934 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAccountsDataSizeExceeded", scope: !892, file: !2, baseType: !935, size: 256, align: 64, extraData: i64 18)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaxAccountsDataSizeExceeded", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::MaxAccountsDataSizeExceeded")
!936 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidRealloc", scope: !892, file: !2, baseType: !937, size: 256, align: 64, extraData: i64 19)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidRealloc", scope: !889, file: !2, size: 256, align: 64, elements: !4, templateParams: !4, identifier: "14e28924a5bbfb62cb524b675ea2c03a::InvalidRealloc")
!938 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !2, baseType: !297, size: 32, align: 32, flags: DIFlagArtificial)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !881, file: !2, baseType: !940, size: 256, align: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !879, file: !2, size: 256, align: 64, elements: !941, templateParams: !887, identifier: "fdbd33773aa0101744e7b733c0920fb1::Err")
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !940, file: !2, baseType: !889, size: 256, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !2, baseType: !297, size: 32, align: 32, flags: DIFlagArtificial)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !945, file: !2, align: 8, elements: !4, templateParams: !4, identifier: "340b930c40db8872cc258d1a13e0047e")
!945 = !DINamespace(name: "process_instruction", scope: !946)
!946 = !DINamespace(name: "processor", scope: !112)
!947 = !{!948, !949, !950, !952}
!948 = !DILocalVariable(name: "self", arg: 1, scope: !876, file: !162, line: 850, type: !213)
!949 = !DILocalVariable(name: "op", arg: 2, scope: !876, file: !162, line: 850, type: !944)
!950 = !DILocalVariable(name: "t", scope: !951, file: !162, line: 852, type: !221, align: 1)
!951 = distinct !DILexicalBlock(scope: !876, file: !162, line: 852, column: 13)
!952 = !DILocalVariable(name: "e", scope: !953, file: !162, line: 853, type: !5, align: 8)
!953 = distinct !DILexicalBlock(scope: !876, file: !162, line: 853, column: 13)
!954 = !{!229, !177, !955, !956}
!955 = !DITemplateTypeParameter(name: "F", type: !889)
!956 = !DITemplateTypeParameter(name: "O", type: !944)
!957 = !DILocation(line: 850, column: 42, scope: !876)
!958 = !DILocation(line: 850, column: 48, scope: !876)
!959 = !DILocation(line: 852, column: 16, scope: !951)
!960 = !DILocation(line: 853, column: 17, scope: !953)
!961 = !DILocation(line: 851, column: 15, scope: !876)
!962 = !{i8 0, i8 5}
!963 = !DILocation(line: 851, column: 9, scope: !876)
!964 = !DILocation(line: 852, column: 22, scope: !951)
!965 = !DILocation(line: 852, column: 26, scope: !876)
!966 = !DILocation(line: 853, column: 17, scope: !876)
!967 = !DILocation(line: 853, column: 27, scope: !953)
!968 = !DILocation(line: 853, column: 30, scope: !953)
!969 = !DILocation(line: 853, column: 23, scope: !953)
!970 = !DILocation(line: 853, column: 32, scope: !876)
!971 = !DILocation(line: 855, column: 5, scope: !876)
!972 = !DILocation(line: 855, column: 6, scope: !876)
!973 = distinct !DISubprogram(name: "deserialize", linkageName: "_ZN50_$LT$u8$u20$as$u20$borsh..de..BorshDeserialize$GT$11deserialize17hf64c378b79f461d1E", scope: !975, file: !974, line: 64, type: !978, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !4, retainedNodes: !994)
!974 = !DIFile(filename: "/home/chinedum/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.9.3/src/de/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "303aa1381b1745aa225b11e7df7cf8dd")
!975 = !DINamespace(name: "{impl#0}", scope: !976)
!976 = !DINamespace(name: "de", scope: !977)
!977 = !DINamespace(name: "borsh", scope: null)
!978 = !DISubroutineType(types: !979)
!979 = !{!980, !993}
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, std::io::error::Error>", scope: !128, file: !2, size: 192, align: 64, elements: !981, identifier: "d8e03c8f62b233f08ef5773c278b28b5")
!981 = !{!982}
!982 = !DICompositeType(tag: DW_TAG_variant_part, scope: !128, file: !2, size: 192, align: 64, elements: !983, templateParams: !988, identifier: "d8e03c8f62b233f08ef5773c278b28b5_variant_part", discriminator: !182)
!983 = !{!984, !989}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !982, file: !2, baseType: !985, size: 192, align: 64, extraData: i64 0)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !980, file: !2, size: 192, align: 64, elements: !986, templateParams: !988, identifier: "d8e03c8f62b233f08ef5773c278b28b5::Ok")
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !985, file: !2, baseType: !25, size: 8, align: 8, offset: 8)
!988 = !{!272, !177}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !982, file: !2, baseType: !990, size: 192, align: 64, extraData: i64 1)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !980, file: !2, size: 192, align: 64, elements: !991, templateParams: !988, identifier: "d8e03c8f62b233f08ef5773c278b28b5::Err")
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !990, file: !2, baseType: !5, size: 128, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &[u8]", baseType: !703, size: 64, align: 64, dwarfAddressSpace: 0)
!994 = !{!995, !996}
!995 = !DILocalVariable(name: "buf", arg: 1, scope: !973, file: !974, line: 64, type: !993)
!996 = !DILocalVariable(name: "res", scope: !997, file: !974, line: 71, type: !25, align: 1)
!997 = distinct !DILexicalBlock(scope: !973, file: !974, line: 71, column: 9)
!998 = !DILocation(line: 64, column: 20, scope: !973)
!999 = !DILocation(line: 65, column: 12, scope: !973)
!1000 = !DILocation(line: 71, column: 19, scope: !973)
!1001 = !DILocation(line: 67, column: 17, scope: !973)
!1002 = !DILocation(line: 66, column: 24, scope: !973)
!1003 = !{i8 0, i8 41}
!1004 = !DILocation(line: 66, column: 20, scope: !973)
!1005 = !DILocation(line: 74, column: 6, scope: !973)
!1006 = !DILocation(line: 71, column: 13, scope: !997)
!1007 = !DILocation(line: 72, column: 17, scope: !997)
!1008 = !DILocation(line: 72, column: 21, scope: !997)
!1009 = !DILocation(line: 72, column: 9, scope: !997)
!1010 = !DILocation(line: 73, column: 9, scope: !997)
!1011 = distinct !DISubprogram(name: "dec_strong<alloc::rc::RcBox<core::cell::RefCell<&mut u64>>>", linkageName: "_ZN5alloc2rc10RcInnerPtr10dec_strong17h5da1afb1bfe4864eE", scope: !1013, file: !1012, line: 2454, type: !1014, scopeLine: 2454, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !124, templateParams: !1018, retainedNodes: !1016)
!1012 = !DIFile(filename: "/home/runner/work/bpf-tools/bpf-tools/out/rust/library/alloc/src/rc.rs", directory: "", checksumkind: CSK_MD5, checksum: "42ef3aa04540c7ef412941a8184eeb06")
!1013 = !DINamespace(name: "RcInnerPtr", scope: !440)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !486}
!1016 = !{!1017}
!1017 = !DILocalVariable(name: "self", arg: 1, scope: !1011, file: !1012, line: 2454, type: !486)
!1018 = !{!1019}
